
Функция ПолучитьРезультатыЗапроса(мДатаНачала, мДатаОкончания) Экспорт
	
	СпрИсточники 		= Справочники.ИсточникиОбращений;
	СпрТипыОбращений 	= Справочники.ТипыОбращенийПокупателей;
	СпрТипыЖалоб 		= Справочники.ТипыЖалоб;
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"		, мДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, мДатаОкончания);
	Запрос.УстановитьПараметр("ИсточникОбращенияВозвратПокупателя"	, СпрИсточники.НайтиПоКоду("13"));
	Запрос.УстановитьПараметр("ИсточникОбращенияСписаниеПоКачеству"	, СпрИсточники.НайтиПоКоду("14"));
	Запрос.УстановитьПараметр("ТипОбращения01"	, СпрТипыОбращений.НайтиПоКоду("201"));
	Запрос.УстановитьПараметр("ТипОбращения02"	, СпрТипыОбращений.НайтиПоКоду("202"));
	Запрос.УстановитьПараметр("ТипОбращения03"	, СпрТипыОбращений.НайтиПоКоду("203"));
	Запрос.УстановитьПараметр("ТипОбращения04"	, СпрТипыОбращений.НайтиПоКоду("204"));
	Запрос.УстановитьПараметр("ТипОбращения05"	, СпрТипыОбращений.НайтиПоКоду("205"));
	Запрос.УстановитьПараметр("ТипОбращения06"	, СпрТипыОбращений.НайтиПоКоду("206"));
	Запрос.УстановитьПараметр("ТипОбращения07"	, СпрТипыОбращений.НайтиПоКоду("207"));
	Запрос.УстановитьПараметр("ТипОбращения08"	, СпрТипыОбращений.НайтиПоКоду("208"));
	Запрос.УстановитьПараметр("ТипОбращения09"	, СпрТипыОбращений.НайтиПоКоду("209"));
	Запрос.УстановитьПараметр("ТипОбращения10"	, СпрТипыОбращений.НайтиПоКоду("210"));
	Запрос.УстановитьПараметр("ТипОбращения11"	, СпрТипыОбращений.НайтиПоКоду("211"));
	Запрос.УстановитьПараметр("ТипОбращения12"	, СпрТипыОбращений.НайтиПоКоду("212"));
	Запрос.УстановитьПараметр("ТипОбращения13"	, СпрТипыОбращений.НайтиПоКоду("213"));
	Запрос.УстановитьПараметр("ТипОбращения14"	, СпрТипыОбращений.НайтиПоКоду("214"));
	Запрос.УстановитьПараметр("ТипОбращения15"	, СпрТипыОбращений.НайтиПоКоду("165"));
	Запрос.УстановитьПараметр("ТипОбращения16"	, СпрТипыОбращений.НайтиПоКоду("163"));
	Запрос.УстановитьПараметр("ТипОбращения17"	, СпрТипыОбращений.НайтиПоКоду("215"));
	//+++АК mika 2018.06.19 ИП-00018998 Добавление новый типов
	Запрос.УстановитьПараметр("ТипОбращения18"	, СпрТипыОбращений.НайтиПоКоду("278")); //18 Диетология
	Запрос.УстановитьПараметр("ТипОбращения19"	, СпрТипыОбращений.НайтиПоКоду("117")); //19_Оценки в боте
	Запрос.УстановитьПараметр("ТипОбращения20"	, СпрТипыОбращений.НайтиПоКоду("198")); //20_Доставка
	Запрос.УстановитьПараметр("ТипОбращения21"	, СпрТипыОбращений.НайтиПоКоду("317")); //21 Экология
	//---АК mika
	//+++АК SHEP 2018.08.15 ИП-00019446 у нас добавились новые типы для выгрузки - 22,23,24
	Запрос.УстановитьПараметр("ТипОбращения22"	, СпрТипыОбращений.НайтиПоКоду("319")); //22 Бот/Приложение/Сайт
	Запрос.УстановитьПараметр("ТипОбращения23"	, СпрТипыОбращений.НайтиПоКоду("320")); //23 Народный гурман
	Запрос.УстановитьПараметр("ТипОбращения24"	, СпрТипыОбращений.НайтиПоКоду("321")); //24 Другие акции
	//---АК SHEP 2018.08.15
	
	Запрос.УстановитьПараметр("ТипЖалобы01_10"	, СпрТипыЖалоб.НайтиПоКоду("190"));
	Запрос.УстановитьПараметр("ТипЖалобы01_11"	, СпрТипыЖалоб.НайтиПоКоду("236"));
	Запрос.УстановитьПараметр("ТипЖалобы01_2"	, СпрТипыЖалоб.НайтиПоКоду("198"));
	Запрос.УстановитьПараметр("ТипЖалобы01_3"	, СпрТипыЖалоб.НайтиПоКоду("197"));
	Запрос.УстановитьПараметр("ТипЖалобы01_4"	, СпрТипыЖалоб.НайтиПоКоду("196"));
	Запрос.УстановитьПараметр("ТипЖалобы01_5"	, СпрТипыЖалоб.НайтиПоКоду("195"));
	Запрос.УстановитьПараметр("ТипЖалобы01_6"	, СпрТипыЖалоб.НайтиПоКоду("194"));
	Запрос.УстановитьПараметр("ТипЖалобы01_7"	, СпрТипыЖалоб.НайтиПоКоду("193"));
	Запрос.УстановитьПараметр("ТипЖалобы01_8"	, СпрТипыЖалоб.НайтиПоКоду("192"));
	Запрос.УстановитьПараметр("ТипЖалобы01_9"	, СпрТипыЖалоб.НайтиПоКоду("191"));
	Запрос.УстановитьПараметр("ТипЖалобы02_1"	, СпрТипыЖалоб.НайтиПоКоду("200"));
	Запрос.УстановитьПараметр("ТипЖалобы02_2"	, СпрТипыЖалоб.НайтиПоКоду("201"));
	Запрос.УстановитьПараметр("ТипЖалобы02_3"	, СпрТипыЖалоб.НайтиПоКоду("189"));
	Запрос.УстановитьПараметр("ТипЖалобы02_4"	, СпрТипыЖалоб.НайтиПоКоду("202"));
	Запрос.УстановитьПараметр("ТипЖалобы02_5"	, СпрТипыЖалоб.НайтиПоКоду("188"));
	Запрос.УстановитьПараметр("ТипЖалобы02_6"	, СпрТипыЖалоб.НайтиПоКоду("206"));
	Запрос.УстановитьПараметр("ТипЖалобы03_1_1"	, СпрТипыЖалоб.НайтиПоКоду("203"));
	Запрос.УстановитьПараметр("ТипЖалобы03_1_2"	, СпрТипыЖалоб.НайтиПоКоду("153"));
	Запрос.УстановитьПараметр("ТипЖалобы03_2"	, СпрТипыЖалоб.НайтиПоКоду("204"));
	Запрос.УстановитьПараметр("ТипЖалобы03_3"	, СпрТипыЖалоб.НайтиПоКоду("205"));
	Запрос.УстановитьПараметр("ТипЖалобы05_2"	, СпрТипыЖалоб.НайтиПоКоду("207"));
	Запрос.УстановитьПараметр("ТипЖалобы05_3"	, СпрТипыЖалоб.НайтиПоКоду("208"));
	Запрос.УстановитьПараметр("ТипЖалобы05_4"	, СпрТипыЖалоб.НайтиПоКоду("209"));
	Запрос.УстановитьПараметр("ТипЖалобы06_1"	, СпрТипыЖалоб.НайтиПоКоду("210"));
	Запрос.УстановитьПараметр("ТипЖалобы06_10"	, СпрТипыЖалоб.НайтиПоКоду("254"));
	Запрос.УстановитьПараметр("ТипЖалобы06_11"	, СпрТипыЖалоб.НайтиПоКоду("255"));
	Запрос.УстановитьПараметр("ТипЖалобы06_12"	, СпрТипыЖалоб.НайтиПоКоду("256"));
	Запрос.УстановитьПараметр("ТипЖалобы06_2"	, СпрТипыЖалоб.НайтиПоКоду("211"));
	Запрос.УстановитьПараметр("ТипЖалобы06_3"	, СпрТипыЖалоб.НайтиПоКоду("212"));
	Запрос.УстановитьПараметр("ТипЖалобы06_4"	, СпрТипыЖалоб.НайтиПоКоду("213"));
	Запрос.УстановитьПараметр("ТипЖалобы06_5"	, СпрТипыЖалоб.НайтиПоКоду("214"));
	Запрос.УстановитьПараметр("ТипЖалобы06_6"	, СпрТипыЖалоб.НайтиПоКоду("187"));
	Запрос.УстановитьПараметр("ТипЖалобы06_7"	, СпрТипыЖалоб.НайтиПоКоду("115"));
	Запрос.УстановитьПараметр("ТипЖалобы06_8"	, СпрТипыЖалоб.НайтиПоКоду("216"));
	Запрос.УстановитьПараметр("ТипЖалобы06_9"	, СпрТипыЖалоб.НайтиПоКоду("252"));
	Запрос.УстановитьПараметр("ТипЖалобы08_1"	, СпрТипыЖалоб.НайтиПоКоду("217"));
	Запрос.УстановитьПараметр("ТипЖалобы08_2"	, СпрТипыЖалоб.НайтиПоКоду("218"));
	Запрос.УстановитьПараметр("ТипЖалобы08_3"	, СпрТипыЖалоб.НайтиПоКоду("138"));
	Запрос.УстановитьПараметр("ТипЖалобы08_4"	, СпрТипыЖалоб.НайтиПоКоду("257"));
	Запрос.УстановитьПараметр("ТипЖалобы09_1"	, СпрТипыЖалоб.НайтиПоКоду("219"));
	Запрос.УстановитьПараметр("ТипЖалобы09_2"	, СпрТипыЖалоб.НайтиПоКоду("220"));
	Запрос.УстановитьПараметр("ТипЖалобы09_3"	, СпрТипыЖалоб.НайтиПоКоду("238"));
	Запрос.УстановитьПараметр("ТипЖалобы10_1"	, СпрТипыЖалоб.НайтиПоКоду("221"));
	Запрос.УстановитьПараметр("ТипЖалобы10_2"	, СпрТипыЖалоб.НайтиПоКоду("222"));
	Запрос.УстановитьПараметр("ТипЖалобы11_1"	, СпрТипыЖалоб.НайтиПоКоду("223"));
	Запрос.УстановитьПараметр("ТипЖалобы11_2"	, СпрТипыЖалоб.НайтиПоКоду("224"));
	Запрос.УстановитьПараметр("ТипЖалобы11_3"	, СпрТипыЖалоб.НайтиПоКоду("225"));
	Запрос.УстановитьПараметр("ТипЖалобы11_4"	, СпрТипыЖалоб.НайтиПоКоду("226"));
	Запрос.УстановитьПараметр("ТипЖалобы12_1"	, СпрТипыЖалоб.НайтиПоКоду("228"));
	Запрос.УстановитьПараметр("ТипЖалобы12_2"	, СпрТипыЖалоб.НайтиПоКоду("229"));
	Запрос.УстановитьПараметр("ТипЖалобы12_3"	, СпрТипыЖалоб.НайтиПоКоду("230"));
	Запрос.УстановитьПараметр("ТипЖалобы12_4"	, СпрТипыЖалоб.НайтиПоКоду("259"));
	Запрос.УстановитьПараметр("ТипЖалобы12_5"	, СпрТипыЖалоб.НайтиПоКоду("263"));
	Запрос.УстановитьПараметр("ТипЖалобы14_1"	, СпрТипыЖалоб.НайтиПоКоду("233"));
	Запрос.УстановитьПараметр("ТипЖалобы14_2"	, СпрТипыЖалоб.НайтиПоКоду("234"));
	Запрос.УстановитьПараметр("ТипЖалобы14_3"	, СпрТипыЖалоб.НайтиПоКоду("235"));
	Запрос.УстановитьПараметр("ТипЖалобы15_1"	, СпрТипыЖалоб.НайтиПоКоду("186"));
	Запрос.УстановитьПараметр("ТипЖалобы15_2"	, СпрТипыЖалоб.НайтиПоКоду("185"));
	Запрос.УстановитьПараметр("ТипЖалобы15_3"	, СпрТипыЖалоб.НайтиПоКоду("184"));
	Запрос.УстановитьПараметр("ТипЖалобы16_1"	, СпрТипыЖалоб.НайтиПоКоду("241"));
	Запрос.УстановитьПараметр("ТипЖалобы16_2"	, СпрТипыЖалоб.НайтиПоКоду("242"));
	Запрос.УстановитьПараметр("ТипЖалобы16_3"	, СпрТипыЖалоб.НайтиПоКоду("243"));
	Запрос.УстановитьПараметр("ТипЖалобы16_4"	, СпрТипыЖалоб.НайтиПоКоду("244"));
	Запрос.УстановитьПараметр("ТипЖалобы17_1"	, СпрТипыЖалоб.НайтиПоКоду("245"));
	Запрос.УстановитьПараметр("ТипЖалобы17_2"	, СпрТипыЖалоб.НайтиПоКоду("247"));
	Запрос.УстановитьПараметр("ТипЖалобы17_3"	, СпрТипыЖалоб.НайтиПоКоду("246"));
	Запрос.УстановитьПараметр("ТипЖалобы17_4"	, СпрТипыЖалоб.НайтиПоКоду("248"));
	//+++АК mika 2018.06.19 ИП-00018998 Добавление новый типов
	Запрос.УстановитьПараметр("ТипЖалобы18_1"	, СпрТипыЖалоб.ПустаяСсылка()); //Состояние на 2018.06.19 (в спр. Классификация жалоб ни одного типа жалоб «18»)
	Запрос.УстановитьПараметр("ТипЖалобы19_1", СпрТипыЖалоб.НайтиПоКоду("117")); //19_1 Оценки в боте
	Запрос.УстановитьПараметр("ТипЖалобы20_1", СпрТипыЖалоб.НайтиПоКоду("321")); //20_1 Инстамарт
	Запрос.УстановитьПараметр("ТипЖалобы20_2", СпрТипыЖалоб.НайтиПоКоду("322")); //20_2 СейвТайм
	Запрос.УстановитьПараметр("ТипЖалобы21_1", СпрТипыЖалоб.НайтиПоКоду("317")); //21_1 Экология
	//---АК mika 
	//+++АК SHEP 2018.08.15 ИП-00019446
	Запрос.УстановитьПараметр("ТипЖалобы22_1"	, СпрТипыЖалоб.НайтиПоКоду("343")); // 22_1 Приложение
	Запрос.УстановитьПараметр("ТипЖалобы22_2"	, СпрТипыЖалоб.НайтиПоКоду("344")); // 22_2 Бот
	Запрос.УстановитьПараметр("ТипЖалобы22_3"	, СпрТипыЖалоб.НайтиПоКоду("345")); // 22_3 Сайт
	Запрос.УстановитьПараметр("ТипЖалобы22_4"	, СпрТипыЖалоб.НайтиПоКоду("346")); // 22_4 Благодарность
	Запрос.УстановитьПараметр("ТипЖалобы23_1"	, СпрТипыЖалоб.НайтиПоКоду("347")); // 23_1 Жалоба
	Запрос.УстановитьПараметр("ТипЖалобы23_2"	, СпрТипыЖалоб.НайтиПоКоду("348")); // 23_2 Предложение
	Запрос.УстановитьПараметр("ТипЖалобы23_3"	, СпрТипыЖалоб.НайтиПоКоду("349")); // 23_3 Благодарность
	Запрос.УстановитьПараметр("ТипЖалобы24_1"	, СпрТипыЖалоб.НайтиПоКоду("350")); // 24_1 Жалоба
	Запрос.УстановитьПараметр("ТипЖалобы24_2"	, СпрТипыЖалоб.НайтиПоКоду("351")); // 24_2 Предложение
	Запрос.УстановитьПараметр("ТипЖалобы24_3"	, СпрТипыЖалоб.НайтиПоКоду("352")); // 24_3 Благодарность
	//---АК SHEP 2018.08.15
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбращенияПокупателей.ТипОбращения КАК ТипОбращения,
	|	ОбращенияПокупателей.ДатаДок КАК ДатаОбращения,
	|	ОбращенияПокупателей.ИсточникОбращения КАК Источник,
	|	ОбращенияПокупателей.РезультатОбращения КАК Результат,
	|	ОбращенияПокупателей.ТипЖалобы.Наименование КАК ТипЖалобы,
	|	ОбращенияПокупателей.ТипЖалобы.Код КАК ТипЖалобыКод,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_10
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_10,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_11
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_11,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_5
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_5,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_6
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_6,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_7
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_7,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_8
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_8,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы01_9
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы01_9,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_5
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_5,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы02_6
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы02_6,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы03_1_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы03_1_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы03_1_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы03_1_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы03_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы03_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы03_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы03_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы05_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы05_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы05_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы05_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы05_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы05_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_10
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_10,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_11
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_11,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_12
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_12,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_5
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_5,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_6
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_6,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_7
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_7,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_8
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_8,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы06_9
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы06_9,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы08_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы08_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы08_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы08_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы08_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы08_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы08_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы08_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы09_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы09_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы09_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы09_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы09_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы09_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы10_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы10_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы10_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы10_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы11_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы11_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы11_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы11_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы11_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы11_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы11_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы11_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы12_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы12_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы12_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы12_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы12_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы12_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы12_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы12_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы12_5
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы12_5,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы14_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы14_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы14_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы14_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы14_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы14_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы15_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы15_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы15_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы15_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы15_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы15_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы16_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы16_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы16_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы16_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы16_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы16_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы16_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы16_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы17_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы17_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы17_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы17_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы17_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы17_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы17_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы17_4,
	//+++АК mika 2018.06.19 ИП-00018998 Добавление новый типов
	//По ТипЖалобы18_1 все жалобы классифицированы без типа (т.е. по типу обращения)
	//|	ВЫБОР
	//|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы18_1
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ТипЖалобы18_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипОбращения = &ТипОбращения18
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы18_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы19_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы19_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы20_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы20_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы20_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы20_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы21_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы21_1,
	//---АК mika
	//+++АК SHEP 2018.08.15 ИП-00019446
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы22_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы22_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы22_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы22_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы22_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы22_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы22_4
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы22_4,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы23_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы23_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы23_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы23_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы23_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы23_3,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы24_1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы24_1,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы24_2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы24_2,
	|	ВЫБОР
	|		КОГДА ОбращенияПокупателей.ТипЖалобы = &ТипЖалобы24_3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипЖалобы24_3,
	//---АК SHEP 2018.08.15
	|	ОбращенияПокупателей.ТипВключения КАК ТипВключения,
	|	ОбращенияПокупателей.СтатусЖалобы КАК СтатусЖалобы,
	|	ОбращенияПокупателей.Примечание КАК Описание,
	|	ОбращенияПокупателей.СтруктурнаяЕдиница КАК ТТ,
	|	ОбращенияПокупателей.Номенклатура КАК Товар,
	|	ОбращенияПокупателей.Производитель КАК Производитель,
	|	ОбращенияПокупателей.ОтветПроизводителя КАК ОтветПроизводителя,
	|	ОбращенияПокупателей.Технолог КАК Технолог,
	|	ОбращенияПокупателей.ПродактМенеджер КАК Продакт,
	|	ОбращенияПокупателей.Продавец1 КАК Продавец1,
	|	ОбращенияПокупателей.Продавец2 КАК Продавец2
	|ПОМЕСТИТЬ ВТ_Обращения
	|ИЗ
	|	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
	|ГДЕ
	|	ОбращенияПокупателей.ДатаДок МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ОбращенияПокупателей.ТипОбращения = ЗНАЧЕНИЕ(Справочник.ТипыОбращенийПокупателей.ПустаяСсылка)
	|	И НЕ ОбращенияПокупателей.ИсточникОбращения = &ИсточникОбращенияВозвратПокупателя
	|	И НЕ ОбращенияПокупателей.ИсточникОбращения = &ИсточникОбращенияСписаниеПоКачеству
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ТипОбращения КАК ТипОбращения_Об,
	|	ВТ_Обращения.Источник КАК ИсточникОбращения_Об,
	|	СУММА(1) КАК Количество_Об
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипОбращения,
	|	ВТ_Обращения.Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки,
	|	""Всего обращений"" КАК ТипЖалобы01_Ит,
	|	0 КАК Это01_10,
	|	0 КАК Это01_11,
	|	0 КАК Это01_2,
	|	0 КАК Это01_3,
	|	0 КАК Это01_4,
	|	0 КАК Это01_5,
	|	0 КАК Это01_6,
	|	0 КАК Это01_7,
	|	0 КАК Это01_8,
	|	0 КАК Это01_9,
	|	СУММА(1) КАК Количество01_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения01
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения01
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы01_10,
	|	ВТ_Обращения.ТипЖалобы01_11,
	|	ВТ_Обращения.ТипЖалобы01_2,
	|	ВТ_Обращения.ТипЖалобы01_3,
	|	ВТ_Обращения.ТипЖалобы01_4,
	|	ВТ_Обращения.ТипЖалобы01_5,
	|	ВТ_Обращения.ТипЖалобы01_6,
	|	ВТ_Обращения.ТипЖалобы01_7,
	|	ВТ_Обращения.ТипЖалобы01_8,
	|	ВТ_Обращения.ТипЖалобы01_9,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения01
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы01_10,
	|	ВТ_Обращения.ТипЖалобы01_11,
	|	ВТ_Обращения.ТипЖалобы01_2,
	|	ВТ_Обращения.ТипЖалобы01_3,
	|	ВТ_Обращения.ТипЖалобы01_4,
	|	ВТ_Обращения.ТипЖалобы01_5,
	|	ВТ_Обращения.ТипЖалобы01_6,
	|	ВТ_Обращения.ТипЖалобы01_7,
	|	ВТ_Обращения.ТипЖалобы01_8,
	|	ВТ_Обращения.ТипЖалобы01_9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_01,
	|	ВТ_Обращения.Источник КАК Источник_01,
	|	ВТ_Обращения.Результат КАК Результат_01,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_01,
	|	ВТ_Обращения.ТипЖалобы01_10,
	|	ВТ_Обращения.ТипЖалобы01_11,
	|	ВТ_Обращения.ТипЖалобы01_2,
	|	ВТ_Обращения.ТипЖалобы01_3,
	|	ВТ_Обращения.ТипЖалобы01_4,
	|	ВТ_Обращения.ТипЖалобы01_5,
	|	ВТ_Обращения.ТипЖалобы01_6,
	|	ВТ_Обращения.ТипЖалобы01_7,
	|	ВТ_Обращения.ТипЖалобы01_8,
	|	ВТ_Обращения.ТипЖалобы01_9,
	|	ВТ_Обращения.ТипВключения КАК ТипВключения_01,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_01,
	|	ВТ_Обращения.Описание КАК Описание_01,
	|	ВТ_Обращения.ТТ КАК ТТ_01,
	|	ВТ_Обращения.Товар КАК Товар_01,
	|	ВТ_Обращения.Производитель КАК Производитель_01,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_01,
	|	ВТ_Обращения.Технолог КАК Технолог_01,
	|	ВТ_Обращения.Продакт КАК Продакт_01
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения01
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_02,
	|	""Всего обращений"" КАК ТипЖалобы02_Ит,
	|	0 КАК Это02_1,
	|	0 КАК Это02_2,
	|	0 КАК Это02_3,
	|	0 КАК Это02_4,
	|	0 КАК Это02_5,
	|	0 КАК Это02_6,
	|	СУММА(1) КАК Количество02_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения02
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения02
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы02_1,
	|	ВТ_Обращения.ТипЖалобы02_2,
	|	ВТ_Обращения.ТипЖалобы02_3,
	|	ВТ_Обращения.ТипЖалобы02_4,
	|	ВТ_Обращения.ТипЖалобы02_5,
	|	ВТ_Обращения.ТипЖалобы02_6,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения02
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы02_1,
	|	ВТ_Обращения.ТипЖалобы02_2,
	|	ВТ_Обращения.ТипЖалобы02_3,
	|	ВТ_Обращения.ТипЖалобы02_4,
	|	ВТ_Обращения.ТипЖалобы02_5,
	|	ВТ_Обращения.ТипЖалобы02_6
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_02,
	|	ВТ_Обращения.Источник КАК Источник_02,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_02,
	|	ВТ_Обращения.ТипЖалобы02_1,
	|	ВТ_Обращения.ТипЖалобы02_2,
	|	ВТ_Обращения.ТипЖалобы02_3,
	|	ВТ_Обращения.ТипЖалобы02_4,
	|	ВТ_Обращения.ТипЖалобы02_5,
	|	ВТ_Обращения.ТипЖалобы02_6,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_02,
	|	ВТ_Обращения.Описание КАК Описание_02,
	|	ВТ_Обращения.ТТ КАК ТТ_02,
	|	ВТ_Обращения.Товар КАК Товар_02,
	|	ВТ_Обращения.Производитель КАК Производитель_02,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_02,
	|	ВТ_Обращения.Технолог КАК Технолог_02,
	|	ВТ_Обращения.Продакт КАК Продакт_02
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения02
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_03,
	|	""Всего обращений"" КАК ТипЖалобы03_Ит,
	|	0 КАК Это03_1_1,
	|	0 КАК Это03_1_2,
	|	0 КАК Это03_2,
	|	0 КАК Это03_3,
	|	СУММА(1) КАК Количество03_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения03
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения03
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы03_1_1,
	|	ВТ_Обращения.ТипЖалобы03_1_2,
	|	ВТ_Обращения.ТипЖалобы03_2,
	|	ВТ_Обращения.ТипЖалобы03_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения03
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы03_1_1,
	|	ВТ_Обращения.ТипЖалобы03_1_2,
	|	ВТ_Обращения.ТипЖалобы03_2,
	|	ВТ_Обращения.ТипЖалобы03_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_03,
	|	ВТ_Обращения.Источник КАК Источник_03,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_03,
	|	ВТ_Обращения.ТипЖалобы03_1_1,
	|	ВТ_Обращения.ТипЖалобы03_1_2,
	|	ВТ_Обращения.ТипЖалобы03_2,
	|	ВТ_Обращения.ТипЖалобы03_3,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_03,
	|	ВТ_Обращения.Описание КАК Описание_03,
	|	ВТ_Обращения.ТТ КАК ТТ_03,
	|	ВТ_Обращения.Товар КАК Товар_03,
	|	ВТ_Обращения.Производитель КАК Производитель_03,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_03,
	|	ВТ_Обращения.Технолог КАК Технолог_03,
	|	ВТ_Обращения.Продакт КАК Продакт_03
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения03
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_04,
	|	""Всего обращений"" КАК ТипЖалобы04_Ит,
	|	СУММА(1) КАК Количество04_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения04
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения04
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения04
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_04,
	|	ВТ_Обращения.Источник КАК Источник_04,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_04,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_04,
	|	ВТ_Обращения.Описание КАК Описание_04,
	|	ВТ_Обращения.ТТ КАК ТТ_04,
	|	ВТ_Обращения.Товар КАК Товар_04,
	|	ВТ_Обращения.Производитель КАК Производитель_04,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_04,
	|	ВТ_Обращения.Технолог КАК Технолог_04,
	|	ВТ_Обращения.Продакт КАК Продакт_04
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения04
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_05,
	|	""Всего обращений"" КАК ТипЖалобы05_Ит,
	|	0 КАК Это05_2,
	|	0 КАК Это05_3,
	|	0 КАК Это05_4,
	|	СУММА(1) КАК Количество05_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения05
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения05
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы05_2,
	|	ВТ_Обращения.ТипЖалобы05_3,
	|	ВТ_Обращения.ТипЖалобы05_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения05
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы05_2,
	|	ВТ_Обращения.ТипЖалобы05_3,
	|	ВТ_Обращения.ТипЖалобы05_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_05,
	|	ВТ_Обращения.Источник КАК Источник_05,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_05,
	|	ВТ_Обращения.ТипЖалобы05_2,
	|	ВТ_Обращения.ТипЖалобы05_3,
	|	ВТ_Обращения.ТипЖалобы05_4,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_05,
	|	ВТ_Обращения.Описание КАК Описание_05,
	|	ВТ_Обращения.ТТ КАК ТТ_05,
	|	ВТ_Обращения.Товар КАК Товар_05,
	|	ВТ_Обращения.Производитель КАК Производитель_05,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_05
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения05
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_06,
	|	""Всего обращений"" КАК ТипЖалобы06_Ит,
	|	0 КАК Это06_1,
	|	0 КАК Это06_10,
	|	0 КАК Это06_11,
	|	0 КАК Это06_12,
	|	0 КАК Это06_2,
	|	0 КАК Это06_3,
	|	0 КАК Это06_4,
	|	0 КАК Это06_5,
	|	0 КАК Это06_6,
	|	0 КАК Это06_7,
	|	0 КАК Это06_8,
	|	0 КАК Это06_9,
	|	СУММА(1) КАК Количество06_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения06
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения06
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы06_1,
	|	ВТ_Обращения.ТипЖалобы06_10,
	|	ВТ_Обращения.ТипЖалобы06_11,
	|	ВТ_Обращения.ТипЖалобы06_12,
	|	ВТ_Обращения.ТипЖалобы06_2,
	|	ВТ_Обращения.ТипЖалобы06_3,
	|	ВТ_Обращения.ТипЖалобы06_4,
	|	ВТ_Обращения.ТипЖалобы06_5,
	|	ВТ_Обращения.ТипЖалобы06_6,
	|	ВТ_Обращения.ТипЖалобы06_7,
	|	ВТ_Обращения.ТипЖалобы06_8,
	|	ВТ_Обращения.ТипЖалобы06_9,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения06
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы06_1,
	|	ВТ_Обращения.ТипЖалобы06_10,
	|	ВТ_Обращения.ТипЖалобы06_11,
	|	ВТ_Обращения.ТипЖалобы06_12,
	|	ВТ_Обращения.ТипЖалобы06_2,
	|	ВТ_Обращения.ТипЖалобы06_3,
	|	ВТ_Обращения.ТипЖалобы06_4,
	|	ВТ_Обращения.ТипЖалобы06_5,
	|	ВТ_Обращения.ТипЖалобы06_6,
	|	ВТ_Обращения.ТипЖалобы06_7,
	|	ВТ_Обращения.ТипЖалобы06_8,
	|	ВТ_Обращения.ТипЖалобы06_9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_06,
	|	ВТ_Обращения.Источник КАК Источник_06,
	|	ВТ_Обращения.Результат КАК Результат_06,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_06,
	|	ВТ_Обращения.ТипЖалобы06_1,
	|	ВТ_Обращения.ТипЖалобы06_10,
	|	ВТ_Обращения.ТипЖалобы06_11,
	|	ВТ_Обращения.ТипЖалобы06_12,
	|	ВТ_Обращения.ТипЖалобы06_2,
	|	ВТ_Обращения.ТипЖалобы06_3,
	|	ВТ_Обращения.ТипЖалобы06_4,
	|	ВТ_Обращения.ТипЖалобы06_5,
	|	ВТ_Обращения.ТипЖалобы06_6,
	|	ВТ_Обращения.ТипЖалобы06_7,
	|	ВТ_Обращения.ТипЖалобы06_8,
	|	ВТ_Обращения.ТипЖалобы06_9,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_06,
	|	ВТ_Обращения.Описание КАК Описание_06,
	|	ВТ_Обращения.ТТ КАК ТТ_06,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_06,
	|	ВТ_Обращения.Продавец1 КАК Продавец1_06,
	|	ВТ_Обращения.Продавец2 КАК Продавец2_06
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения06
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Всего обращений"" КАК ТипЖалобы07_Ит,
	|	СУММА(1) КАК Количество07_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения07
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_07,
	|	ВТ_Обращения.Источник КАК Источник_07,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_07,
	|	ВТ_Обращения.Описание КАК Описание_07,
	|	ВТ_Обращения.Товар КАК Товар_07,
	|	ВТ_Обращения.Производитель КАК Производитель_07,
	|	ВТ_Обращения.Технолог КАК Технолог_07,
	|	ВТ_Обращения.Продакт КАК Продакт_07
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения07
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_08,
	|	""Всего обращений"" КАК ТипЖалобы08_Ит,
	|	0 КАК Это08_1,
	|	0 КАК Это08_2,
	|	0 КАК Это08_3,
	|	0 КАК Это08_4,
	|	СУММА(1) КАК Количество08_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения08
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения08
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы08_1,
	|	ВТ_Обращения.ТипЖалобы08_2,
	|	ВТ_Обращения.ТипЖалобы08_3,
	|	ВТ_Обращения.ТипЖалобы08_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения08
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы08_1,
	|	ВТ_Обращения.ТипЖалобы08_2,
	|	ВТ_Обращения.ТипЖалобы08_3,
	|	ВТ_Обращения.ТипЖалобы08_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_08,
	|	ВТ_Обращения.Источник КАК Источник_08,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_08,
	|	ВТ_Обращения.ТипЖалобы08_1,
	|	ВТ_Обращения.ТипЖалобы08_2,
	|	ВТ_Обращения.ТипЖалобы08_3,
	|	ВТ_Обращения.ТипЖалобы08_4,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_08,
	|	ВТ_Обращения.Описание КАК Описание_08,
	|	ВТ_Обращения.Товар КАК Товар_08,
	|	ВТ_Обращения.Производитель КАК Производитель_08,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_08,
	|	ВТ_Обращения.Технолог КАК Технолог_08,
	|	ВТ_Обращения.Продакт КАК Продакт_08
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения08
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_09,
	|	""Всего обращений"" КАК ТипЖалобы09_Ит,
	|	0 КАК Это09_1,
	|	0 КАК Это09_2,
	|	0 КАК Это09_3,
	|	СУММА(1) КАК Количество09_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения09
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения09
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы09_1,
	|	ВТ_Обращения.ТипЖалобы09_2,
	|	ВТ_Обращения.ТипЖалобы09_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения09
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы09_1,
	|	ВТ_Обращения.ТипЖалобы09_2,
	|	ВТ_Обращения.ТипЖалобы09_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_09,
	|	ВТ_Обращения.Источник КАК Источник_09,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_09,
	|	ВТ_Обращения.ТипЖалобы09_1,
	|	ВТ_Обращения.ТипЖалобы09_2,
	|	ВТ_Обращения.ТипЖалобы09_3,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_09,
	|	ВТ_Обращения.Описание КАК Описание_09,
	|	ВТ_Обращения.Товар КАК Товар_09,
	|	ВТ_Обращения.Производитель КАК Производитель_09,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_09,
	|	ВТ_Обращения.Технолог КАК Технолог_09,
	|	ВТ_Обращения.Продакт КАК Продакт_09
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения09
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_10,
	|	""Всего обращений"" КАК ТипЖалобы10_Ит,
	|	0 КАК Это10_1,
	|	0 КАК Это10_2,
	|	СУММА(1) КАК Количество10_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы10_1,
	|	ВТ_Обращения.ТипЖалобы10_2,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения10
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы10_1,
	|	ВТ_Обращения.ТипЖалобы10_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_10,
	|	ВТ_Обращения.Источник КАК Источник_10,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_10,
	|	ВТ_Обращения.ТипЖалобы10_1,
	|	ВТ_Обращения.ТипЖалобы10_2,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_10,
	|	ВТ_Обращения.Описание КАК Описание_10,
	|	ВТ_Обращения.ТТ КАК ТТ_10,
	|	ВТ_Обращения.Товар КАК Товар_10
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения10
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_11,
	|	""Всего обращений"" КАК ТипЖалобы11_Ит,
	|	0 КАК Это11_1,
	|	0 КАК Это11_2,
	|	0 КАК Это11_3,
	|	0 КАК Это11_4,
	|	СУММА(1) КАК Количество11_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы11_1,
	|	ВТ_Обращения.ТипЖалобы11_2,
	|	ВТ_Обращения.ТипЖалобы11_3,
	|	ВТ_Обращения.ТипЖалобы11_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения11
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы11_1,
	|	ВТ_Обращения.ТипЖалобы11_2,
	|	ВТ_Обращения.ТипЖалобы11_3,
	|	ВТ_Обращения.ТипЖалобы11_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_11,
	|	ВТ_Обращения.Источник КАК Источник_11,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_11,
	|	ВТ_Обращения.ТипЖалобы11_1,
	|	ВТ_Обращения.ТипЖалобы11_2,
	|	ВТ_Обращения.ТипЖалобы11_3,
	|	ВТ_Обращения.ТипЖалобы11_4,
	|	ВТ_Обращения.Описание КАК Описание_11,
	|	ВТ_Обращения.Товар КАК Товар_11,
	|	ВТ_Обращения.Производитель КАК Производитель_11
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения11
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_12,
	|	""Всего обращений"" КАК ТипЖалобы12_Ит,
	|	0 КАК Это12_1,
	|	0 КАК Это12_2,
	|	0 КАК Это12_3,
	|	0 КАК Это12_4,
	|	0 КАК Это12_5,
	|	СУММА(1) КАК Количество12_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы12_1,
	|	ВТ_Обращения.ТипЖалобы12_2,
	|	ВТ_Обращения.ТипЖалобы12_3,
	|	ВТ_Обращения.ТипЖалобы12_4,
	|	ВТ_Обращения.ТипЖалобы12_5,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения12
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы12_1,
	|	ВТ_Обращения.ТипЖалобы12_2,
	|	ВТ_Обращения.ТипЖалобы12_3,
	|	ВТ_Обращения.ТипЖалобы12_4,
	|	ВТ_Обращения.ТипЖалобы12_5
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_12,
	|	ВТ_Обращения.Источник КАК Источник_12,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_12,
	|	ВТ_Обращения.ТипЖалобы12_1,
	|	ВТ_Обращения.ТипЖалобы12_2,
	|	ВТ_Обращения.ТипЖалобы12_3,
	|	ВТ_Обращения.ТипЖалобы12_4,
	|	ВТ_Обращения.ТипЖалобы12_5,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_12,
	|	ВТ_Обращения.Описание КАК Описание_12
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения12
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Всего обращений"" КАК ТипЖалобы13_Ит,
	|	1 КАК ФлагСортировки_13,
	|	"""" КАК КодЖалобы13_Ит,
	|	СУММА(1) КАК Количество13_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения13
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Неподтверждённых"" КАК ТипЖалобы13_Ит,
	|	2 КАК ФлагСортировки_13,
	|	"""" КАК КодЖалобы13_Ит,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения13
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы13_Ит,
	|	3 КАК ФлагСортировки_13,
	|	ЕСТЬNULL(ВТ_Обращения.ТипЖалобыКод, """") КАК КодЖалобы13_Ит,
	|	СУММА(1) КАК Количество13_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения13
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ЕСТЬNULL(ВТ_Обращения.ТипЖалобыКод, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_13,
	|	ВТ_Обращения.Источник КАК Источник_13,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_13,
	|	ВТ_Обращения.Описание КАК Описание_13
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения13
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_14,
	|	""Всего обращений"" КАК ТипЖалобы14_Ит,
	|	0 КАК Это14_1,
	|	0 КАК Это14_2,
	|	0 КАК Это14_3,
	|	СУММА(1) КАК Количество14_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения14
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения14
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы14_1,
	|	ВТ_Обращения.ТипЖалобы14_2,
	|	ВТ_Обращения.ТипЖалобы14_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения14
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы14_1,
	|	ВТ_Обращения.ТипЖалобы14_2,
	|	ВТ_Обращения.ТипЖалобы14_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_14,
	|	ВТ_Обращения.Источник КАК Источник_14,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_14,
	|	ВТ_Обращения.ТипЖалобы14_1,
	|	ВТ_Обращения.ТипЖалобы14_2,
	|	ВТ_Обращения.ТипЖалобы14_3,
	|	ВТ_Обращения.Описание КАК Описание_14
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения14
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_15,
	|	""Всего обращений"" КАК ТипЖалобы15_Ит,
	|	0 КАК Это15_1,
	|	0 КАК Это15_2,
	|	0 КАК Это15_3,
	|	СУММА(1) КАК Количество15_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения15
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы15_1,
	|	ВТ_Обращения.ТипЖалобы15_2,
	|	ВТ_Обращения.ТипЖалобы15_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения15
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы15_1,
	|	ВТ_Обращения.ТипЖалобы15_2,
	|	ВТ_Обращения.ТипЖалобы15_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_15,
	|	ВТ_Обращения.Источник КАК Источник_15,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_15,
	|	ВТ_Обращения.ТипЖалобы15_1,
	|	ВТ_Обращения.ТипЖалобы15_2,
	|	ВТ_Обращения.ТипЖалобы15_3,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_15,
	|	ВТ_Обращения.Описание КАК Описание_15,
	|	ВТ_Обращения.ТТ КАК ТТ_15
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения15
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_16,
	|	""Всего обращений"" КАК ТипЖалобы16_Ит,
	|	0 КАК Это16_1,
	|	0 КАК Это16_2,
	|	0 КАК Это16_3,
	|	0 КАК Это16_4,
	|	СУММА(1) КАК Количество16_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения16
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения16
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы16_1,
	|	ВТ_Обращения.ТипЖалобы16_2,
	|	ВТ_Обращения.ТипЖалобы16_3,
	|	ВТ_Обращения.ТипЖалобы16_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения16
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы16_1,
	|	ВТ_Обращения.ТипЖалобы16_2,
	|	ВТ_Обращения.ТипЖалобы16_3,
	|	ВТ_Обращения.ТипЖалобы16_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_16,
	|	ВТ_Обращения.Источник КАК Источник_16,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_16,
	|	ВТ_Обращения.ТипЖалобы16_1,
	|	ВТ_Обращения.ТипЖалобы16_2,
	|	ВТ_Обращения.ТипЖалобы16_3,
	|	ВТ_Обращения.ТипЖалобы16_4,
	|	ВТ_Обращения.Описание КАК Описание_16
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения16
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_17,
	|	""Всего обращений"" КАК ТипЖалобы17_Ит,
	|	0 КАК Это17_1,
	|	0 КАК Это17_2,
	|	0 КАК Это17_3,
	|	0 КАК Это17_4,
	|	СУММА(1) КАК Количество17_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения17
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения17
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы17_1,
	|	ВТ_Обращения.ТипЖалобы17_2,
	|	ВТ_Обращения.ТипЖалобы17_3,
	|	ВТ_Обращения.ТипЖалобы17_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения17
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы17_1,
	|	ВТ_Обращения.ТипЖалобы17_2,
	|	ВТ_Обращения.ТипЖалобы17_3,
	|	ВТ_Обращения.ТипЖалобы17_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_17,
	|	ВТ_Обращения.Источник КАК Источник_17,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_17,
	|	ВТ_Обращения.ТипЖалобы17_1,
	|	ВТ_Обращения.ТипЖалобы17_2,
	|	ВТ_Обращения.ТипЖалобы17_3,
	|	ВТ_Обращения.ТипЖалобы17_4,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_17,
	|	ВТ_Обращения.Описание КАК Описание_17,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_17
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения17
	//+++АК mika 2018.06.19 ИП-00018998 Добавление новых типов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_18,
	|	""Всего обращений"" КАК ТипЖалобы18_Ит,
	|	0 КАК Это18_1,
	|	СУММА(1) КАК Количество18_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения18
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения18
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы18_1,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения18
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы18_1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_18,
	|	ВТ_Обращения.Источник КАК Источник_18,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_18,
	|	ВТ_Обращения.ТипЖалобы18_1 КАК ТипЖалобы18_1,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_18,
	|	ВТ_Обращения.Описание КАК Описание_18
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения18
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_19,
	|	""Всего обращений"" КАК ТипЖалобы19_Ит,
	|	0 КАК Это19_1,
	|	СУММА(1) КАК Количество19_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения19
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения19
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы19_1,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения19
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы19_1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_19,
	|	ВТ_Обращения.Источник КАК Источник_19,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_19,
	|	ВТ_Обращения.ТипЖалобы19_1 КАК ТипЖалобы19_1,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_19,
	|	ВТ_Обращения.Описание КАК Описание_19,
	|	ВТ_Обращения.ТТ КАК ТТ_19,
	|	ВТ_Обращения.Товар КАК Товар_19,
	|	ВТ_Обращения.Производитель КАК Производитель_19,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_19,
	|	ВТ_Обращения.Технолог КАК Технолог_19,
	|	ВТ_Обращения.Продакт КАК Продакт_19
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения19
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_20,
	|	""Всего обращений"" КАК ТипЖалобы20_Ит,
	|	0 КАК Это20_1,
	|	0 КАК Это20_2,
	|	СУММА(1) КАК Количество20_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы20_1,
	|	ВТ_Обращения.ТипЖалобы20_2,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения20
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы20_1,
	|	ВТ_Обращения.ТипЖалобы20_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_20,
	|	ВТ_Обращения.Источник КАК Источник_20,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_20,
	|	ВТ_Обращения.ТипЖалобы20_1,
	|	ВТ_Обращения.ТипЖалобы20_2,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_20,
	|	ВТ_Обращения.Описание КАК Описание_20,
	|	ВТ_Обращения.ТТ КАК ТТ_20,
	|	ВТ_Обращения.Товар КАК Товар_20,
	|	ВТ_Обращения.Производитель КАК Производитель_20,
	|	ВТ_Обращения.Технолог КАК Технолог_20,
	|	ВТ_Обращения.Продакт КАК Продакт_20
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_21,
	|	""Всего обращений"" КАК ТипЖалобы21_Ит,
	|	0 КАК Это21_1,
	|	СУММА(1) КАК Количество21_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы21_1,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения21
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы21_1
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_21,
	|	ВТ_Обращения.Источник КАК Источник_21,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_21,
	|	ВТ_Обращения.ТипЖалобы21_1 КАК ТипЖалобы21_1,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_21,
	|	ВТ_Обращения.Описание КАК Описание_21,
	|	ВТ_Обращения.ТТ КАК ТТ_21,
	|	ВТ_Обращения.Товар КАК Товар_21,
	|	ВТ_Обращения.Производитель КАК Производитель_21,
	|	ВТ_Обращения.ОтветПроизводителя КАК ОтветПроизводителя_21,
	|	ВТ_Обращения.Технолог КАК Технолог_21,
	|	ВТ_Обращения.Продакт КАК Продакт_21
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения21
	//---АК mika 
	//+++АК SHEP 2018.08.15 ИП-00019446
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_22,
	|	""Всего обращений"" КАК ТипЖалобы22_Ит,
	|	0 КАК Это22_1,
	|	0 КАК Это22_2,
	|	0 КАК Это22_3,
	|	0 КАК Это22_4,
	|	СУММА(1) КАК Количество22_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы22_1,
	|	ВТ_Обращения.ТипЖалобы22_2,
	|	ВТ_Обращения.ТипЖалобы22_3,
	|	ВТ_Обращения.ТипЖалобы22_4,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения22
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы22_1,
	|	ВТ_Обращения.ТипЖалобы22_2,
	|	ВТ_Обращения.ТипЖалобы22_3,
	|	ВТ_Обращения.ТипЖалобы22_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_22,
	|	ВТ_Обращения.Источник КАК Источник_22,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_22,
	|	ВТ_Обращения.ТипЖалобы22_1,
	|	ВТ_Обращения.ТипЖалобы22_2,
	|	ВТ_Обращения.ТипЖалобы22_3,
	|	ВТ_Обращения.ТипЖалобы22_4,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_22,
	|	ВТ_Обращения.Описание КАК Описание_22,
	|	ВТ_Обращения.ТТ КАК ТТ_22,
	|	ВТ_Обращения.Товар КАК Товар_22,
	|	ВТ_Обращения.Производитель КАК Производитель_22,
	|	ВТ_Обращения.Технолог КАК Технолог_22,
	|	ВТ_Обращения.Продакт КАК Продакт_22
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения22
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_23,
	|	""Всего обращений"" КАК ТипЖалобы23_Ит,
	|	0 КАК Это23_1,
	|	0 КАК Это23_2,
	|	0 КАК Это23_3,
	|	СУММА(1) КАК Количество23_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения23
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения23
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы23_1,
	|	ВТ_Обращения.ТипЖалобы23_2,
	|	ВТ_Обращения.ТипЖалобы23_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения23
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы23_1,
	|	ВТ_Обращения.ТипЖалобы23_2,
	|	ВТ_Обращения.ТипЖалобы23_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_23,
	|	ВТ_Обращения.Источник КАК Источник_23,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_23,
	|	ВТ_Обращения.ТипЖалобы23_1,
	|	ВТ_Обращения.ТипЖалобы23_2,
	|	ВТ_Обращения.ТипЖалобы23_3,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_23,
	|	ВТ_Обращения.Описание КАК Описание_23,
	|	ВТ_Обращения.ТТ КАК ТТ_23,
	|	ВТ_Обращения.Товар КАК Товар_23,
	|	ВТ_Обращения.Производитель КАК Производитель_23,
	|	ВТ_Обращения.Технолог КАК Технолог_23,
	|	ВТ_Обращения.Продакт КАК Продакт_23
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения23
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ФлагСортировки_24,
	|	""Всего обращений"" КАК ТипЖалобы24_Ит,
	|	0 КАК Это24_1,
	|	0 КАК Это24_2,
	|	0 КАК Это24_3,
	|	СУММА(1) КАК Количество24_Ит
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Неподтверждённых"",
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Обращения.СтатусЖалобы = ЗНАЧЕНИЕ(Перечисление.СтатусыЖалоб.Неподтверждена)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы24_1,
	|	ВТ_Обращения.ТипЖалобы24_2,
	|	ВТ_Обращения.ТипЖалобы24_3,
	|	СУММА(1)
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения24
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Обращения.ТипЖалобы,
	|	ВТ_Обращения.ТипЖалобы24_1,
	|	ВТ_Обращения.ТипЖалобы24_2,
	|	ВТ_Обращения.ТипЖалобы24_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обращения.ДатаОбращения КАК ДатаОбращения_24,
	|	ВТ_Обращения.Источник КАК Источник_24,
	|	ВТ_Обращения.ТипЖалобы КАК ТипЖалобы_24,
	|	ВТ_Обращения.ТипЖалобы24_1,
	|	ВТ_Обращения.ТипЖалобы24_2,
	|	ВТ_Обращения.ТипЖалобы24_3,
	|	ВТ_Обращения.СтатусЖалобы КАК СтатусЖалобы_24,
	|	ВТ_Обращения.Описание КАК Описание_24,
	|	ВТ_Обращения.ТТ КАК ТТ_24,
	|	ВТ_Обращения.Товар КАК Товар_24,
	|	ВТ_Обращения.Производитель КАК Производитель_24,
	|	ВТ_Обращения.Технолог КАК Технолог_24,
	|	ВТ_Обращения.Продакт КАК Продакт_24
	|ИЗ
	|	ВТ_Обращения КАК ВТ_Обращения
	|ГДЕ
	|	ВТ_Обращения.ТипОбращения = &ТипОбращения24
	//---АК SHEP 2018.08.15
	|";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции
