
Функция ПолучитьМакетКомпоновкиПоНаименованиюСхемы(ИмяМакета, ДанныеРасшифровки, ДатаНачала, ДатаОкончания)
	
	ТекСхема = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
	ТекНастройки = ТекСхема.НастройкиПоУмолчанию;
	
	ТекЭлементыПараметровДанных = ТекНастройки.ПараметрыДанных.Элементы;
	Для Каждого ЭлементНастроек Из ТекЭлементыПараметровДанных Цикл
		Если НЕ ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементНастроек.Параметр = Новый ПараметрКомпоновкиДанных("ДатаНачала") Тогда
			ЭлементНастроек.Значение = ДатаНачала;
		ИначеЕсли ЭлементНастроек.Параметр = Новый ПараметрКомпоновкиДанных("ДатаОкончания") Тогда
			ЭлементНастроек.Значение = ДатаОкончания;
		ИначеЕсли ЭлементНастроек.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
			ЭлементНастроек.Значение.ДатаНачала 	= ДатаНачала;
			ЭлементНастроек.Значение.ДатаОкончания 	= ДатаОкончания;
		КонецЕсли;
		//ЭлементНастроек.Использование = Истина;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Возврат КомпоновщикМакета.Выполнить(ТекСхема, ТекНастройки, ДанныеРасшифровки);
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДатаНачала 		= Дата(1, 1, 1);
	ДатаОкончания 	= Дата(1, 1, 1);
	
	мЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ПользПоле Из мЭлементыНастроек Цикл
		Если ТипЗнч(ПользПоле) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(ПользПоле.Параметр) = "Период" Тогда
				ДатаНачала 		= ПользПоле.Значение.ДатаНачала;
				ДатаОкончания 	= КонецДня(ПользПоле.Значение.ДатаОкончания);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//////////////////////////////
	// Получение данных и вывод //
	//////////////////////////////
	
	СтандартнаяОбработка = Ложь;
	
	РезультатыЗапроса = Отчеты.ОтчетПоОбращениямКлиентов_Сводный.ПолучитьРезультатыЗапроса(ДатаНачала, ДатаОкончания);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеОбщие", РезультатыЗапроса[1].Выгрузить());
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_Общий);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//+++АК SHEP 2018.08.15 ИП-00019446: сделал всё в цикле!!!
	#Область Старый_Мусор_БезЦикла
	//////   01
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_01"	, РезультатыЗапроса[2].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_01", РезультатыЗапроса[3].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема01", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_01);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   02
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_02"	, РезультатыЗапроса[4].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_02", РезультатыЗапроса[5].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема02", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_02);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   03
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_03"	, РезультатыЗапроса[6].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_03", РезультатыЗапроса[7].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема03", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_03);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   04
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_04"	, РезультатыЗапроса[8].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_04", РезультатыЗапроса[9].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема04", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_04);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   05
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_05"	, РезультатыЗапроса[10].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_05", РезультатыЗапроса[11].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема05", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_05);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   06
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_06"	, РезультатыЗапроса[12].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_06", РезультатыЗапроса[13].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема06", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_06);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   07
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_07"	, РезультатыЗапроса[14].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_07", РезультатыЗапроса[15].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема07", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_07);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   08
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_08"	, РезультатыЗапроса[16].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_08", РезультатыЗапроса[17].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема08", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_08);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   09
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_09"	, РезультатыЗапроса[18].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_09", РезультатыЗапроса[19].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема09", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_09);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   10
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_10"	, РезультатыЗапроса[20].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_10", РезультатыЗапроса[21].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема10", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_10);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   11
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_11"	, РезультатыЗапроса[22].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_11", РезультатыЗапроса[23].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема11", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_11);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   12
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_12"	, РезультатыЗапроса[24].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_12", РезультатыЗапроса[25].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема12", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_12);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   13
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_13"	, РезультатыЗапроса[26].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_13", РезультатыЗапроса[27].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема13", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_13);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   14
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_14"	, РезультатыЗапроса[28].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_14", РезультатыЗапроса[29].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема14", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_14);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   15
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_15"	, РезультатыЗапроса[30].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_15", РезультатыЗапроса[31].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема15", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_15);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   16
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_16"	, РезультатыЗапроса[32].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_16", РезультатыЗапроса[33].Выгрузить());
	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема16", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_16);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   17
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_17"	, РезультатыЗапроса[34].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_17", РезультатыЗапроса[35].Выгрузить());

	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема17", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_17);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	////+++АК mika 2018.06.19 ИП-00018998
	//
	//////   18 Диетология 
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_18"	, РезультатыЗапроса[36].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_18", РезультатыЗапроса[37].Выгрузить());

	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема18", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_18);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   19_Оценки в боте  
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_19"	, РезультатыЗапроса[38].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_19", РезультатыЗапроса[39].Выгрузить());

	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема19", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_19);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	//////   20_Доставка  
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_20"	, РезультатыЗапроса[40].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_20", РезультатыЗапроса[41].Выгрузить());

	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема20", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_20);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//////   21 Экология   
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Итоги_21"	, РезультатыЗапроса[42].Выгрузить());
	//ВнешниеНаборыДанных.Вставить("Данные_21", РезультатыЗапроса[43].Выгрузить());

	////Макет компоновки 
	//МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема21", ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
	////Компоновка данных
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	//
	////Вывод результата
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ЭтотОбъект.ТабДокумент_21);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	////---АК mika 
	#КонецОбласти
	
	НомерРезультатаЗапроса = 2;
	Для Сч = 1 По 24 Цикл
		СчСтр = Формат(Сч, "ЧЦ=2; ЧВН=");
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("Итоги_" + СчСтр, РезультатыЗапроса[НомерРезультатаЗапроса].Выгрузить());
		НомерРезультатаЗапроса = НомерРезультатаЗапроса + 1; 
		ВнешниеНаборыДанных.Вставить("Данные_" + СчСтр, РезультатыЗапроса[НомерРезультатаЗапроса].Выгрузить());
		НомерРезультатаЗапроса = НомерРезультатаЗапроса + 1; 

		//Макет компоновки 
		МакетКомпоновки = ПолучитьМакетКомпоновкиПоНаименованиюСхемы("Схема" + СчСтр, ДанныеРасшифровки, ДатаНачала, ДатаОкончания);
		//Компоновка данных
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		
		//Вывод результата
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ЭтотОбъект["ТабДокумент_" + СчСтр]);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	КонецЦикла;
	//---АК SHEP 2018.08.15
	
	//ПроцессорВывода.НачатьВывод();

	//ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	//Пока НЕ ЭлементРезультата = Неопределено Цикл
	//	Если ЭлементРезультата.ЗначенияПараметров.Количество() = 1 Тогда
	//		Если ЭлементРезультата.ЗначенияПараметров[0].Значение = "РазорватьСтраницу" Тогда
	//			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	//		КонецЕсли;
	//	КонецЕсли;
	//	ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	//	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	//КонецЦикла;
	//ПроцессорВывода.ЗакончитьВывод();	
	
КонецПроцедуры

