
&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
//	КнопкаВыполнитьНажатие();
	//+++АК KIRN 2018.08.21 ИП-00018130 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения	= Истина;
	ПараметрыОжидания.ТекстСообщения				= "Заполнение расходников по складу "+Объект.Склад;
	ПараметрыОжидания.ОповещениеПользователя.Показать	= Истина;
	ПараметрыОжидания.ОповещениеПользователя.Пояснение	= "Заполнение расходников по складу "+Объект.Склад;
	
	ДлительнаяОперация = КнопкаВыполнитьНажатие();
	Описание = Новый ОписаниеОповещения("ЗаполнениеРасходниковЗавершение",ЭтаФорма);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Описание, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеРасходниковЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Завершено "+ТекущаяДата()+" Статус задания: "+?(Результат=Неопределено,"Не выполнено",Результат.Статус+". Результат: "+ПолучитьИзВременногоХранилища(Результат.АдресРезультата)));
КонецПРоцедуры

&НаСервере
Функция КнопкаВыполнитьНажатие()
	ИмяМетода = "Обработки.ЗаполнитьРасходникиПоЗаданиямНаРазборку.ЗаполнитьРасходники";
	НаименованиеЗадания = "Заполнение расходников по складу "+Объект.Склад;
	
	ПараметрыЗадания = Новый Структура("Склад, ДатаРаспределения",Объект.Склад, Объект.ДатаРаспределения);
	
	// Запуск фонового задания
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыЗадания, ПараметрыВыполнения);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаРаспределения = ТекущаяДата()+86400;
КонецПроцедуры
