
Процедура УстановитьНаименование()
	
	Если ЗначениеЗаполнено(Объект.МестоВыкладки)
			И ЗначениеЗаполнено(Объект.Владелец) Тогда
		НаименованиеМагазина = Объект.Владелец.Наименование;
		КодМагазина = "";
		Для Сч=1 По СтрДлина(НаименованиеМагазина) Цикл
			Симв=Сред(НаименованиеМагазина,Сч,1);
			Если Найти("0123456789",Симв)<>0 Тогда
				КодМагазина=КодМагазина+Симв;
			Иначе	
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		КодМагазина = Прав("0000000" + КодМагазина, 4);
		
		Префикс = КодМагазина + "-" + Объект.МестоВыкладки.КодДляДатчиков;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", "%" + Префикс + "%");
		Запрос.УстановитьПараметр("Ссылка"		, Объект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Датчики.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Датчики КАК Датчики
		|ГДЕ
		|	Датчики.Наименование ПОДОБНО &Наименование
		|	И Датчики.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НаименованиеПоследнее = СокрЛП(ВыборкаДетальныеЗаписи.Наименование);
			ЦифраПосл = Прав(НаименованиеПоследнее, 1);
			Если Найти("01234567890", ЦифраПосл) > 0 Тогда
				ТекНомер = Число(ЦифраПосл) + 1;
			Иначе
				ТекНомер = 1;
			КонецЕсли; 
		Иначе
			ТекНомер = 1;
		КонецЕсли;   
		Объект.Наименование = Префикс + Строка(ТекНомер);	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    Если Параметры.Свойство("МестоВыкладки") Тогда
		     Объект.МестоВыкладки 	= Параметры.МестоВыкладки;
		КонецЕсли;
	    Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		     Объект.Владелец 		= Параметры.СтруктурнаяЕдиница;
		КонецЕсли;
	КонецЕсли;
	
	//ЭлементОтбора = ЭтаФорма.История.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Датчик");
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	//ЭтаФорма.История.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
	//+++АК SaMi 2018.11.16 ИП-00019767^01
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СоответствиеДатчиковИХолодильниковСрезПоследних.ОсновноеСредство
		|ИЗ
		|	РегистрСведений.СоответствиеДатчиковИХолодильников.СрезПоследних(, Датчик = &Датчик) КАК СоответствиеДатчиковИХолодильниковСрезПоследних");
		
		Запрос.УстановитьПараметр("Датчик", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОсновноеСредство = Выборка.ОсновноеСредство;
		КонецЕсли; 
	КонецЕсли; 
	//---АК SaMi  2018.11.16 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.Владелец) и ЗначениеЗаполнено(Объект.МестоВыкладки) Тогда
	//   ПослеЗаписиСервер();
	//   КонецЕсли;
	//ОповеститьОбИзменении(Мен.ИсходныйКлючЗаписи);
	////Кол=ЭтаФорма.История.Отбор.Элементы.Количество();
	////Для Сч=0 По Кол-1 Цикл
	////	 ЭтаФорма.История.Отбор.Элементы.Удалить(Кол-1-Сч);
	//// КонецЦикла;
	////ЭлементОтбора = ЭтаФорма.История.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Датчик");
	////ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	////ЭлементОтбора.Использование 	= Истина;
	////ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	
	//ЭтаФорма.История.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиСервер()
	
	//
	МенеджерЗаписи = РеквизитФормыВЗначение("Мен");
	МенеджерЗаписи.Магазин			= Объект.Владелец;
	МенеджерЗаписи.МестоВыкладки	= Объект.МестоВыкладки;
	МенеджерЗаписи.Датчик			= Объект.Ссылка;
	МенеджерЗаписи.Прочитать(); 
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Магазин			= Объект.Владелец;
		МенеджерЗаписи.МестоВыкладки	= Объект.МестоВыкладки;
		МенеджерЗаписи.Датчик			= Объект.Ссылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Мен");
	
КонецПроцедуры


&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоВыкладкиПриИзменении(Элемент)
	
	УстановитьНаименование();
	
КонецПроцедуры
 
&НаКлиенте
Процедура Сформировать()
	ЗаполнитьНаСервере();
	
	ТД = СформироватьНаСервере();
	//ТД.Показать();
	ТабДок=ТД;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение("10.0.0.40");
	
	Если ADOСоединение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДатаОкончание=КонецМесяца(ТекущаяДата());
	ДатаНачала=НачалоМесяца(ТекущаяДата());
	ТекстЗапросаSQL = "SELECT ts.date_add, 
						|	ts.is_made,
						|	ts.ShopNo, 
						|	ts.id_mesto,
						|	ts.id_sensor,
						|	ts.Sensor_value,
						|	SMS.Место,
						|	SMS.sensor_name,
						|	SMS.Name_TT,
						|	SMS.Location						
						|
						|FROM [M2].[dbo].[TemraSensorData] (nolock) as ts 
						|inner join [Reports].[dbo].[Shop_Mesto_Sensor] (nolock) as SMS
						|	on ts.id_mesto = SMS.id_mesto and ts.id_sensor = SMS.id_sendor
						|where ts.date_add between " + ВнешниеДанные.ФорматПоля(ДатаНачала) + " and " + ВнешниеДанные.ФорматПоля(ДатаОкончание) + "
						|and SMS.Name_TT = " + ВнешниеДанные.ФорматПоля(СокрЛП(Объект.Владелец.Наименование))+" and ts.id_sensor="+ВнешниеДанные.ФорматПоля(Объект.ИД);
	rs = ADOСоединение.Execute(ТекстЗапросаSQL);
				
	Объект.Данные.Очистить();			
	Пока НЕ rs.EOF() Цикл
		СтрНов = Объект.Данные.Добавить();
		СтрНов.Дата = Rs.Fields("date_add").Value;
		СтрНов.is_made = Rs.Fields("is_made").Value;
		СтрНов.ShopNo = Rs.Fields("ShopNo").Value;
		СтрНов.id_mesto = Rs.Fields("id_mesto").Value;
		СтрНов.id_sensor = Rs.Fields("id_sensor").Value;
		СтрНов.Sensor_value = Rs.Fields("Sensor_value").Value;
		СтрНов.Место = Rs.Fields("Место").Value;
		СтрНов.sensor_name = Rs.Fields("sensor_name").Value;
		СтрНов.Name_TT = Rs.Fields("Name_TT").Value;
		СтрНов.Месторасположение = Rs.Fields("Location").Value;
		
		rs.MoveNext();
	Конеццикла;
	Объект.Данные.Сортировать("ShopNo, id_mesto, id_sensor, Дата");
	
	ТекКол = Объект.Данные.Количество();
	Если ТекКол <> 0 Тогда
		стр = Объект.Данные[ТекКол - 1];
		ShopNo = стр.ShopNo;
		id_mesto = стр.id_mesto;
		id_sensor = стр.id_sensor;
		ТекДата0 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 23, 59, 59) + 1;
	КонецЕсли;
	Пока ТекКол <> 0 Цикл
		стр = Объект.Данные[ТекКол - 1];
		Если ShopNo <> стр.ShopNo или id_mesto <> стр.id_mesto или id_sensor <> стр.id_sensor Тогда
			ShopNo = стр.ShopNo;
			id_mesto = стр.id_mesto;
			id_sensor = стр.id_sensor;
			ТекДата0 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 23, 59, 59) + 1;
		КонецЕсли;
		Если стр.Дата < ТекДата0 Тогда
			ТекДата0 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 0, 0, 0);
			ТекДата1 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 8, 0, 0);
			ТекДата1_1 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 7, 0, 0);
			ТекДата2 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 20, 0, 0);
			ТекДата2_1 = Дата(Год(стр.Дата), Месяц(стр.Дата), День(стр.Дата), 19, 0, 0);
		КонецЕсли;
		Если ТекДата2 <> 0 и стр.Дата < ТекДата2_1 Тогда
			ТекДата2 = 0;
		КонецЕсли;
		Если ТекДата1 <> 0 и стр.Дата < ТекДата1_1 Тогда
			ТекДата1 = 0;
		КонецЕсли;
		Если ТекДата2 <> 0 Тогда
			Если стр.Дата > ТекДата2 Тогда
				Объект.Данные.Удалить(стр);
				ТекКол = ТекКол - 1;
				Продолжить;
			ИначеЕсли стр.Дата = ТекДата2 Тогда
				ТекДата2 = 0; // Оставляем строку
				стр.УтроВечер = 2;
			ИначеЕсли стр.Дата <= ТекДата2 и стр.Дата >= ТекДата2_1 Тогда
				ТекДата2 = 0; // Оставляем строку
				стр.УтроВечер = 2;
			КонецЕсли;
		ИначеЕсли ТекДата1 <> 0 Тогда
			Если стр.Дата > ТекДата1 Тогда
				Объект.Данные.Удалить(стр);
				ТекКол = ТекКол - 1;
				Продолжить;
			ИначеЕсли стр.Дата = ТекДата1 Тогда
				ТекДата1 = 0; // Оставляем строку
				стр.УтроВечер = 1;
				ТекКол = ТекКол - 1;
				Продолжить;
			ИначеЕсли стр.Дата <= ТекДата1 и стр.Дата >= ТекДата1_1 Тогда
				ТекДата1 = 0; // Оставляем строку
				стр.УтроВечер = 1;
				ТекКол = ТекКол - 1;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если стр.Дата >= ТекДата0 и (стр.Дата < ТекДата1_1 или ТекДата1 = 0) Тогда
			Объект.Данные.Удалить(стр);
		КонецЕсли;
		
		ТекКол = ТекКол - 1;
	КонецЦикла;
	
	ADOСоединение.Close();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ДатаОкончание=КонецМесяца(ТекущаяДата());
	ДатаНачала=НачалоМесяца(ТекущаяДата());

	Таблица = Новый ТабличныйДокумент;
	Объект.Данные.Сортировать("ShopNo, Место, sensor_name, Дата");
	
	КоличествоЧисел = 0;
	ТекДата = ДатаНачала;
	Пока ТекДата < ДатаОкончание Цикл
		ТекДата = КонецМесяца(ТекДата);
		КоличествоЧисел = КоличествоЧисел + День(ТекДата);
		ТекДата = КонецМесяца(ТекДата) + 1;
	КонецЦикла;
	
	//*******************************************************************************************
	//ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = Обработки.ЖурналРегистрацииТемператур.ПолучитьМакет("Макет");
	
	//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Основная");
	ОбластьЗаголовок.Параметры.Магазин = СокрЛП(Объект.Владелец);
	ОбластьЗаголовок.Параметры.Период = "месяц";
	Таблица.Вывести(ОбластьЗаголовок);
	
	Для й = 1 По КоличествоЧисел Цикл
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Столбец");
		Таблица.Присоединить(ОбластьЗаголовок);
	КонецЦикла;
	Область = Таблица.Область(1, 1, 1, 3 + КоличествоЧисел);
	Область.Объединить();
	Область = Таблица.Область(2, 1, 2, 3 + КоличествоЧисел);
	Область.Объединить();
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Основная");
	Таблица.Вывести(ОбластьШапка);
	
	ТекКолонка1 = 3;
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ТекДата = ДатаНачала;
	Пока ТекДата < ДатаОкончание Цикл
		ТекДата = КонецМесяца(ТекДата);
		
		ТекМесяц = ПредставлениеПериода(НачалоМесяца(ТекДата), КонецМесяца(ТекДата), "ФП = Истина");
		Для й = 1 По День(ТекДата) Цикл
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Столбец");
			ОбластьШапка.Параметры.Месяц = ТекМесяц;
			ОбластьШапка.Параметры.Число = й;
			Таблица.Присоединить(ОбластьШапка);
			
			Область = Таблица.Область(5, ТекКолонка1 + й, 5, ТекКолонка1 + й);
			Область.Обвести(Линия, Линия, Линия, Линия);	
		КонецЦикла;
		Область = Таблица.Область(4, ТекКолонка1 + 1+1, 4, ТекКолонка1 + День(ТекДата)+1);
		Область.Объединить();
		Область.Обвести(Линия, Линия, Линия, Линия);	
		ТекКолонка1 = ТекКолонка1 + День(ТекДата); 
		
		ТекДата = КонецМесяца(ТекДата) + 1;
	КонецЦикла;
	Область = Таблица.Область(3, 4 + 1, 3, ТекКолонка1 + 1);
	Область.Объединить();
	Область.Обвести(Линия, Линия, Линия, Линия);	
	
	//Строки
	ТЗ = Объект.Данные.Выгрузить();
	ТЗ.Свернуть("Место, sensor_name,Месторасположение", "");
	ТЗ.Сортировать("Место, sensor_name,Месторасположение");
	Для каждого стр из ТЗ Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Основная");
		ОбластьСтрока.Параметры.МестоХранения = стр.Место;
		ОбластьСтрока.Параметры.НомерДатчика = стр.sensor_name;
		ОбластьСтрока.Параметры.Месторасположение = стр.Месторасположение;
		
		Таблица.Вывести(ОбластьСтрока);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Место", стр.Место);
		Отбор.Вставить("sensor_name", стр.sensor_name);
		Массив = Объект.Данные.НайтиСтроки(Отбор);
		
		ТекДата = ДатаНачала;
		Пока ТекДата < ДатаОкончание Цикл
			ТекДата = КонецМесяца(ТекДата);
			
			Для й = 1 По День(ТекДата) Цикл
				ВыводимыйДень = Дата(Год(ТекДата), Месяц(ТекДата), й, 0, 0, 0);
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Столбец");
				ОбластьСтрока.Параметры.Утро = 0;
				ОбластьСтрока.Параметры.Вечер = 0;
				Для каждого стр из Массив Цикл
					Если НачалоДня(стр.Дата) = ВыводимыйДень и стр.УтроВечер = 1 Тогда
						ОбластьСтрока.Параметры.Утро = стр.Sensor_value;
					ИначеЕсли НачалоДня(стр.Дата) = ВыводимыйДень и стр.УтроВечер = 2 Тогда
						ОбластьСтрока.Параметры.Вечер = стр.Sensor_value;
					КонецЕсли;
				КонецЦикла;
				Таблица.Присоединить(ОбластьСтрока);
			КонецЦикла;
			
			ТекДата = КонецМесяца(ТекДата) + 1;
		КонецЦикла;
	КонецЦикла;
	Возврат Таблица;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+++AK GREK 11.09.2018 ИП-00019554     
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Создание новых датчиков производится в автоматическом режиме, ручной ввод запрещен!'"));				
		ЭтаФорма.Закрыть();
	КонецЕсли;
	//---AK
	Сформировать();
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	Сформировать();
КонецПроцедуры

