
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	АК_УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура АК_УстановитьУсловноеОформление() 
	                                                
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СписокОкончанияДействияТехПаспорта");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор, "Список.ДнейДоПросрочкиТехПаспорта", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 14);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	
КонецПроцедуры    

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораТехПаспортов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВСписке(Команда)
	
	ОткрытьФормуВыбораТехПаспортов();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуВыбораТехПаспортов()

	ТекСтрока = Элементы.Список.ТекущиеДанные; 
	
	//+++АК LAGP 2018.04.09 ИП-00018343 Добавлен вид "ИД ЭОМ" в тех.паспорт 
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.Добавить(Перечисления.ВидыТехническихПаспортов.ТехническийПаспорт, "Тех. паспорт");
	СписокОтветов.Добавить(Перечисления.ВидыТехническихПаспортов.ИД_ЭОМ, "ИД ЭОМ");
	СписокОтветов.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	//Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтотОбъект, ТекСтрока);
	//ПоказатьВопрос(Оповещение, "Какой вид справочника требуется открыть?", СписокОтветов,, КодВозвратаДиалога.Да, "Отбор по виду");
	
	ОтветНаВопрос = Вопрос("Какой вид справочника требуется открыть?", СписокОтветов);
 
    Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		Отбор = Новый Структура("Владелец", ТекСтрока.РозничнаяТочка);
		Отбор.Вставить("ВидТехническогоПаспорта", ОтветНаВопрос);
		СтрукОтбора = Новый Структура("Отбор", Отбор);               		
		ОткрытьФорму("Справочник.АК_ТехническиеПаспорта.ФормаСписка", СтрукОтбора, Новый УникальныйИдентификатор);		
	КонецЕсли;
	
	//-перенесено в процедуру "ПослеОтветаНаВопрос
	//Отбор = Новый Структура("Владелец", ТекСтрока.РозничнаяТочка);
	//Отбор.Вставить("ВидТехническогоПаспорта", ВидТехническогоПаспорта);
	//
	//СтрукОтбора = Новый Структура("Отбор", Отбор);               
	//
	//ОткрытьФорму("Справочник.АК_ТехническиеПаспорта.ФормаСписка", СтрукОтбора, Новый УникальныйИдентификатор);		 
	//---АК LAGP
	
КонецПроцедуры // ОткрытьФормуВыбораТехПаспортов()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТехническийПаспортИзменен" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТехПаспорта(Команда)
	
	ОткрытьФорму("Отчет.АК_ТехПаспорта.Форма", Новый Структура("СформироватьПриОткрытии", Истина));
	яя = Новый COMОбъект ("Wscript.shell");
	яя.SendKeys("^{Enter}");
	
КонецПроцедуры

//+++АК LAGP 2018.04.09 ИП-00018343 Добавлен вид "ИД ЭОМ" в тех.паспорт
&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(ОтветНаВопрос, ЭтотОбъект, ТекСтрока) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		Отбор = Новый Структура("Владелец", ТекСтрока.РозничнаяТочка);
		Отбор.Вставить("ВидТехническогоПаспорта", ОтветНаВопрос);
		СтрукОтбора = Новый Структура("Отбор", Отбор);               		
		ОткрытьФорму("Справочник.АК_ТехническиеПаспорта.ФормаСписка", СтрукОтбора, Новый УникальныйИдентификатор);		
	КонецЕсли;	
		
КонецПроцедуры