&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТелефоннаяКнига.ПроверитьТелефонПоРегистрам(ТекущийОбъект.Номер);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РегламентныеЗаданияСервер.ФормированиеТелефонногоСправочникаHTML();
	Оповестить("Изменена привязка номера");
КонецПроцедуры

&НаСервере
Процедура ПроверитьГолосовуюСвязь()
	Если Запись.Номер.ДляГолосовойСвязи Тогда
		Запись.Назначение = Справочники.НазначенияИспользованияSIMКарт.СлужебныйТелефон;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверитьГолосовуюСвязь();
	Если Запись.Привязка = Неопределено Тогда
		Запись.Привязка = Справочники.ФизическиеЛица.ПустаяСсылка();
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ПроверитьГолосовуюСвязь();
КонецПроцедуры


&НаСервере
Функция ЗаписьСуществует()
	ОтборЗаписи = Новый Структура();
	ОтборЗаписи.Вставить("Номер", Запись.Номер);
	ОтборЗаписи.Вставить("Период", Запись.Период);        
	// отбор по ключу
	МенеджерЗаписи = РегистрыСведений.ПривязкаТелефонов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОтборЗаписи);
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Выбран() И НЕ (Запись.ИсходныйКлючЗаписи.Номер = Запись.Номер И Запись.ИсходныйКлючЗаписи.Период = Запись.Период);
КонецФункции



&НаСервере
Функция УдалитьЗапись()
	ОтборЗаписи = Новый Структура();
	ОтборЗаписи.Вставить("Номер", Запись.Номер);
	ОтборЗаписи.Вставить("Период", Запись.Период);        
	// отбор по ключу
	МенеджерЗаписи = РегистрыСведений.ПривязкаТелефонов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОтборЗаписи);
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
КонецФункции

Функция ПолучитьМассивДублированныхТелефонов()
	
	Возврат Справочники.СтруктурныеЕдиницы.ТелефонУказанВДругихТТ(Запись.Привязка, Прав(СокрЛП(Запись.Номер), 10), "");
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Привязка)
		И ТипЗнч(Запись.Привязка) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
		И Запись.Назначение = ПредопределенноеЗначение("Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон")
		И ЗначениеЗаполнено(Запись.Номер) Тогда
		МассивДублированныхТелефонов = ПолучитьМассивДублированныхТелефонов();
		Если МассивДублированныхТелефонов.Количество() > 0 Тогда
			Результат = ОткрытьФормуМодально("Справочник.СтруктурныеЕдиницы.Форма.ФормаЗадублированныхТелефонныхНомеров", Новый Структура("ТелефонныйНомер1, ТелефонныйНомер2, МассивТТ", Прав(СокрЛП(Запись.Номер), 10), "", МассивДублированныхТелефонов));
			Если Результат <> Истина Тогда
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	//Если ЗаписьСуществует() Тогда
	//	Ответ = Вопрос("На " + Формат(Запись.Период, "ДФ=dd.MM.yyyy; ДЛФ=DD") + "по этому номеру существует другая запись. Перезаписать?", РежимДиалогаВопрос.ДаНет);
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		УдалитьЗапись();
	//	Иначе
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПривязкаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
    Если Ожидание <> 0 И НЕ ПустаяСтрока(Текст) Тогда       
        СтандартнаяОбработка = Ложь;
        ДанныеВыбора = ПолучитьСписокВыбора(Текст);  
    КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбора(знач СтрокаПоиска)
    
    СписокВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ФизическиеЛица.Наименование + "" (сотрудник)"" КАК Представление
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	НЕ ФизическиеЛица.ПометкаУдаления
	               |	И ФизическиеЛица.Наименование ПОДОБНО &СтрокаПоиска
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтруктурныеЕдиницы.Ссылка,
	               |	СтруктурныеЕдиницы.Наименование + "" (подразделение)""
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	               |	И СтруктурныеЕдиницы.Наименование ПОДОБНО &СтрокаПоиска";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	ТЗ = Запрос.Выполнить().Выгрузить();

   	Для Каждого Стр Из ТЗ Цикл
		СписокВыбора.Добавить(Стр.Ссылка, Стр.Представление);
	КонецЦикла;
	
    Возврат СписокВыбора;
    
КонецФункции
