                                   
//////////////////////////////////////////
//СЕРВЕР

&НаСервере
Функция ЗаполнитьСписокТаблицБазыДанныхНаСервере()
	
	//
	СписокТаблицБазыДанных.Очистить();
	
	//
	ТЗ = Справочники.АК_ВнешниеБазыДанных.ПолучитьОписаниеТаблицБазыДанных(Объект.Ссылка);
	
	//
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		//
		НоваяСтрока = СписокТаблицБазыДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
		//
		НоваяСтрока.ТаблицаБазыДанных = Справочники.АК_ТаблицыВнешнейБазыДанных.НайтиПоКоду(НоваяСтрока.TABLE_NAME,,, Объект.Ссылка); 
		
		//
		НоваяСтрока.Пометка = ЗначениеЗаполнено(НоваяСтрока.ТаблицаБазыДанных);
		
	КонецЦикла;	
	
КонецФункции	

&НаСервере
Функция СоздатьТаблицыБДНаСервере()
	
	//
	Для Каждого СтрокаТЧ Из СписокТаблицБазыДанных Цикл
		
		//
		Если СтрокаТЧ.Пометка И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТаблицаБазыДанных) Тогда
			СтрокаТЧ.ТаблицаБазыДанных = Справочники.АК_ВнешниеБазыДанных.СоздатьТаблицуВнешнейБазыДанных(Объект.Ссылка, СтрокаТЧ.TABLE_NAME);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецФункции	

//////////////////////////////////////////
//КЛИЕНТ

&НаКлиенте
Процедура СписокТаблицОбновить(Команда)
	
	//
	ЗаполнитьСписокТаблицБазыДанныхНаСервере();
	
	//
	Элементы.СписокТаблицБазыДанных.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура БазаДанныхПриИзменении(Элемент)
	
	//
	ЗаполнитьСписокТаблицБазыДанныхНаСервере();
	
	//
	Элементы.СписокТаблицБазыДанных.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТаблицыБД(Команда)
	
	//
	СоздатьТаблицыБДНаСервере();
	
	//
	Элементы.СписокТаблицБазыДанных.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
		ЗаполнитьСписокТаблицБазыДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры
