
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОпроса = НачалоДня(ТекущаяДата());
	ФильтрНомерСмены = 5;
	ФильтрНомерСменыПо = 8;
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ДатаОпроса", ДатаОпроса);
	//Кандидаты.Параметры.УстановитьЗначениеПараметра("Продавец"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Продавец-консультант"));
	//Кандидаты.Параметры.УстановитьЗначениеПараметра("Кассир"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Кассир"));
	Кандидаты.Параметры.УстановитьЗначениеПараметра("Стажер"	, Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Стажер"));
	
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"	, ДатаОпроса);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСмены",ФильтрНомерСмены,ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,ФильтрНомерСмены<>0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСменыПо",ФильтрНомерСменыПо,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,ФильтрНомерСменыПо<>0);
	
	ФильтрПоТочкеПриИзмененииСервер();
	
КонецПроцедуры


Процедура ФильтрПоТочкеПриИзмененииСервер()
	
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ФильтрПоТочке"				, ФильтрПоТочке);
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ФильтрПоТочке"		, ФильтрПоТочке);
	
	
	Если ЗначениеЗаполнено(ФильтрПоТочке) Тогда
		Кандидаты.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"			, Ложь);
		//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"	, Ложь);
	
	Иначе
		Кандидаты.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"			, Истина);
		//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ПоВсемТочкам"	, Истина);
	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ФильтрПоТочкеПриИзменении(Элемент)
	
	ФильтрПоТочкеПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Кандидаты.ТекущиеДанные;
	Если Вопрос("Создать экзамен для " + ТекДанные.Продавец + " ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Парам = Новый Структура;
		Парам.Вставить("Продавец"			, ТекДанные.Продавец);
		Парам.Вставить("Точка"				, ТекДанные.ТорговаяТочка);
		Парам.Вставить("Свойство"			, ТекДанные.Свойство);
		Парам.Вставить("Должность"			, ТекДанные.Должность);
		Парам.Вставить("ВопросовВЭкзамене"	, ТекДанные.ВопросовВЭкзамене);
		ОткрытьФормуМодально("Документ.ЭкзаменыПродавцов.Форма.ФормаДокумента", Парам);
		//Элементы.Кандидаты.Обновить();
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаОпросаПриИзменении(Элемент)
	
	Кандидаты.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"			, ДатаОпроса);
	//ОпрошенныеСегодня.Параметры.УстановитьЗначениеПараметра("ДатаОпроса"	, ДатаОпроса);

	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрНомерСменыПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСмены",ФильтрНомерСмены,ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,ФильтрНомерСмены<>0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Кандидаты,"НомерСменыПо",ФильтрНомерСменыПо,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,ФильтрНомерСменыПо<>0);
КонецПроцедуры
