
&НаСервере
Процедура ВариантыРеестраНачалоВыбораИзСпискаНаСервере()
			    
	ТекОтборы = Объект.Ссылка.ХранилищеНастроекРегистра.Получить();
	Список.Отбор.Элементы.Очистить();
	
	Если ТекОтборы <> Неопределено Тогда
				
		Для каждого ТекСтр Из ТекОтборы.Элементы Цикл
			
			НовыйОтбор = Список.Отбор.Элементы.Добавить(ТипЗнч(ТекСтр));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ТекСтр);
			Попытка
				Если ТекСтр.Элементы.Количество() > 0 Тогда
					ДобавитьПодчинённыеОтборы(ТекСтр, НовыйОтбор);
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПодчинённыеОтборы(ТекСтрРодитель, НовыйОтборРодитель)
	
	Для каждого ТекСтр Из ТекСтрРодитель.Элементы Цикл
	    		
	    НовыйОтбор = НовыйОтборРодитель.Элементы.Добавить(ТипЗнч(ТекСтр));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ТекСтр);
		
		Попытка
		Если ТекСтр.Элементы.Количество() > 0 Тогда
			ДобавитьПодчинённыеОтборы(ТекСтр, НовыйОтбор);	
		КонецЕсли;	
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантыРеестраНачалоВыбораИзСпискаНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеНастроекРегистра = Новый ХранилищеЗначения(Список.Отбор);
КонецПроцедуры
