
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтборПоЦФО") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЦФОСтруктурныхЕдиницСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТехникиОбъектыРемонта.Ссылка
			|ИЗ
			|	вт КАК вт
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Техники.ОбъектыРемонта КАК ТехникиОбъектыРемонта
			|		ПО вт.ЦФО = ТехникиОбъектыРемонта.Ссылка.ЦФО
			|ГДЕ
			|	ТехникиОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Техники.Ссылка
			|ИЗ
			|	Справочник.Техники КАК Техники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Техники.ОбъектыРемонта КАК ТехникиОбъектыРемонта
			|		ПО ТехникиОбъектыРемонта.Ссылка = Техники.Ссылка
			|ГДЕ
			|	ТехникиОбъектыРемонта.ОбъектРемонта ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("Дата", Параметры.Дата);
		Запрос.УстановитьПараметр("ОбъектРемонта", Параметры.ОбъектРемонта);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.ТТ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СпОтб=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпОтб.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= СпОтб;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	КонецЕсли; 
КонецПроцедуры
