
//+++АК SHEP 2018.12.12 ИП-00018753.05 +форма
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Ссылка) Тогда
		
		ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
		Если ЗаписьОбъект.Выбран() Тогда
			ТолькоПросмотр = Истина;
		Иначе
			Элементы.Период.ТолькоПросмотр = Истина;
			Элементы.Ссылка.Видимость = Ложь;
			Запись.ЧейОтвет = "Ответ техподдержки";
			Элементы.ЧейОтвет.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
