
#Область ОбработчикиСобытийКомандФормы

//+++АК LATV 2018.11.29 ИП-00020489.01
&НаКлиенте
Процедура УдалитьУстаревшиеФайлы(Команда)

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Начало: '") + ТекущаяДата());
	УдалитьУстаревшиеФайлыСервер();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Конец: '") + ТекущаяДата());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+++АК LATV 2018.11.29 ИП-00020489.01
&НаСервере
Процедура УдалитьУстаревшиеФайлыСервер()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьУстаревшиеФайлы();

КонецПроцедуры

#КонецОбласти
