Функция ПолучитьСтруктуруПараметровЗапроса() экспорт
	
	СтруктураПараметров=Новый Структура;
	
	СтруктураПараметров.Вставить("Организация"			, Справочники.Организации.ПустаяСсылка());
	СтруктураПараметров.Вставить("Контрагент"			, Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	СтруктураПараметров.Вставить("ФормаОплаты"			, Перечисления.ФормыОплаты.Безналичные);
	СтруктураПараметров.Вставить("ВалютаРегл"			, Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.Вставить("МесяцПлатежногоКалендаря"
														, НачалоМесяца(ТекущаяДата()));
	УстановитьПривилегированныйРежим(Истина);
	СтруктураПараметров.Вставить("ВалютаРегл"			, Константы.ВалютаРегламентированногоУчета.Получить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции
Функция ПолучитьРезультатЗапроса(Параметры) Экспорт 

	//+++АК VERN 2016.08.19 ИП-00013332.001.00000001 
	//код вынесен в модуль менеджера для совместного использования в обработке "Платежный календарь"
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, Параметры.Организация);
	Запрос.УстановитьПараметр("Контрагент"			, Параметры.Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, Параметры.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ФормаОплаты"			, Параметры.ФормаОплаты);
	Запрос.УстановитьПараметр("ВалютаРегл"			, Параметры.ВалютаРегл);
	
	Запрос.УстановитьПараметр("МесяцПлатежногоКалендаря"
													, Параметры.МесяцПлатежногоКалендаря);
	Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДата()));
	
	Запрос.УстановитьПараметр("МаксимальнаяДата"	, Дата(2999, 1, 1));
	Запрос.УстановитьПараметр("МинимальнаяДата"		, Дата(1, 1, 1));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Период) КАК Период,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор КАК Договор,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПериодыПланируемыхПлатежейПредварительно
	|ИЗ
	//+++ AK suvv 05.07.2018 ИП-00018763
	|	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних(
	|			,
	|			ВЫБОР
	|					КОГДА Регистратор ССЫЛКА Документ.ЗаключениеДоговораАренды
	|						ТОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	|					ИНАЧЕ Регистратор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	|				КОНЕЦ
	|				И (Контрагент = &Контрагент
	|					ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				И (ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|				И (ФормаОплаты = &ФормаОплаты
	|					ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка))
	|				И (НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -2)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|					ИЛИ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	|						И Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца))) КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних	
	//|	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних(, ) КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних	
	//|ГДЕ
	//|	(НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -2)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	//|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	//|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	//|			ИЛИ ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Контрагент = &Контрагент
	//|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|			ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты = &ФормаОплаты
	//|			ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка))
	//--- AK suvv
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыПланируемыхПлатежейПредварительно.Период,
	|	ВТ_ПериодыПланируемыхПлатежейПредварительно.Договор,
	|	ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата
	|ПОМЕСТИТЬ ВТ_ПериодыПланируемыхПлатежей
	|ИЗ
	|	ВТ_ПериодыПланируемыхПлатежейПредварительно КАК ВТ_ПериодыПланируемыхПлатежейПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды.СрезПоследних КАК СтатусыДоговоровАрендыСрезПоследних
	|		ПО ВТ_ПериодыПланируемыхПлатежейПредварительно.Договор = СтатусыДоговоровАрендыСрезПоследних.Договор
	|			И ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата >= СтатусыДоговоровАрендыСрезПоследних.ДатаНачалаАренды
	|			И ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата <= СтатусыДоговоровАрендыСрезПоследних.ДатаОкончанияАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыПланируемыхПлатежей.Договор,
	|	ВТ_ПериодыПланируемыхПлатежей.Дата,
	|	МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РегистраторыПланируемыхПлатежей
	|ИЗ
	|	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыПланируемыхПлатежей КАК ВТ_ПериодыПланируемыхПлатежей
	|		ПО ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Период = ВТ_ПериодыПланируемыхПлатежей.Период
	|			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор = ВТ_ПериодыПланируемыхПлатежей.Договор
	|			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата = ВТ_ПериодыПланируемыхПлатежей.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыПланируемыхПлатежей.Договор,
	|	ВТ_ПериодыПланируемыхПлатежей.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор КАК ДоговорКонтрагента,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ТипАренднойПлаты,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Валюта,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА &МесяцПлатежногоКалендаря
	|		КОГДА НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -2)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|	КОНЕЦ КАК МесяцОплаты,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ)) КАК МесяцАренды,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Сумма) КАК Сумма,
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	СУММА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.СуммаВал) КАК СуммаВал
	|	СУММА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.СуммаВал) КАК СуммаВал,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Аванс
	//--- AK suvv
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежи
	|ИЗ
	//+++ AK suvv 05.07.2018 ИП-00018763
	|	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних(
	|			,
	|			(Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|				И (Контрагент = &Контрагент
	|					ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				И (ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|				И (ФормаОплаты = &ФормаОплаты
	|					ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка))
	|				И (Сумма <> 0
	|					ИЛИ СуммаВал <> 0)) КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних
	//|	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних
	//--- AK suvv
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистраторыПланируемыхПлатежей КАК ВТ_РегистраторыПланируемыхПлатежей
	|		ПО ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор = ВТ_РегистраторыПланируемыхПлатежей.Регистратор
	|			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор = ВТ_РегистраторыПланируемыхПлатежей.Договор
	|			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата = ВТ_РегистраторыПланируемыхПлатежей.Дата
	//+++ AK suvv 05.07.2018 ИП-00018763
	//|ГДЕ
	//|	(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Организация = &Организация
	//|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Контрагент = &Контрагент
	//|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|			ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты = &ФормаОплаты
	//|			ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка))
	//|	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Сумма <> 0
	//|			ИЛИ ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.СуммаВал <> 0)
	//--- AK suvv
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ТипАренднойПлаты,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Валюта,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА &МесяцПлатежногоКалендаря
	|		КОГДА НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -2)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Предыдущий)
	|				ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|	КОНЕЦ,
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор,
	|	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Аванс
	//--- AK suvv
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|ПОМЕСТИТЬ ВТ_ПервыйРабочийДень
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПланируемыеПлатежи.ДоговорКонтрагента,
	|	ВТ_ПланируемыеПлатежи.ФормаОплаты,
	|	ВТ_ПланируемыеПлатежи.ТипАренднойПлаты,
	|	ВТ_ПланируемыеПлатежи.Валюта,
	|	ВТ_ПланируемыеПлатежи.МесяцОплаты,
	|	ВТ_ПланируемыеПлатежи.МесяцАренды,
	|	ВТ_ПланируемыеПлатежи.Регистратор,
	|	ВТ_ПланируемыеПлатежи.Сумма,
	|	ВТ_ПланируемыеПлатежи.СуммаВал,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежи.МесяцОплаты, ДЕНЬ, ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.ЧислоОплатыАренды - 1)
	|				ТОГДА РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|			ИНАЧЕ &МаксимальнаяДата
	|		КОНЕЦ) КАК СвоевременнаяДатаОплаты,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РегламентированныйПроизводственныйКалендарь.ДатаКалендаря < ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежи.МесяцОплаты, ДЕНЬ, ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.ЧислоОплатыАренды - 1)
	|				ТОГДА РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|			ИНАЧЕ &МинимальнаяДата
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|		КОНЕЦ) КАК ДосрочнаяДатаОплаты
	|		КОНЕЦ) КАК ДосрочнаяДатаОплаты,
	|	ВТ_ПланируемыеПлатежи.Аванс
	//--- AK suvv
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно
	|ИЗ
	|	ВТ_ПланируемыеПлатежи КАК ВТ_ПланируемыеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря < ВЫБОР
	|				КОГДА ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.СрокОплатыАренды < ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.ЧислоОплатыАренды
	|					ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежи.МесяцОплаты, МЕСЯЦ, 1), ДЕНЬ, ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.СрокОплатыАренды - 1)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежи.МесяцОплаты, ДЕНЬ, ВТ_ПланируемыеПлатежи.ДоговорКонтрагента.СрокОплатыАренды - 1)
	|			КОНЕЦ)
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И ВТ_ПланируемыеПлатежи.МесяцОплаты >= ДАТАВРЕМЯ(2015, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПланируемыеПлатежи.ДоговорКонтрагента,
	|	ВТ_ПланируемыеПлатежи.ФормаОплаты,
	|	ВТ_ПланируемыеПлатежи.ТипАренднойПлаты,
	|	ВТ_ПланируемыеПлатежи.Валюта,
	|	ВТ_ПланируемыеПлатежи.МесяцОплаты,
	|	ВТ_ПланируемыеПлатежи.МесяцАренды,
	|	ВТ_ПланируемыеПлатежи.Регистратор,
	|	ВТ_ПланируемыеПлатежи.Сумма,
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	ВТ_ПланируемыеПлатежи.СуммаВал
	|	ВТ_ПланируемыеПлатежи.СуммаВал,
	|	ВТ_ПланируемыеПлатежи.Аванс
	//--- AK suvv
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДоговорКонтрагента,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ФормаОплаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ТипАренднойПлаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.Валюта,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.МесяцОплаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.МесяцАренды,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.Регистратор,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.Сумма,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.СуммаВал,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.СвоевременнаяДатаОплаты = &МаксимальнаяДата
	|					ТОГДА ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДосрочнаяДатаОплаты
	|				ИНАЧЕ ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.СвоевременнаяДатаОплаты
	|			КОНЕЦ > ВТ_ПервыйРабочийДень.ДатаКалендаря
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.СвоевременнаяДатаОплаты = &МаксимальнаяДата
	|						ТОГДА ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДосрочнаяДатаОплаты
	|					ИНАЧЕ ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.СвоевременнаяДатаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ПервыйРабочийДень.ДатаКалендаря
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДоговорКонтрагента.СрокОплатыАренды < ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДоговорКонтрагента.ЧислоОплатыАренды
	|					ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.МесяцОплаты, МЕСЯЦ, 1), ДЕНЬ, ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДоговорКонтрагента.СрокОплатыАренды - 1)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.МесяцОплаты, ДЕНЬ, ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.ДоговорКонтрагента.СрокОплатыАренды - 1)
	|			КОНЕЦ <= &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	КОНЕЦ КАК ПлатежПросрочен
	|	КОНЕЦ КАК ПлатежПросрочен,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно.Аванс
	//--- AK suvv
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежиСДатамиОплаты
	|ИЗ
	|	ВТ_ПервыйРабочийДень КАК ВТ_ПервыйРабочийДень,
	|	ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно КАК ВТ_ПланируемыеПлатежиСДатамиОплатыПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеСредств.ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаРасходованиеСредств.НачалоПериодаАренды, МЕСЯЦ) КАК МесяцАренды,
	|	ЗаявкаНаРасходованиеСредств.ФормаОплаты,
	|	ЗаявкаНаРасходованиеСредств.ТипАренднойПлаты,
	|	МАКСИМУМ(ЗаявкаНаРасходованиеСредств.Ссылка) КАК Заявка,
	|	МАКСИМУМ(ЗаявкаНаРасходованиеСредств.ДатаРасхода) КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеСредств.Проведен
	|	И ЗаявкаНаРасходованиеСредств.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеСредств.ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаРасходованиеСредств.НачалоПериодаАренды, МЕСЯЦ),
	|	ЗаявкаНаРасходованиеСредств.ФормаОплаты,
	|	ЗаявкаНаРасходованиеСредств.ТипАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзБанка.ПериодРегистрации, МЕСЯЦ) КАК МесяцАренды,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты,
	|	ВЫБОР
	|		КОГДА РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ КАК ТипАренднойПлаты,
	|	РасходИзБанка.Ссылка КАК ПлатежныйДокумент,
	|	РасходИзБанка.ДатаОплаты КАК ДатаОплаты,
	|	РасходИзБанка.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА РасходИзБанка.Проведен
	|				И РасходИзБанка.Оплачено
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДокументПроведен
	|ПОМЕСТИТЬ ВТ_ПлатежныеДокументыПредварительно
	|ИЗ
	|	Документ.РасходИзБанка КАК РасходИзБанка
	|ГДЕ
	|	РасходИзБанка.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|	И РасходИзБанка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю))
	//+++АК sils 19.09.2018 ИП-00019856
	|	И НЕ РасходИзБанка.ПометкаУдаления
	//---АК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	РасходИзБанка.ДоговорКонтрагентаНДФЛ ,
	|	НАЧАЛОПЕРИОДА(РасходИзБанка.ПериодРегистрации, МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) ,
	|	Выбор когда РасходИзБанка.ТипАренднойПлаты=ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПустаяСсылка) тогда ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧастьНДФЛ) иначе РасходИзБанка.ТипАренднойПлаты конец,
	|	РасходИзБанка.Ссылка ,
	|	РасходИзБанка.ДатаОплаты ,
	|	РасходИзБанка.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА РасходИзБанка.Проведен
	|				И РасходИзБанка.Оплачено
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ 
	|ИЗ
	|	Документ.РасходИзБанка КАК РасходИзБанка
	|ГДЕ
	|	РасходИзБанка.ДоговорКонтрагентаНДФЛ В
	|			(ВЫБРАТЬ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|	И РасходИзБанка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ПеречислениеНалога)) 
	//+++АК sils 19.09.2018 ИП-00019856
	|	И НЕ РасходИзБанка.ПометкаУдаления
	//---АК
		
	
	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходИзКассы.ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзКассы.ПериодРегистрации, МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные),
	|	ВЫБОР
	|		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ,
	|	РасходИзКассы.Ссылка,
	|	НАЧАЛОПЕРИОДА(РасходИзКассы.Ссылка.Дата, ДЕНЬ),
	|	РасходИзКассы.СуммаДокумента,
	|	РасходИзКассы.Проведен
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|ГДЕ
	|	РасходИзКассы.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|	И РасходИзКассы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПеременнойЧастиАрендыАрендодателю))
	//+++АК sils 19.09.2018 ИП-00019856
	|	И НЕ РасходИзКассы.ПометкаУдаления
	//---АК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетОплатыАрендыЗачетДепозита.Ссылка.ДоговорКонтрагента,
	|	ЗачетОплатыАрендыЗачетДепозита.ПериодРегистрации,
	|	ЗачетОплатыАрендыЗачетДепозита.ФормаОплаты,
	|	ЗачетОплатыАрендыЗачетДепозита.ТипАренднойПлаты,
	|	ЗачетОплатыАрендыЗачетДепозита.Ссылка.Ссылка,
	|	НАЧАЛОПЕРИОДА(ЗачетОплатыАрендыЗачетДепозита.Ссылка.Дата, ДЕНЬ),
	|	ЗачетОплатыАрендыЗачетДепозита.Сумма,
	|	ЗачетОплатыАрендыЗачетДепозита.Ссылка.Проведен
	|ИЗ
	|	Документ.ЗачетОплатыАренды.ЗачетДепозита КАК ЗачетОплатыАрендыЗачетДепозита
	|ГДЕ
	|	ЗачетОплатыАрендыЗачетДепозита.Ссылка.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|
	//+++АК sils 19.09.2018 ИП-00019856
	|	И НЕ ЗачетОплатыАрендыЗачетДепозита.Ссылка.ПометкаУдаления
	//---АК
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасходИзБанка.ДоговорКонтрагентаНДФЛ,
	//|	НАЧАЛОПЕРИОДА(РасходИзБанка.ПериодРегистрации, МЕСЯЦ),
	//|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные),
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧастьНДФЛ),
	//|	РасходИзБанка.Ссылка,
	//|	РасходИзБанка.ДатаОплаты,
	//|	РасходИзБанка.СуммаДокумента,
	//|	ВЫБОР
	//|		КОГДА РасходИзБанка.Проведен
	//|				И РасходИзБанка.Оплачено
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ
	//|ИЗ
	//|	Документ.РасходИзБанка КАК РасходИзБанка
	//|ГДЕ
	//|	РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ПеречислениеНалога)
	//|	И РасходИзБанка.ДоговорКонтрагентаНДФЛ В
	//|			(ВЫБРАТЬ
	//|				ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента
	//|			ИЗ
	//|				ВТ_ПланируемыеПлатежиСДатамиОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента,
	|	ВТ_ПлатежныеДокументыПредварительно.МесяцАренды,
	|	ВТ_ПлатежныеДокументыПредварительно.ФормаОплаты,
	|	ВТ_ПлатежныеДокументыПредварительно.ТипАренднойПлаты,
	|	ВТ_ПлатежныеДокументыПредварительно.ДокументПроведен,
	|	МАКСИМУМ(ВТ_ПлатежныеДокументыПредварительно.ПлатежныйДокумент) КАК ПлатежныйДокумент,
	|	МАКСИМУМ(ВТ_ПлатежныеДокументыПредварительно.ДатаОплаты) КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТ_ПлатежныеДокументы
	|ИЗ
	|	ВТ_ПлатежныеДокументыПредварительно КАК ВТ_ПлатежныеДокументыПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента,
	|	ВТ_ПлатежныеДокументыПредварительно.МесяцАренды,
	|	ВТ_ПлатежныеДокументыПредварительно.ФормаОплаты,
	|	ВТ_ПлатежныеДокументыПредварительно.ТипАренднойПлаты,
	|	ВТ_ПлатежныеДокументыПредварительно.ДокументПроведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Договор,
	|	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.ПериодРегистрации
	|ПОМЕСТИТЬ ВТ_БылиНачисления
	|ИЗ
	|	Документ.НачислениеАренднойПлатыОтАрендодателей.НачислениеАренды КАК НачислениеАренднойПлатыОтАрендодателейНачислениеАренды
	|ГДЕ
	|	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка.Проведен
	|	И НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.ПериодРегистрации < &МесяцПлатежногоКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйОстатки.Субконто1 КАК Организация,
	|	ФинансовыйОстатки.Субконто2 КАК Контрагент,
	|	ФинансовыйОстатки.Субконто3 КАК СтруктурнаяЕдиница,
	|	ФинансовыйОстатки.СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиВзаиморасчетовПредварительно
	|ИЗ
	//+++ AK suvv 05.07.2018 ИП-00018763
	|	РегистрБухгалтерии.Финансовый.Остатки(
	|			&МесяцПлатежногоКалендаря,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде),
	|			,
	|			(Субконто1 = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|				И (Субконто2 = &Контрагент
	|					ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				И (Субконто3 = &СтруктурнаяЕдиница
	|					ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))) КАК ФинансовыйОстатки
	//|	РегистрБухгалтерии.Финансовый.Остатки(&МесяцПлатежногоКалендаря, Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , ) КАК ФинансовыйОстатки
	//|ГДЕ
	//|	(ФинансовыйОстатки.Субконто1 = &Организация
	//|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	//|	И (ФинансовыйОстатки.Субконто2 = &Контрагент
	//|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	//|	И (ФинансовыйОстатки.Субконто3 = &СтруктурнаяЕдиница
	//|			ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	//---AK suvv
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента.Организация,
	|	ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента.Владелец,
	|	ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница,
	|	-ВТ_ПлатежныеДокументыПредварительно.СуммаДокумента
	|ИЗ
	|	ВТ_ПлатежныеДокументыПредварительно КАК ВТ_ПлатежныеДокументыПредварительно
	|ГДЕ
	|	ВТ_ПлатежныеДокументыПредварительно.ДокументПроведен
	|	И ВТ_ПлатежныеДокументыПредварительно.ПлатежныйДокумент.Дата < &МесяцПлатежногоКалендаря
	|	И НЕ (ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента, ВТ_ПлатежныеДокументыПредварительно.МесяцАренды) В
	|				(ВЫБРАТЬ
	|					ВТ_БылиНачисления.Договор,
	|					ВТ_БылиНачисления.ПериодРегистрации
	|				ИЗ
	|					ВТ_БылиНачисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.ФормаОплаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.ТипАренднойПлаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.Валюта,
	|	СтатусыДоговоровАрендыСрезПоследних.ДатаНачалаАренды,
	|	СтатусыДоговоровАрендыСрезПоследних.ДатаОкончанияАренды,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцАренды,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.Регистратор,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.Сумма,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.СуммаВал,
	|	ВЫБОР
	|		КОГДА СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОплатыДоговоровКонтрагентов.Действует)
	|		ИНАЧЕ СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус
	|	КОНЕЦ КАК СтатусОплаты,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ_ПлатежныеДокументы.ДатаОплаты < &МесяцПлатежногоКалендаря
	|				ТОГДА ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|			ИНАЧЕ ВТ_ПлатежныеДокументы.ДатаОплаты
	|		КОНЕЦ, ЕСТЬNULL(ВТ_Заявки.ДатаОплаты, ВЫБОР
	|				КОГДА ВТ_ПланируемыеПлатежиСДатамиОплаты.ДатаОплаты < СтатусыДоговоровАрендыСрезПоследних.ДатаНачалаАренды
	|					ТОГДА СтатусыДоговоровАрендыСрезПоследних.ДатаНачалаАренды
	|				ИНАЧЕ ВТ_ПланируемыеПлатежиСДатамиОплаты.ДатаОплаты
	|			КОНЕЦ)) КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ВТ_ПлатежныеДокументы.ДатаОплаты ЕСТЬ НЕ NULL 
	|				ИЛИ ВТ_Заявки.ДатаОплаты ЕСТЬ НЕ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ПланируемыеПлатежиСДатамиОплаты.ПлатежПросрочен
	|	КОНЕЦ КАК ПлатежПросрочен,
	|	ВЫБОР
	|		КОГДА ВТ_ПлатежныеДокументы.ПлатежныйДокумент ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлатежаНет,
	|	ЕСТЬNULL(ВТ_ПлатежныеДокументы.ПлатежныйДокумент, ВТ_Заявки.Заявка) КАК ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_ПлатежныеДокументыНепроведенные.ПлатежныйДокумент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	КОНЕЦ КАК ЕстьНепроведенныйПлатеж
	|	КОНЕЦ КАК ЕстьНепроведенныйПлатеж,
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты.Аванс
	//--- AK suvv
	|ПОМЕСТИТЬ ВТ_СводныеДанные
	|ИЗ
	|	ВТ_ПланируемыеПлатежиСДатамиОплаты КАК ВТ_ПланируемыеПлатежиСДатамиОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних
	|		ПО ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента = СтатусыОплатыПоДоговорамАрендыСрезПоследних.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды.СрезПоследних КАК СтатусыДоговоровАрендыСрезПоследних
	|		ПО ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента = СтатусыДоговоровАрендыСрезПоследних.Договор
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента.ОбъектАренды = СтатусыДоговоровАрендыСрезПоследних.ОбъектАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлатежныеДокументы КАК ВТ_ПлатежныеДокументы
	|		ПО ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента = ВТ_ПлатежныеДокументы.ДоговорКонтрагента
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцАренды = ВТ_ПлатежныеДокументы.МесяцАренды
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ФормаОплаты = ВТ_ПлатежныеДокументы.ФормаОплаты
	|			И выбор когда ВТ_ПланируемыеПлатежиСДатамиОплаты.ТипАренднойПлаты =ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧастьНДФЛ) 
	|Тогда ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧастьНДФЛ)Иначе ВТ_ПланируемыеПлатежиСДатамиОплаты.ТипАренднойПлаты конец= ВТ_ПлатежныеДокументы.ТипАренднойПлаты
	|			И (ВТ_ПлатежныеДокументы.ДокументПроведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлатежныеДокументы КАК ВТ_ПлатежныеДокументыНепроведенные
	|		ПО ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента = ВТ_ПлатежныеДокументыНепроведенные.ДоговорКонтрагента
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцАренды = ВТ_ПлатежныеДокументыНепроведенные.МесяцАренды
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ФормаОплаты = ВТ_ПлатежныеДокументыНепроведенные.ФормаОплаты
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ТипАренднойПлаты = ВТ_ПлатежныеДокументыНепроведенные.ТипАренднойПлаты
	|			И (НЕ ВТ_ПлатежныеДокументыНепроведенные.ДокументПроведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента = ВТ_Заявки.ДоговорКонтрагента
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцАренды = ВТ_Заявки.МесяцАренды
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ФормаОплаты = ВТ_Заявки.ФормаОплаты
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.ТипАренднойПлаты = ВТ_Заявки.ТипАренднойПлаты
	|ГДЕ
	|	(НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВТ_ПлатежныеДокументы.ДатаОплаты, ЕСТЬNULL(ВТ_Заявки.ДатаОплаты, ВТ_ПланируемыеПлатежиСДатамиОплаты.ДатаОплаты)), МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|			ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = &МесяцПлатежногоКалендаря
	|			ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|				И ВТ_ПлатежныеДокументы.ДатаОплаты ЕСТЬ NULL 
	|				И ВТ_Заявки.ДатаОплаты ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.Организация,
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.Контрагент,
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.СтруктурнаяЕдиница,
	|	СУММА(ВТ_ОстаткиВзаиморасчетовПредварительно.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиВзаиморасчетов
	|ИЗ
	|	ВТ_ОстаткиВзаиморасчетовПредварительно КАК ВТ_ОстаткиВзаиморасчетовПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.Организация,
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.Контрагент,
	|	ВТ_ОстаткиВзаиморасчетовПредварительно.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СводныеДанные.ДоговорКонтрагента.Организация КАК Организация,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ВТ_СводныеДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.Комментарий КАК Комментарий,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.ЧислоОплатыАренды КАК ЧислоОплатыАренды,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.СрокОплатыАренды КАК СрокОплатыАренды,
	|	ВТ_СводныеДанные.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ВТ_СводныеДанные.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	ВТ_СводныеДанные.МесяцАренды КАК МесяцАренды,
	|	ВТ_СводныеДанные.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_СводныеДанные.ПлатежПросрочен КАК ПлатежПросрочен,
	|	ВТ_СводныеДанные.ПлатежаНет КАК ПлатежаНет,
	|	ВТ_СводныеДанные.ЕстьНепроведенныйПлатеж КАК ЕстьНепроведенныйПлатеж,
	|	ВТ_СводныеДанные.ФормаОплаты КАК ФормаОплаты,
	|	ВТ_СводныеДанные.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|	ВТ_СводныеДанные.Валюта КАК ВалютаСтрока,
	|	ВТ_СводныеДанные.СтатусОплаты КАК СтатусОплаты,
	|	ВТ_СводныеДанные.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВТ_СводныеДанные.Сумма,
	|	ВТ_СводныеДанные.СуммаВал,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта, &ВалютаРегл) КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта2, &ВалютаРегл) КАК Валюта2,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Кратность, &ВалютаРегл) КАК Кратность,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.СпособРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)) КАК СпособРасчета,
	|	КурсыВалютДляРасчетовПоАренде.Коэффициент,
	|	КурсыВалютДляРасчетовПоАренде.НижняяГраница,
	|	КурсыВалютДляРасчетовПоАренде.ВерхняяГраница,
	|	ПримечанияПоДоговорамАренды.Примечание КАК Примечание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаткиВзаиморасчетов.СуммаОстаток, 0) > 0
	|			ТОГДА ВТ_ОстаткиВзаиморасчетов.СуммаОстаток
	|		ИНАЧЕ 0
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	КОНЕЦ КАК Переплата
	|	КОНЕЦ КАК Переплата,
	|	ВТ_СводныеДанные.Аванс КАК Аванс,
	//--- AK suvv
	//+++АК LAGP 2018.11.07 ИП-00020021 Добавлен менеджер по аренде
	|	СоответствиеОбъектРольСрезПоследних.РольПользователя КАК МенеджерПоАренде
	//---АК LAGP
	|ИЗ
	|	ВТ_СводныеДанные КАК ВТ_СводныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде КАК КурсыВалютДляРасчетовПоАренде
	|		ПО ВТ_СводныеДанные.ДоговорКонтрагента = КурсыВалютДляРасчетовПоАренде.ДоговорКонтрагента
	|			И ВТ_СводныеДанные.Регистратор = КурсыВалютДляРасчетовПоАренде.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримечанияПоДоговорамАренды КАК ПримечанияПоДоговорамАренды
	|		ПО ВТ_СводныеДанные.ДоговорКонтрагента = ПримечанияПоДоговорамАренды.ДоговорКонтрагента
	|			И ВТ_СводныеДанные.МесяцАренды = ПримечанияПоДоговорамАренды.МесяцАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВзаиморасчетов КАК ВТ_ОстаткиВзаиморасчетов
	|		ПО ВТ_СводныеДанные.ДоговорКонтрагента.Организация = ВТ_ОстаткиВзаиморасчетов.Организация
	|			И ВТ_СводныеДанные.ДоговорКонтрагента.Владелец = ВТ_ОстаткиВзаиморасчетов.Контрагент
	|			И ВТ_СводныеДанные.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница = ВТ_ОстаткиВзаиморасчетов.СтруктурнаяЕдиница,
	//+++АК LAGP 2018.11.07 ИП-00020021 Добавлен менеджер по аренде
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
	|			,
	|			ТипРолиID = ""MenegerPoArende""
	|			И НЕ РольПользователя = ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)) КАК СоответствиеОбъектРольСрезПоследних
	|		ПО ВТ_СводныеДанные.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница = СоответствиеОбъектРольСрезПоследних.Объект
	//---АК LAGP
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_СводныеДанные.ДоговорКонтрагента.Организация,
	|	ВТ_СводныеДанные.ДоговорКонтрагента.Владелец,
	|	ВТ_СводныеДанные.ДоговорКонтрагента,
	|	ВТ_СводныеДанные.ТипАренднойПлаты,
	|	МесяцАренды
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(СтавкаНДС),
	|	МАКСИМУМ(СтруктурнаяЕдиница),
	|	МАКСИМУМ(Комментарий),
	|	МАКСИМУМ(ЧислоОплатыАренды),
	|	МАКСИМУМ(СрокОплатыАренды),
	|	МАКСИМУМ(ДатаНачалаАренды),
	|	МАКСИМУМ(ДатаОкончанияАренды),
	|	МАКСИМУМ(ДатаОплаты),
	|	МАКСИМУМ(ПлатежПросрочен),
	|	МАКСИМУМ(ПлатежаНет),
	|	МАКСИМУМ(ЕстьНепроведенныйПлатеж),
	|	МАКСИМУМ(СтатусОплаты),
	|	МАКСИМУМ(ПлатежныйДокумент),
	|	МАКСИМУМ(Примечание),
	|	МАКСИМУМ(Переплата)	
	|ПО
	|	ДоговорКонтрагента,
	|	ФормаОплаты,
	|	МесяцАренды,
	//+++ AK suvv 14.06.2018 ИП-00018763
	//|	ТипАренднойПлаты
	|	ТипАренднойПлаты,
	|	Аванс,
	//--- AK suvv
	//+++АК LAGP 2018.11.07 ИП-00020021 Добавлен менеджер по аренде
	|	МенеджерПоАренде
	//---АК LAGP
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//+++АК sils 07.02.2018 ИП-00017819
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ВЫБОР
	|		КОГДА ВТ_ПлатежныеДокументыНепроведенные.ПлатежныйДокумент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНепроведенныйПлатеж", 
		"ВЫБОР
	|		КОГДА ВТ_ПлатежныеДокументыНепроведенные.ПлатежныйДокумент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_ПлатежныеДокументыНепроведенные.ПлатежныйДокумент.ПометкаУдаления 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	КОНЕЦ КАК ЕстьНепроведенныйПлатеж");
	//+++АК ILIK 2018.09.06 ИП-00019717 
	//Запрос.УстановитьПараметр("СледующийМесяцПК", КонецМесяца(Параметры.МесяцПлатежногоКалендаря) + 1);
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, 
	//	"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних", 
	//	"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(ДОБАВИТЬКДАТЕ(&СледующийМесяцПК, ДЕНЬ, -1), ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних", 
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(&ТекущаяДата, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних");
	//---АК ILIK
	//---АК
	
	//+++АК sils 06.04.2018 ИП-00018073
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)", 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 2)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА &МесяцПлатежногоКалендаря", 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|			ТОГДА &МесяцПлатежногоКалендаря");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|	КОНЕЦ", 
		"ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|					И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|			ИЛИ НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|				И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)
	|	КОНЕЦ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВТ_ПлатежныеДокументы.ДатаОплаты, ЕСТЬNULL(ВТ_Заявки.ДатаОплаты, ВТ_ПланируемыеПлатежиСДатамиОплаты.ДатаОплаты)), МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|			ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = &МесяцПлатежногоКалендаря
	|			ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|				И ВТ_ПлатежныеДокументы.ДатаОплаты ЕСТЬ NULL 
	|				И ВТ_Заявки.ДатаОплаты ЕСТЬ NULL ", 
		"НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВТ_ПлатежныеДокументы.ДатаОплаты, ЕСТЬNULL(ВТ_Заявки.ДатаОплаты, ВТ_ПланируемыеПлатежиСДатамиОплаты.ДатаОплаты)), МЕСЯЦ) = &МесяцПлатежногоКалендаря
	|		ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = &МесяцПлатежногоКалендаря
	|		ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, -1)
	|			И ВТ_ПлатежныеДокументы.ДатаОплаты ЕСТЬ NULL
	|			И ВТ_Заявки.ДатаОплаты ЕСТЬ NULL
	|		ИЛИ ВТ_ПланируемыеПлатежиСДатамиОплаты.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.АвансЗа2Месяца)
	|			И ВТ_ПланируемыеПлатежиСДатамиОплаты.МесяцОплаты = ДОБАВИТЬКДАТЕ(&МесяцПлатежногоКалендаря, МЕСЯЦ, 1)");
	//---АК
	
	Возврат Запрос.Выполнить();

КонецФункции

//+++АК LAGP 2018.11.13 ИП-00020021 Рассылка менеджерам по аренде о приостановке оплат
Процедура УведомитьМенеджеровОприостановкеОплаты(Договор = Неопределено) Экспорт
	
	ЗапросПлатежногоКалендаря = Новый Запрос;
	ЗапросПлатежногоКалендаря.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 14
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря < &НачалоСледующегоМесяца
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаКалендаря УБЫВ";

	ЗапросПлатежногоКалендаря.УстановитьПараметр("НачалоСледующегоМесяца", НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1)));
	
	РезультатЗапросаПлатежногоКалендаря = ЗапросПлатежногоКалендаря.Выполнить();

	ВозниклаОшибкаПолученияПлатёжногоКалендаря = Ложь;

	За7ДнейДо 	= Дата(1,1,1);
	За2ДняДо	= За7ДнейДо;

	ОписаниеОшибки = "";
	Если НЕ РезультатЗапросаПлатежногоКалендаря.Пустой() Тогда
		ТЗПлатёжногоКалендаря = РезультатЗапросаПлатежногоКалендаря.Выгрузить();	
		Если ТЗПлатёжногоКалендаря.Количество() <= 14 Тогда
			За7ДнейДо 	= ТЗПлатёжногоКалендаря[7].ДатаКалендаря;
			За2ДняДо 	= ТЗПлатёжногоКалендаря[2].ДатаКалендаря;
		Иначе
			ВозниклаОшибкаПолученияПлатёжногоКалендаря = Истина;
			ОписаниеОшибки = ОписаниеОшибки() + ТЗПлатёжногоКалендаря.Количество();
		КонецЕсли;
	Иначе
		ВозниклаОшибкаПолученияПлатёжногоКалендаря = Истина;	
	КонецЕсли;	

	Если ВозниклаОшибкаПолученияПлатёжногоКалендаря Тогда	
		СтруктураНовогоПисьма = Новый Структура;
		Кому = Новый СписокЗначений;
		Кому.Добавить("lagp@automacon.ru");
		СтруктураНовогоПисьма.Вставить("Кому", Кому);
		СтруктураНовогоПисьма.Вставить("Тема", "ВозниклаОшибкаПолученияПлатёжногоКалендаря");
		СтруктураНовогоПисьма.Вставить("Тело", "Справочник.ПериодическиеЗадания - Рассылка о приостановке оплат" + Символы.ПС + ОписаниеОшибки);		
		Попытка
			ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураНовогоПисьма);
		Исключение	
		КонецПопытки;
	КонецЕсли;	

	Если (НачалоДня(ТекущаяДата()) = За2ДняДо ИЛИ НачалоДня(ТекущаяДата()) = За7ДнейДо) ИЛИ (НачалоДня(ТекущаяДата()) >= За2ДняДо И ЗначениеЗаполнено(Договор)) И НЕ ВозниклаОшибкаПолученияПлатёжногоКалендаря Тогда	
		ЗапросПриостановленныхДоговоров = Новый Запрос;
		ЗапросПриостановленныхДоговоров.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОплатыПоДоговорамАрендыСрезПоследних.Договор КАК Договор,
		|	СтатусыОплатыПоДоговорамАрендыСрезПоследних.Период КАК Период,
		|	СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус,
		|	СтатусыОплатыПоДоговорамАрендыСрезПоследних.Автор,
		|	ВЫРАЗИТЬ(СтатусыОплатыПоДоговорамАрендыСрезПоследних.Комментарий КАК СТРОКА(100)) КАК Комментарий
		|ПОМЕСТИТЬ втСтатусыОплат
		|ИЗ
		|	РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(&НачалоОплат, Период > &НачалоЭтогоМесяца) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСтатусыОплат.Договор,
		|	втСтатусыОплат.Период КАК Период,
		|	втСтатусыОплат.Статус,
		|	втСтатусыОплат.Автор,
		|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
		|	втСтатусыОплат.Комментарий
		|ПОМЕСТИТЬ втДоговораСтруктурныеЕдиницы
		|ИЗ
		|	втСтатусыОплат КАК втСтатусыОплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО втСтатусыОплат.Договор.ОбъектАренды.СтруктурнаяЕдиница = СтруктурныеЕдиницы.Ссылка
		|ГДЕ
		|	втСтатусыОплат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОплатыДоговоровКонтрагентов.Приостановлен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоговораСтруктурныеЕдиницы.Договор,
		|	втДоговораСтруктурныеЕдиницы.Автор,
		|	втДоговораСтруктурныеЕдиницы.Период КАК Период,
		|	СоответствиеОбъектРольСрезПоследних.Объект КАК СтруктурнаяЕдиница,
		|	СоответствиеОбъектРольСрезПоследних.РольПользователя КАК РольМенеджерПоАренде,
		|	втДоговораСтруктурныеЕдиницы.Комментарий
		|ИЗ
		|	втДоговораСтруктурныеЕдиницы КАК втДоговораСтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРолиID = ""MenegerPoArende""
		|					И НЕ РольПользователя = ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)) КАК СоответствиеОбъектРольСрезПоследних
		|		ПО втДоговораСтруктурныеЕдиницы.СтруктурнаяЕдиница = СоответствиеОбъектРольСрезПоследних.Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеОбъектРольСрезПоследних.РольПользователя,
		|	втДоговораСтруктурныеЕдиницы.Договор,
		|	втДоговораСтруктурныеЕдиницы.Автор,
		|	втДоговораСтруктурныеЕдиницы.Период,
		|	СоответствиеОбъектРольСрезПоследних.Объект,
		|	втДоговораСтруктурныеЕдиницы.Комментарий
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоответствиеОбъектРольСрезПоследних.РольПользователя
		|ИТОГИ ПО
		|	РольМенеджерПоАренде";
		
		ЗапросПриостановленныхДоговоров.УстановитьПараметр("НачалоОплат",  НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1)));		
		ЗапросПриостановленныхДоговоров.УстановитьПараметр("НачалоЭтогоМесяца",  НачалоМесяца(ТекущаяДата()));
		
		Если ЗначениеЗаполнено(Договор) Тогда
			ЗапросПриостановленныхДоговоров.Текст = СтрЗаменить(ЗапросПриостановленныхДоговоров.Текст, "Период > &НачалоЭтогоМесяца", "Период > &НачалоЭтогоМесяца И Договор = &Договор");
			ЗапросПриостановленныхДоговоров.УстановитьПараметр("Договор",  Договор);	
		КонецЕсли;	
		
		РезультатЗапросаПриостановленныхДоговоров = ЗапросПриостановленныхДоговоров.Выполнить();
		
		Если НЕ РезультатЗапросаПриостановленныхДоговоров.Пустой() Тогда	
			ВыборкаРольМенеджерПоАренде = РезультатЗапросаПриостановленныхДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРольМенеджерПоАренде.Следующий() Цикл
				Макет = Обработки.ПлатежныйКалендарьПоАренде.ПолучитьМакет("МакетПисьмаМенеджерамОСтопОплате");
				ТабДок = Новый ТабличныйДокумент();
				Область = Макет.ПолучитьОбласть("Шапка");
				ТабДок.Вывести(Область);
				
				Кому = Новый СписокЗначений;
				Тема = "";
				Тело = "";
				СписокМенеджеров = ВыборкаРольМенеджерПоАренде.РольМенеджерПоАренде.СоставРоли;
				
				МассивФизЛицМенеджеровПоАренде = СписокМенеджеров.ВыгрузитьКолонку("Сотрудник");
				МассивФизЛицМенеджеровПоАренде.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("0000000354"));
				МассивФизЛицМенеджеровПоАренде.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("0000002617"));
				
				СтруктураАдресовМенеджеровПоАренде = УправлениеЭлектроннойПочтой.ЭлектронныеАдресаФизическихЛиц(МассивФизЛицМенеджеровПоАренде);		
								
				ВыборкаДетальныеЗаписи = ВыборкаРольМенеджерПоАренде.Выбрать();
				НомераОбъектов = "";
				Тема = "В платежном календаре приостановлена арендная плата.";
				
				Кому.Очистить();
				Для каждого ЭлементМассиваАдресовМенеджеровПоАренде Из СтруктураАдресовМенеджеровПоАренде Цикл
					Кому.Добавить(ЭлементМассиваАдресовМенеджеровПоАренде.Адрес);
					//Тема = Тема + " " + ЭлементМассиваАдресовМенеджеровПоАренде.Адрес;
				КонецЦикла;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				
					Область = Макет.ПолучитьОбласть("Строка");
					Область.Параметры.ОбъектАренды 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ОбъектАренды");
					Область.Параметры.Контрагент 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "Владелец");
					Область.Параметры.Договор 		= "" + ВыборкаДетальныеЗаписи.Договор + " (" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "Код") + ")";
					Область.Параметры.Период 		= ВыборкаДетальныеЗаписи.Период;
					Область.Параметры.Автор 		= ВыборкаДетальныеЗаписи.Автор;
					Область.Параметры.Комментарий 	= ВыборкаДетальныеЗаписи.Комментарий;
					ТабДок.Вывести(Область);			
				КонецЦикла;	
		
				ВремФайл = ПолучитьИмяВременногоФайла("htm");
				ТабДок.Записать(ВремФайл, ТипФайлаТабличногоДокумента.HTML4);
				
				ТекстДокумент = Новый ТекстовыйДокумент();
				ТекстДокумент.Прочитать(ВремФайл);
				
				Текст = ТекстДокумент.ПолучитьТекст();
				НачалоБлокаСтиль = Найти(Текст, "<STYLE");
				КонецБлокаСтиль = Найти(Текст, "</STYLE");
				ТекстСтиль = Сред(Текст, НачалоБлокаСтиль, КонецБлокаСтиль - НачалоБлокаСтиль + 8);
				НачалоБлокаТело = Найти(Текст, "<BODY");
				КонецБлокаТело = Найти(Текст, "</BODY");
				ТекстТело = Сред(Текст, НачалоБлокаТело, КонецБлокаТело - НачалоБлокаТело + 7);
				
				ТекстПолный = "<HTML>" + Символы.ПС + ТекстСтиль + Символы.ПС + ТекстТело + Символы.ПС + "</HTML>";
				ТекстПолный = СтрЗаменить(ТекстПолный, "CELLSPACING=0", "CELLSPACING=0; border = 5");
				
				Тело = ТекстПолный;
				ТекстДокумент = Неопределено;				
				УдалитьФайлы(ВремФайл);
				
				СтруктураНовогоПисьма = Новый Структура;
				//Кому = Новый СписокЗначений; //
				Кому.Добавить("lagp@automacon.ru");
				СтруктураНовогоПисьма.Вставить("Кому", Кому);
				СтруктураНовогоПисьма.Вставить("Тема", Тема);
				СтруктураНовогоПисьма.Вставить("Тело", Тело);
				СтруктураНовогоПисьма.Вставить("ТипТекста", ТипТекстаПочтовогоСообщения.HTML);
				ВозниклаОшибкаОтправкиПисьма = ЛОЖЬ;
				ОписаниеОшибки = "";
				Попытка
					ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураНовогоПисьма);
				Исключение
					ВозниклаОшибкаОтправкиПисьма = ИСТИНА;
					ОписаниеОшибки = ОписаниеОшибки();
				КонецПопытки;
				
				Если ВозниклаОшибкаОтправкиПисьма Тогда	
					СтруктураНовогоПисьма = Новый Структура;
					Кому = Новый СписокЗначений;
					Кому.Добавить("lagp@automacon.ru");
					СтруктураНовогоПисьма.Вставить("Кому", Кому);
					СтруктураНовогоПисьма.Вставить("Тема", "ВозниклаОшибкаОтправкиПисьма");
					СтруктураНовогоПисьма.Вставить("Тело", "Справочник.ПериодическиеЗадания - Рассылка о приостановке оплат" + Символы.ПС + ОписаниеОшибки);		
					Попытка
						ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураНовогоПисьма);
					Исключение	
					КонецПопытки;
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	