
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Сп=РасшифроватьОтчет(Расшифровка,СтандартнаяОбработка);
	Если НЕ Сп=Неопределено Тогда
		Парам=Новый Структура("Ключ",Сп);	
	    ОткрытьФорму("Документ.ПриходныйОрдерСклад.Форма.ФормаДокументаУправляемая",Парам);
	
	КонецЕсли; 
КонецПроцедуры


Процедура ПолучитьСтруктуруВозврата(ПолеИлиГруппировка,СтруктураПолей)
	МассивРодителей = ПолеИлиГруппировка.ПолучитьРодителей();
	Для Каждого Стр из МассивРодителей Цикл
		Если ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда 
			ПолучитьСтруктуруВозврата(Стр,СтруктураПолей);
		ИначеЕсли ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ПоляГруппировки = Стр.ПолучитьПоля();
			Для Каждого гСтр из ПоляГруппировки Цикл
				Если СтруктураПолей.Свойство(гСтр.Поле) Тогда
					Если Не ЗначениеЗаполнено(СтруктураПолей[гСтр.Поле]) Тогда
						СтруктураПолей[гСтр.Поле] = гСтр.Значение;
					КонецЕсли;
				КонецЕсли;
				ПолучитьСтруктуруВозврата(Стр,СтруктураПолей);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция РасшифроватьОтчет(Расшифровка,СтандартнаяОбработка)
	СтруктураВозврата = Новый Структура("НомерПО, ДатаПО");
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	ПолучитьСтруктуруВозврата(Данные.Элементы[Расшифровка],СтруктураВозврата);
	
	ДатаОтчета = ТекущаяДата();

	НомерПО = СтруктураВозврата.НомерПО;
	ДатаПО = СтруктураВозврата.ДатаПО;
	
	Если  ЗначениеЗаполнено(НомерПО) И ЗначениеЗаполнено(ДатаПО) Тогда
		СтандартнаяОбработка=Ложь;
	    Сп=Документы.ПриходныйОрдерСклад.НайтиПоНомеру(НомерПО);
	
		
	    Возврат Сп;
	КонецЕсли; 
	
	Возврат Неопределено;

	
КонецФункции
