
Функция ПолучитьПояснение(ИмяПоля, ТипПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПоля = ИмяПоля;
	МенеджерЗаписи.ТипПродукции = ТипПродукции;
	МенеджерЗаписи.Прочитать();
	
	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Пояснение, Неопределено);
	
КонецФункции

//+++АК SHEP 2018.05.30 ИП-00018753.01
Функция ПолучитьВсеПояснения(ТипПродукции) Экспорт
	
	СтруктураПояснений = Новый Структура;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоясненияКартДизайнПроектов.ИмяПоля КАК Ключ,
		|	ПоясненияКартДизайнПроектов.Пояснение КАК Значение
		|ИЗ
		|	РегистрСведений.ПоясненияКартДизайнПроектов КАК ПоясненияКартДизайнПроектов
		|ГДЕ
		|	ПоясненияКартДизайнПроектов.ТипПродукции = &ТипПродукции");
	Запрос.УстановитьПараметр("ТипПродукции", ТипПродукции);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтруктураПояснений.Вставить(ВыборкаЗапроса.Ключ, ВыборкаЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураПояснений;
	
КонецФункции
