
//+++АК SHEP 2018.04.13 ИП-00017032: чистим кэш пояснений на сайте кабинета поставщика, чтобы они обновились
Процедура ПриЗаписи(Отказ, Замещение)
	
	//в общем случае, используются два набора записей: один предназначен для удаления "старой" записи, другой - для записи данных, определенных менеджером записи.
	//Это проявляется, например, в том, что при выполнении записи могут дважды вызываться события ПередЗаписью и ПриЗаписи объекта РегистрСведенийНаборЗаписей.,
	//сначала для пустого набора записей удаляющего "старую" запись, а затем для набора записей с новыми данными.
	Если Замещение Тогда Возврат; КонецЕсли; // вызывается 2 раза
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаНаКабинетПоставщика = РегистрыСведений.ПараметрыРаботыССоцСетями.ПолучитьЗначениеПараметра(ПредопределенноеЗначение("Справочник.ИсточникиОбращений.ПустаяСсылка"), "КабинетПоставщика");
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаКабинетПоставщика) Тогда Возврат; КонецЕсли;
	
	АдресЧисткиКэшаПояснений = "site/clear?key=8t9vTvyWD3";
	Если Истина Тогда
		Соединение = Новый HTTPСоединение(СтрЗаменить(НРег(СсылкаНаКабинетПоставщика), "http://", ""));
		ХТТПЗапрос = Новый HTTPЗапрос(АдресЧисткиКэшаПояснений);
		ОтветСтрокой = Соединение.Получить(ХТТПЗапрос).ПолучитьТелоКакСтроку();
	Иначе
		АдресСервера = СсылкаНаКабинетПоставщика + "/" + АдресЧисткиКэшаПояснений;
		Соединение = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		Соединение.Open("GET", АдресСервера);
		Соединение.Send();
		ОтветСтрокой = Соединение.ResponseText();
	КонецЕсли;
	
	//Сообщить(ОтветСтрокой);
	
КонецПроцедуры
