
Процедура ПриЗаписи(Отказ, Замещение)
	
	//
	Если НЕ Отказ Тогда
	
		//
		ТЗ = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		     |	УЕК_ПланыПродажПоДнямНедели.НомерНеделиВыставленияПлана КАК НомерНедели
		     |ИЗ
		     |	РегистрСведений.УЕК_ПланыПродажПоДнямНедели КАК УЕК_ПланыПродажПоДнямНедели
		     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЕК_ПланируемыеТТ КАК УЕК_ПланируемыеТТ
		     |		ПО УЕК_ПланыПродажПоДнямНедели.НомерНеделиВыставленияПлана = УЕК_ПланируемыеТТ.НомерНедели
		     |ГДЕ
		     |	УЕК_ПланируемыеТТ.НомерНедели ЕСТЬ NULL ";
			 
		//			 
		ПЗ_НомераНедели = Новый ПостроительЗапроса;
		ПЗ_НомераНедели.Текст = ТЗ;
		
		//
		ПЗ_НомераНедели.Выполнить();
		
		//
		Если НЕ ПЗ_НомераНедели.Результат.Пустой() Тогда
			
			//
			ТЗ = "ВЫБРАТЬ
			     |	СоответствиеДатДнямНедели.НомерНедели,
			     |	МИНИМУМ(СоответствиеДатДнямНедели.Дата) КАК НачалоПериода,
			     |	МАКСИМУМ(СоответствиеДатДнямНедели.Дата) КАК КонецПериода
			     |ПОМЕСТИТЬ ТЗ_Границы
			     |ИЗ
			     |	РегистрСведений.СоответствиеДатДнямНедели КАК СоответствиеДатДнямНедели
			     |ГДЕ
			     |	СоответствиеДатДнямНедели.НомерНедели = &НомерНедели
			     |
			     |СГРУППИРОВАТЬ ПО
			     |	СоответствиеДатДнямНедели.НомерНедели
			     |;
			     |
			     |////////////////////////////////////////////////////////////////////////////////
			     |ВЫБРАТЬ РАЗЛИЧНЫЕ
			     |	СтруктурныеЕдиницы.Ссылка КАК ТорговаяТочка,
			     |	ТЗ_Границы.НомерНедели КАК НомерНедели,
			     |	СтруктурныеЕдиницы.id_TT КАК id_TT
			     |ИЗ
			     |	ТЗ_Границы КАК ТЗ_Границы
			     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			     |		ПО (ТЗ_Границы.КонецПериода МЕЖДУ СтруктурныеЕдиницы.ДатаОткрытия И ВЫБОР
			     |				КОГДА СтруктурныеЕдиницы.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			     |					ТОГДА ДАТАВРЕМЯ(3001, 1, 1)
			     |				ИНАЧЕ СтруктурныеЕдиницы.ДатаЗакрытия
			     |			КОНЕЦ)
			     |			И (СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
			     |			И (СтруктурныеЕдиницы.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин))
			     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних КАК ЦФОСтруктурныхЕдиницСрезПоследних
			     |		ПО (СтруктурныеЕдиницы.Ссылка = ЦФОСтруктурныхЕдиницСрезПоследних.СтруктурнаяЕдиница)
			     |			И (ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО.Код <> ""ЦФО_88"")
			     |
			     |УПОРЯДОЧИТЬ ПО
			     |	id_TT";
				 
			//
			ПЗ = Новый ПостроительЗапроса;
			ПЗ.Текст = ТЗ;
			
			
			//
			ВыборкаНомераНедели = ПЗ_НомераНедели.Результат.Выбрать();
			Пока ВыборкаНомераНедели.Следующий() Цикл
			
				//
				ПЗ.Параметры.Вставить("НомерНедели", ВыборкаНомераНедели.НомерНедели);
				
				//
				ПЗ.Выполнить();
				
				//
				Выборка = ПЗ.Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					//
					МЗ = РегистрыСведений.УЕК_ПланируемыеТТ.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МЗ, Выборка);
					
					//
					МЗ.Записать();
					
				КонецЦикла;	
				
			КонецЦикла; 
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	
КонецПроцедуры
