
Функция Печать(ПараметрКоманды, СПодписью)
	
	Возврат Документы.АктПеревозчика.ПечатьТТН(ПараметрКоманды, СПодписью);
	
КонецФункции

Функция ПроверитьСервер(ПараметрКоманды)
	
	Возврат (ПараметрКоманды.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ДоставкаНаСклад);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Если ПроверитьСервер(ПараметрКоманды) Тогда
	//	Сообщить("Печать ТТН не предусмотрена для вида операции ""Доставка на склад""!");
	//	Возврат;
	//КонецЕсли;
	
	СПодписью = Ложь;
	Ответ = Вопрос("Формировать с подписью руководителя?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СПодписью = Истина;
	Иначе 	
		СПодписью = Ложь;
	КонецЕсли;	
	
	ТабДокумент = Печать(ПараметрКоманды, СПодписью);

	ОповеститьОбИзменении(ПараметрКоманды);
	
	ТабДокумент.Показать("Печать ТТН");
	
КонецПроцедуры
