&НаСервере
Функция Печать(ПараметрКоманды)
	//+++АК BELN 2018.11.06 ИП-00019252 
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Документы.РасходныйОрдерСклад.ДоступнаПечать() Тогда
		Сообщить("Нет права на печать");
		Возврат Неопределено;
	КонецЕсли; 
	//---АК BELN 2018.11.06	
	Возврат Документы.РасходныйОрдерСклад.ПечатьТТН(ПараметрКоманды);
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Печать(ПараметрКоманды);
  	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	//+++AK VERN 2016.07.06 12796
	//ТабДок.Показать();
	//+++AK VERN 2016.07.06 12796 Окну документа дадим заголовок
	ТабДок.Показать("Печать ТТН");
	//---AK VERN
	
КонецПроцедуры
