
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьПереченьДокументовСервер();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПереченьДокументовСервер()
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПоступлениеТоваровУслуг.Ссылка,
	             |	ИСТИНА КАК Пометка,
	             |	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ) КАК Выгружен
	             |ИЗ
	             |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |		ПО ПоступлениеТоваровУслуг.Ссылка = ЗначенияСвойствОбъектов.Объект
	             |			И (ЗначенияСвойствОбъектов.Свойство.Код = ""00000000011"")
	             |ГДЕ
	             |	(ПоступлениеТоваровУслуг.Контрагент = &Контрагент
	             |			ИЛИ &ВсеКонтрагенты)
	             |	И (ПоступлениеТоваровУслуг.Организация = &Организация
	             |			ИЛИ &ВсеОрганизации)
	             |	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаС И &ДатаПо
	             |	И НЕ ПоступлениеТоваровУслуг.НеВыгружатьВБУ";
	Запрос=Новый Запрос(ТекстЗапроса);			 
	Запрос.УстановитьПараметр("ДатаС",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВсеКонтрагенты",НЕ ЗначениеЗаполнено(Контрагент));
	Запрос.УстановитьПараметр("ВсеОрганизации",НЕ ЗначениеЗаполнено(Организация));
	ТЗ=Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"ПереченьДокументов");
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьВБухгалтерию(Команда)
	ВыгрузитьНаСервере();
	Предупреждение("Документы выгружены");
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	ТЗВыгрузки=Новый ТаблицаЗначений;
	ТЗВыгрузки.Колонки.Добавить("Вид");
	ТЗВыгрузки.Колонки.Добавить("УИН");
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключитьс к базе бухгалтерии");
		Возврат;
		
	КонецПопытки;
	Обр=v82.Обработки.АК_ИмпортДанныхИз_1С_ФУ_Бухгалтерия.Создать();
	Для Каждого Стр Из ПереченьДокументов Цикл
		Если Стр.Пометка Тогда
			НС=ТЗВыгрузки.Добавить();
			НС.УИН=СокрЛП(Стр.Ссылка.УникальныйИдентификатор());
			НС.Вид=Стр.Ссылка.Метаданные().Имя;
		КонецЕсли;	
	КонецЦикла;	
	//Перечень=ПереченьДокументов.Выгрузить(Новый Структура("Пометка",Истина)).ВыгрузитьКолонку("Ссылка");
	Обр.ИмпортДокументовСервер(ТЗВыгрузки);
КонецПроцедуры	


&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Стр Из ПереченьДокументов Цикл
		Стр.Пометка = Истина;
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Стр Из ПереченьДокументов Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьНеВыгруженные(Команда)
	Для Каждого Стр Из ПереченьДокументов Цикл
		Если НЕ Стр.Выгружен Тогда
			Стр.Пометка = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
	
