
&НаКлиенте
Процедура ЗаменитьФайл(Команда)
	ТекущиеДанные=Элементы.Результаты.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ИмяФайла) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "ru = ""К строке уже приложен файл, хотите его заменить?"";" ;
			Ответ = Вопрос(НСтр(Текст), Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
	        ВыбранноеИмяФайла=ИмяФайла;
	    КонецЦикла;
	Иначе
	    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
	    Предупреждение(НСтр(Текст));
	КонецЕсли;

	Файл = Новый Файл(ВыбранноеИмяФайла);
	Если Файл.Существует() Тогда
		АдресХранилища = "";
				//ПоместитьФайл(АдресХранилища,, Файл.ПолноеИмя,, Новый УникальныйИдентификатор);
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый УникальныйИдентификатор);
				
		ВставитьФайлНаСервере(АдресХранилища, Файл.Имя, Файл.ПолноеИмя);
	КонецЕсли;
	РезультатыПриАктивизацииСтроки(Неопределено);	
КонецПроцедуры

&НаСервере
Процедура ВставитьФайлНаСервере(АдресХранилища, ИмяФайла, ИмяФайлаПолное) 
	
	ТекущиеДанные=Объект.Результаты.НайтиПоИдентификатору(Элементы.Результаты.ТекущаяСтрока);
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекСтрока=ЭтотОбъект.Результаты[ТекущиеДанные.НомерСтроки-1];
	
	ИмяКаталога = "\\server00\Temp";
	
	Расширешие = "";
	
	Если Найти(НРег(ИмяФайла), ".doc") > 0 Тогда
		Расширешие = ".doc"; 	
	ИначеЕсли Найти(НРег(ИмяФайла), ".docx") > 0 Тогда
		Расширешие = ".docx";	
	ИначеЕсли Найти(НРег(ИмяФайла), ".xls") > 0 Тогда  		
		Расширешие = ".xls";
	ИначеЕсли Найти(НРег(ИмяФайла), ".jpg") > 0 Тогда
		Расширешие = ".jpg";
	ИначеЕсли Найти(НРег(ИмяФайла), ".jpeg") > 0 Тогда
		Расширешие = ".jpeg";
	ИначеЕсли Найти(НРег(ИмяФайла), ".pdf") > 0 Тогда	
		Расширешие = ".pdf";
	КонецЕсли;
	
	ИмяВременногоФайла = РаботаСФайлами.ПолучитьИмяФайла(ИмяКаталога, Строка(Новый УникальныйИдентификатор) + Расширешие);
		
	ДвоичныеДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(ДвоичныеДанныеИзХранилища) = Тип("ДвоичныеДанные") Тогда
				
		ТекСтрока.ХранилищеФайла 	= Новый ХранилищеЗначения(ДвоичныеДанныеИзХранилища);
		ТекСтрока.ИмяФайла 			= ИмяФайла;
		ТекСтрока.ИмяФайлаПолное 	= ИмяФайлаПолное;
		
	КонецЕсли;  
	
	ЭтотОбъект.Записать();
	ЗначениеВДанныеФормы(ЭтотОбъект, Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура РезультатыИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаменитьФайл(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура РезультатыИмяФайлаОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура РезультатыИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ТекущаяСтрокаИд = Элементы.Результаты.ТекущаяСтрока;
	ПечатьФайла(ТекущаяСтрокаИд, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьФайла(Идентификатор, СразуПечать = Истина) Экспорт   	
	
    ТекущиеДанные = Объект.Результаты.НайтиПоИдентификатору(Идентификатор);
	пИмяФайла = ТекущиеДанные.ИмяФайла;
	
	ДвоичныеДанныеИзХранилища = ПолучитьИзВременногоХранилища(ХранилищеЗначенияСервер(Идентификатор));
	
	Файл = Новый Файл(пИмяФайла);
	Если СразуПечать = Истина Тогда
		Если Найти(НРег(Файл.Расширение), ".doc") > 0 ИЛИ Найти(НРег(Файл.Расширение), ".html") > 0 Тогда
			пПрограмма = """rundll32 SHELL32.DLL,ShellExec_RunDLL winword ""пИмяФайла"" /mFilePrintDefault /mDocClose /mFileExit""";
		ИначеЕсли Найти(НРег(Файл.Расширение), ".xls") > 0 Тогда
			пПрограмма = "WScript.exe ""D:\Izbenka\Базы 1С\ExcelPrint.vbs"" ""пИмяФайла""";
		//ИначеЕсли Найти(Файл.Расширение, ".ppt") > 0 Тогда
		//	пПрограмма = """C:\Program Files (x86)\Microsoft Office\Office11\powerpnt.exe""";
		//ИначеЕсли Найти(Файл.Расширение, "vsd") > 0 Тогда
		//	пПрограмма = """C:\Program Files (x86)\Microsoft Office\Office11\visio.exe""";
		ИначеЕсли Найти(НРег(Файл.Расширение), ".bmp") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".dib") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".rle") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".jpg") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".jpeg") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".tif") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".gif") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".png") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".ico") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".wmf") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".emf") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".bmp") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".dib") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".rle") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".jpg") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".jpeg") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".tif") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".gif") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".png") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".ico") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".wmf") > 0
		ИЛИ Найти(НРег(Файл.Расширение), ".emf") > 0 Тогда
			пПрограмма = """C:\Windows\system32\mspaint.exe"" /p ""пИмяФайла""";
		ИначеЕсли Найти(НРег(Файл.Расширение), ".txt") > 0 Тогда
			пПрограмма = """C:\Windows\system32\notepad.exe"" /p ""пИмяФайла""";
		ИначеЕсли Найти(НРег(Файл.Расширение), ".pdf") > 0 Тогда	
			пПрограмма = """c:\Program Files (x86)\Foxit Software\Foxit Reader\Foxit Reader.exe"" /p ""пИмяФайла""";
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Печать файлов данного формата (" + пИмяФайла + ") не поддерживается");
			Возврат;
		КонецЕсли;
	Иначе
		//ЗапуститьПриложение(Файл.ПолноеИмя);
	КонецЕсли;
	
	ИмяКаталога = "\\server00\Temp";//РаботаСФайлами.ПолучитьИмяКаталога(); 	
	
	
	ИмяВременногоФайла = РаботаСФайлами.ПолучитьИмяФайла(ИмяКаталога, Строка(Новый УникальныйИдентификатор) + Файл.Расширение);
	//ДвоичныеДанные = пХранилище.Получить();
	Если ТипЗнч(ДвоичныеДанныеИзХранилища) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанныеИзХранилища.Записать(ИмяВременногоФайла);
		
		пПрограмма = СтрЗаменить(пПрограмма, "пИмяФайла", ИмяВременногоФайла);
		
		Если СразуПечать = Истина Тогда
			ЗапуститьПриложение(пПрограмма);
		Иначе
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
	КонецЕсли;    	
		
КонецПроцедуры

&НаСервере
Функция ХранилищеЗначенияСервер(ИдентификаторСтроки)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекущиеДанные = ЭтотОбъект.Результаты[ИдентификаторСтроки]; 
	
	Возврат ПоместитьВоВременноеХранилище(ТекущиеДанные.ХранилищеФайла.Получить(), Новый УникальныйИдентификатор);	
	
КонецФункции


&НаКлиенте
Процедура СохранитьФайлНаДиск(Команда)
	ТекущаяСтрокаИд = Элементы.Результаты.ТекущаяСтрока;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогСохраненияФайла.Заголовок   		= "Выберите каталог для сохранения файла";
	
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		
		ПутьКФайлу = ДиалогСохраненияФайла.Каталог;
		
		ТекДанные = Объект.Результаты.НайтиПоИдентификатору(ТекущаяСтрокаИд);
		ДвоичныеДанныеИзХранилища = ПолучитьИзВременногоХранилища(ХранилищеЗначенияСервер(ТекущаяСтрокаИд));
		
		Если ТипЗнч(ДвоичныеДанныеИзХранилища) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанныеИзХранилища.Записать(ПутьКФайлу +"\" + ТекДанные.ИмяФайла);
		КонецЕсли;

	КонецЕсли	

КонецПроцедуры
//+++AK obue 20160303
&НаКлиенте
Процедура РезультатыРезультатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	ВариантыГруппы = ВариантыГруппы(Элементы.Результаты.ТекущиеДанные.СтатьяАудита);
	Для каждого Вариант из ВариантыГруппы Цикл
		Элемент.СписокВыбора.Добавить(Вариант);		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВариантыГруппы(Статья)
	МассивВариантов = Новый Массив;
	Для Каждого стр из Статья.Родитель.Варианты Цикл
		МассивВариантов.Добавить(стр.Вариант);	
	КонецЦикла;
	Возврат МассивВариантов; 
КонецФункции

&НаКлиенте
Процедура РезультатыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Результаты.ТекущиеДанные; 
	Если не ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ИмяФайлаПолное) Тогда
			АдресКартинки =АдресКартинкиСервер(Элементы.Результаты.ТекущаяСтрока);
			ТекущаяКартинка = АдресКартинки;
			Элементы.ДобавитьФайл.Заголовок = "Изменить файл";
			Элементы.УдалитьФайл.Видимость = Истина;
		иначе
			ТекущаяКартинка = Неопределено;
			Элементы.ДобавитьФайл.Заголовок = "Добавить файл";
			Элементы.УдалитьФайл.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ЗаменитьФайл(Неопределено);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	УдалитьФайлСервер(Элементы.Результаты.ТекущаяСтрока);
	Модифицированность = Истина;
	РезультатыПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлСервер(ИдентификаторСтроки)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ТекущиеДанные = ЭтотОбъект.Результаты[ИдентификаторСтроки];		
	ТекущиеДанные.ХранилищеФайла = Неопределено;
	ТекущиеДанные.ИмяФайлаПолное = Неопределено;
	ТекущиеДанные.ИмяФайла = Неопределено;
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	Если ЗначениеЗаполнено(ТекущаяКартинка) Тогда
		попытка
			ПечатьФайла(Элементы.Результаты.ТекущаяСтрока, Ложь);
		исключение
			Картинка = АдресНовойКартинки(Элементы.Результаты.ТекущаяСтрока);
			ОткрытьЗначение(Картинка);	
		КонецПопытки;
	иначе
		ЗаменитьФайл(Неопределено);
		Модифицированность = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция АдресКартинкиСервер(ИдентификаторСтроки)
	возврат ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Результаты.ХранилищеФайла",ИдентификаторСтроки);	
КонецФункции

&НаСервере
Функция АдресНовойКартинки(ИдентификаторСтроки)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ТекущиеДанные = ЭтотОбъект.Результаты[ИдентификаторСтроки];
	ИмяФайла = КаталогВременныхФайлов()+ТекущиеДанные.ИмяФайла;
	ТекущиеДанные.ХранилищеФайла.Получить().Записать(ИмяФайла);
	Картинка = новый Картинка(ИмяФайла);
	возврат Картинка;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	а=1;
КонецПроцедуры
//---AK obue 

