//+++АК KIRN 2018.02.20 ИП-00017976
//Истина - соответствует
//Ложь - не соответствует
Функция ПроверитьСоответствиеРозничнойТочкиИТорговойМарки(СтруктурнаяЕдиница, ТорговаяМарка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |Выбрать Спр.ТипРозничнойТочки КАК ТипСЕ ПОМЕСТИТЬ вт ИЗ Справочник.СтруктурныеЕдиницы КАК Спр ГДЕ Спр.Ссылка = &СтруктурнаяЕдиница;
				   |////	
				   |ВЫБРАТЬ
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки,
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка
	               |ИЗ
	               |	РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК СоответствиеТиповРозничныхТочекИТорговыхМарок
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт ПО СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки = вт.ТипСЕ
	               |ГДЕ
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка = &ТорговаяМарка";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТорговаяМарка", ТорговаяМарка);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();		
КонецФункции
//---АК KIRN