
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьНадписьАкты();	
	
КонецПроцедуры

Функция КоличествоОСКОформлению()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(КОЛИЧЕСТВО(АК_ОсновныеСредстваКСписаниюОприходованиюОстатки.ОсновноеСредство),0) КАК КОЛИЧЕСТВО
		|ИЗ
		|	РегистрНакопления.АК_ОсновныеСредстваКСписаниюОприходованию.Остатки КАК АК_ОсновныеСредстваКСписаниюОприходованиюОстатки
		|ГДЕ
		|	АК_ОсновныеСредстваКСписаниюОприходованиюОстатки.КоличествоОстаток <> 0";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписьАкты()

	КоличествоОСКОформлению = КоличествоОСКОформлению();
	
	Элементы.ГруппаБезОтклонений.Видимость = (КоличествоОСКОформлению = 0);
	Элементы.ГруппаЕстьОтклонения.Видимость = (КоличествоОСКОформлению > 0);

    Элементы.НадписьОтклонения.Заголовок = "Не сформированы акты по основным средствам: " + КоличествоОСКОформлению + " шт.";		
		
КонецПроцедуры	

&НаКлиенте
Процедура НадписьСформироватьНажатие(Элемент)
	
	ОткрытьФорму("ЖурналДокументов.ДокументыОсновныеСредстваСклад.Форма.ФормаФормированиеАктов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбновитьНадписьАкты();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормирование(Команда)
	
	ОткрытьФорму("ЖурналДокументов.ДокументыОсновныеСредстваСклад.Форма.ФормаФормированиеАктов");
	
КонецПроцедуры

