
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Структура = РегистрыСведений.ОбращенияПокупателейКлассифицирующаяСистема.ЗагрузитьПараметры();	
	
	Для каждого КлючЗначение Из Структура Цикл	
		ЗаполнитьЗначенияСвойств(ТаблицаПараметры.Добавить(), КлючЗначение);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыНаСервере()
	Структура = Новый Структура;
	
	Для каждого Строка Из ТаблицаПараметры Цикл
		Структура.Вставить(Строка.Ключ, Строка.Значение);	
	КонецЦикла;
	
	РегистрыСведений.ОбращенияПокупателейКлассифицирующаяСистема.СохранитьПараметры(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПараметры(Команда)
	ЗаписатьПараметрыНаСервере();
КонецПроцедуры


