
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РольДоступнаСервер("ПолныеПрава") и ЗначениеЗаполнено(Этаформа.ОтборКамера)= Ложь Тогда
		Возврат;
	КонецЕсли;
	
	//
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDКамеры");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = ЗначениеЗаполнено(ОтборКамера);
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение = ОтборКамера;
	
	//
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Магазин");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ОтборМагазин);
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение = ОтборМагазин;
	
	//
	Если НЕ ПризнакНеИгнорироватьПустыеОбъектыНаблюдения Тогда	
		
		//
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектНаблюдения");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры

Функция РольДоступнаСервер(РольСтрока)
	
	Возврат РольДоступна(РольСтрока);
КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//
	Если НЕ Копирование Тогда
		
		//
		Отказ = Истина;
		
		//
		Форма = ПолучитьФорму("РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.Форма.ФормаЗаписи");
		
		//
		Форма.Период = ТекущаяДата();
		
		//
		Форма.IDКамеры = ОтборКамера;
		Форма.Магазин = ОтборМагазин;
		
		//
		Форма.X1 = X1;
		Форма.X2 = X2;
		Форма.X3 = X3;
		Форма.X4 = X4;
		
		//
		Форма.Y1 = Y1;
		Форма.Y2 = Y2;
		Форма.Y3 = Y3;
		Форма.Y4 = Y4;
		
		//
		Форма.Открыть();
		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
	Если Параметры.РежимВыбора = Истина Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;	
	
	
КонецПроцедуры


//+++ZEZA


//---ZEZA

