
&НаСервереБезКонтекста
Функция ПолучитьОсновныеСредства(мСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", мСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеОСНоменклатура.НомерСтроки,
	|	ПоступлениеОСНоменклатура.ОсновноеСредство,
	|	ПоступлениеОСНоменклатура.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПоступлениеОСНоменклатура.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ПоступлениеОСНоменклатура.ИнвентарныйНомер КАК ИнвентарныйНомерСтарый,
	|	ПоступлениеОСНоменклатура.ЗаводскойНомер КАК ЗаводскойНомерСтарый
	|ИЗ
	|	Документ.ПоступлениеОС.Номенклатура КАК ПоступлениеОСНоменклатура
	|ГДЕ
	|	ПоступлениеОСНоменклатура.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ДокументСсылка = ЭтаФорма.Параметры.ДокументСсылка;
	
	мТаблицаОС = ПолучитьОсновныеСредства(ЭтаФорма.ДокументСсылка);
	ЭтаФорма.ОсновныеСредства.Загрузить(мТаблицаОС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры


Процедура ЗаписатьСервер()
	
	мОсновныеСредства 	= ЭтаФорма.ОсновныеСредства.Выгрузить();
	мДокументСсылка		= ЭтаФорма.ДокументСсылка;
	
	Для Каждого СтрокаТаблицы Из мОсновныеСредства Цикл
		Если СтрокаТаблицы.ИнвентарныйНомер = СтрокаТаблицы.ИнвентарныйНомерСтарый
				И СтрокаТаблицы.ЗаводскойНомер = СтрокаТаблицы.ЗаводскойНомерСтарый Тогда
			Продолжить;
		КонецЕсли;
		
		
		// корректировка ТЧ документа
		ДокументОбъект = мДокументСсылка.ПолучитьОбъект();
		СтрокаИзменения = ДокументОбъект.Номенклатура.Найти(СтрокаТаблицы.НомерСтроки, "НомерСтроки");
		Если СтрокаИзменения = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		СтрокаИзменения.ЗаводскойНомер 		= СтрокаТаблицы.ЗаводскойНомер; 
		СтрокаИзменения.ИнвентарныйНомер 	= СтрокаТаблицы.ИнвентарныйНомер;
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		// перезапись элемента справочника ОС
		ОСОбъект = СтрокаТаблицы.ОсновноеСредство.ПолучитьОбъект();
		ОСОбъект.ИнвентарныйНомер 	= СтрокаТаблицы.ИнвентарныйНомер;
		ОСОбъект.ЗаводскойНомер 	= СтрокаТаблицы.ЗаводскойНомер; 
		Попытка
			ОСОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
			
	КонецЦикла;
	
	ЭтаФорма.ОсновныеСредства.Очистить();
	Если ЗначениеЗаполнено(мДокументСсылка) Тогда
		Для Каждого СтрокаТЧ Из мДокументСсылка.Номенклатура Цикл
			НовСтрока = ЭтаФорма.ОсновныеСредства.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
			НовСтрока.ИнвентарныйНомерСтарый = СтрокаТЧ.ИнвентарныйНомер;
			НовСтрока.ЗаводскойНомерСтарый   = СтрокаТЧ.ЗаводскойНомер; 			
		КонецЦикла;
	КонецЕсли;

	Сообщить("Изменения успешно завершены!");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)

    ЗаписатьСервер();
	
КонецПроцедуры
