
&НаКлиенте
Процедура КнопкаОКНажатие(Команда)
	
	Если ЭтаФорма.НомерНедели1 = 0
			И ЭтаФорма.НомерНедели2 = 0
			И ЭтаФорма.НомерНедели3 = 0 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не выбран номер недели!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
	Если (((ЭтаФорма.НомерНедели1 > 0)
					ИЛИ (ЭтаФорма.НомерНедели2 > 0))
				И ЭтаФорма.НомерНедели1 = ЭтаФорма.НомерНедели2)
			ИЛИ (((ЭтаФорма.НомерНедели1 > 0)
					ИЛИ (ЭтаФорма.НомерНедели3 > 0))
				И ЭтаФорма.НомерНедели1 = ЭтаФорма.НомерНедели3)
			ИЛИ (((ЭтаФорма.НомерНедели2 > 0)
					ИЛИ (ЭтаФорма.НомерНедели3 > 0))
				И ЭтаФорма.НомерНедели2 = ЭтаФорма.НомерНедели3) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Номера недели повторяются!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерНедели1", ЭтаФорма.НомерНедели1);
	СтруктураПараметров.Вставить("НомерНедели2", ЭтаФорма.НомерНедели2);
	СтруктураПараметров.Вставить("НомерНедели3", ЭтаФорма.НомерНедели3);
	
	СтруктураПараметров.Вставить("ЗаполнятьНижниеУровниРаспределения", Ложь);//ЭтаФорма.ЗаполнятьНижниеУровниРаспределения);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ЗаполнятьНижниеУровниРаспределения = ЭтаФорма.Параметры.ЗаполнятьНижниеУровниРаспределения;
	
КонецПроцедуры
