
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекущееЗначение", ТекущееЗначение);
	
	УстановитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
		УстановитьПозициюТекущегоЗначенияКлиент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДинамическогоСписка

&НаКлиенте
Процедура ДоступнаяНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Новый Структура("Поставщик", Элемент.ТекущиеДанные.Ссылка));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеПоставщики(Команда)
	
	ОтобразитьВсехКонтрагентов();
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункцииИПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Параметры.ТекущийПользователь);
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ОтборПоПользователю", Параметры.ОтборПоПользователю);
	//ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ТипРолиТехнолог", Перечисления.ТипыРолейПользователейМОС.Технолог);
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ВсеКонтрагенты", Ложь);
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ВидНоменклатуры", Параметры.ВидНоменклатуры);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПозициюТекущегоЗначенияКлиент()
	
	//В тонком клиенте не отрабатывает метод "Найти строки", для получения актуального идентификатора  
	//строки Динамического списка.
	
	сч = 1; 
	Пока Истина Цикл
		
		Если сч = 1000 Тогда 
			Прервать;
		КонецЕсли;
		
		Попытка
			Если Элементы.ДоступныеПоставщики.ДанныеСтроки(сч).Ссылка = ТекущееЗначение Тогда;
				Элементы.ДоступныеПоставщики.ТекущаяСтрока = сч;
				Прервать;
			Иначе
				сч = сч + 1;
			КонецЕсли;
		Исключение
			Прервать;
		КонецПопытки;
		
    КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВсехКонтрагентов()
	
	ДоступныеПоставщики.Параметры.УстановитьЗначениеПараметра("ВсеКонтрагенты", Истина);

КонецПроцедуры

#КонецОбласти

