
&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	ОтборКоличество = Список.Отбор.Элементы.Количество();
	Для Н = 1 По ОтборКоличество Цикл
		Список.Отбор.Элементы.Удалить(ОтборКоличество - Н);
	КонецЦикла;
	
	Элементы.ФормаОчиститьОтборы.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("УстановитьДоступностьКнопкиОчиститьОтбор", 1);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопкиОчиститьОтбор()
	Элементы.ФормаОчиститьОтборы.Доступность = Список.Отбор.Элементы.Количество()<>0;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОтключитьОбработчикОжидания("УстановитьДоступностьКнопкиОчиститьОтбор");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ?(Не ЗначениеЗаполнено(Параметры.ТекущаяДата), ТекущаяДата(), Параметры.ТекущаяДата));
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоГруппы", Параметры.ТолькоГруппы);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование", ?(Параметры.ОтборДляТабеля, "Управление розницей.", ""));
	
КонецПроцедуры
