
Процедура ПриЗаписи(Отказ, Замещение)
	
	//ОбновитьСтатусыЗаказов();
	
	//ТЗЗаказов = ЭтотОбъект.Выгрузить();
	//ТЗЗаказов.Свернуть("Заказ");
	//Для каждого Ст из ТЗЗаказов Цикл
	//	
	////	Если ДополнительныеСвойства.Свойство("Обновление") Тогда
	//		
	//		Статусы = РегистрыСведений.CMS1C_ИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("Заказ",Ст.Заказ));
	//		Если Статусы.Статус<>Ст.Заказ.СтатусСайта Тогда
	//			Объект = Ст.Заказ.ПолучитьОбъект();				
	//			Объект.Записать();						
	//		КонецЕсли;
	//		
	////	КонецЕсли;
	//		
	//КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьСтатусыЗаказов()
	
			
	
КонецПроцедуры