
Функция ПолучитьТекущуюЛабораторию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоответствиеВебПользователейЛабораториям.Лаборатория
		|ИЗ
		|	РегистрСведений.СоответствиеВебПользователейЛабораториям КАК СоответствиеВебПользователейЛабораториям
		|ГДЕ
		|	СоответствиеВебПользователейЛабораториям.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	Возврат ВыборкаЗапроса.Лаборатория;	
	
КонецФункции
