
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	УстановитьПривилегированныйРежим(Истина);
	Служебный = Справочники.НазначенияИспользованияSIMКарт.СлужебныйТелефон;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Привязка)
			И ТипЗнч(Запись.Привязка) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
			И Запись.Назначение = Служебный
			И ЗначениеЗаполнено(Запись.Номер) Тогда
			Если Запись.Привязка.ТелефонныйНомер1 <> Прав(СокрЛП(Запись.Номер.Ссылка.Код), 10) Тогда 
				СпрОбъект = Запись.Привязка.ПолучитьОбъект();
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.ТелефонныйНомер1 = Прав(СокрЛП(Запись.Номер), 10);
				СпрОбъект.Записать();				
			КонецЕсли;	
			//+++AK BARA #15721
		ИначеЕсли
			ЗначениеЗаполнено(Запись.Привязка)
			И ТипЗнч(Запись.Привязка) <> Тип("СправочникСсылка.СтруктурныеЕдиницы")
			И Запись.Назначение = Служебный
			И ЗначениеЗаполнено(Запись.Номер)
			Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктурныеЕдиницы.Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.ТелефонныйНомер1 = &ТелефонныйНомер1";
			
			Запрос.УстановитьПараметр("ТелефонныйНомер1", Прав(СокрЛП(Запись.Номер), 10));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.ТелефонныйНомер1 = "";
				СпрОбъект.Записать();
			КонецЦикла;
			//---AK BARA #15721
		КонецЕсли;	
	КонецЦикла;	
	
	
	//+++АК BARA 2017.12.04
	Если Отказ = Ложь Тогда 
		тзЗаписей =  ЭтотОбъект.выгрузить(,"Номер,Привязка,Назначение"); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаТелефонов.Номер,
		|	ПривязкаТелефонов.Привязка,
		|	ПривязкаТелефонов.Назначение  КАК Назначение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&тзЗаписей КАК ПривязкаТелефонов
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Привязка,
		|	ВТ.Номер.Код КАК Номер,
		|	ВТ.Назначение
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
		|		ПО ВТ.Привязка = ОсновныеТелефоны.Привязка
		|			И ВТ.Назначение = ОсновныеТелефоны.Назначение
		|  Где ВТ.Назначение = Значение(Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон) 
		|	И (ЕСТЬNULL(ОсновныеТелефоны.Телефон, """") = """" ИЛИ  ОсновныеТелефоны.Телефон = ВТ.Номер  )
		|	И ТИПЗНАЧЕНИЯ(ВТ.Привязка) = ТИП(Справочник.ФизическиеЛица)
		|	И ВТ.Привязка.ЭтоГруппа = ЛОЖЬ
		|	И ВТ.Номер.ПометкаУдаления = ЛОЖЬ
		|	И ВТ.Номер.Заблокирован = ЛОЖЬ
		|	И ВТ.Номер.Используется
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	ВТ2.Привязка
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
		|		ПО (ПОДСТРОКА(КонтактнаяИнформация.Представление, 2, 10) = ПОДСТРОКА(ВТ2.Номер, 2, 10))
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный)
		|	И ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.ФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.Номер,
		|	ВТ2.Привязка
		|ИЗ
		|	ВТ2 КАК ВТ2
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ2.Привязка) = ТИП(Справочник.ФизическиеЛица)";
		
		Запрос.УстановитьПараметр("тзЗаписей", тзЗаписей);
		
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			мз = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			мз.Объект = Выборка.Объект;
			мз.Тип = Выборка.Тип;
			мз.Вид = Выборка.Вид;
			мз.Представление = Выборка.Представление;
			
			мз.Представление = "";
			Сообщить("Удалили служебный номер из физ лица:"+мз.Объект);
			мз.Удалить();
		
		КонецЦикла;
		
		Выборка = РезультатЗапроса[3].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			мз = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			мз.Объект = Выборка.Привязка;
			мз.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			мз.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСлужебный;
			мз.Представление = Выборка.Номер;		
			мз.Записать(Истина);
			Сообщить("Записали  служебный номер:"+мз.Представление+" в физ лицо:" +мз.Объект);
		КонецЦикла;
	КонецЕсли;
	//---АК BARA 2017.12.04	
	

КонецПроцедуры
