
Процедура ВывестиКартинкуПоТекущемуТовару(ТекИдентификатор)
	
	КартинкаТекТовара = Неопределено;
	Описание = "";
	Если ТекИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекИдентификатор) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;	
	
	СтрокаКартинки = Неопределено;
	Для Каждого СтрокаКарт Из ТекИдентификатор.Картинки Цикл
		Если СтрокаКарт.ЭтоОсновноеИзображение Тогда
			СтрокаКартинки = СтрокаКарт;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаКартинки = Неопределено
		И ТекИдентификатор.Картинки.Количество() > 0 Тогда
		СтрокаКартинки = ТекИдентификатор.Картинки[0];
	КонецЕсли;
	
	Если СтрокаКартинки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КаталогКЗаписи = Константы.КаталогХраненияФайловКартинок.Получить();
	Если Прав(КаталогКЗаписи, 1) <> "\" Тогда
		КаталогКЗаписи = КаталогКЗаписи + "\";
	КонецЕсли;	
	ИмяФайла = КаталогКЗаписи + Строка(ТекИдентификатор.УникальныйИдентификатор()) + "_" + Строка(СтрокаКартинки.КлючСтроки) + ?(Лев(СтрокаКартинки.Расширение, 1) = ".", "", ".") + СтрокаКартинки.Расширение;
	
	КартинкаТекТовара = ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла));
	
	Описание = "<html><body>" + ТекИдентификатор.Описание + "</body></html>";
	
	//ТекДанные = Элементы.Список.
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиПодписка()
	
	ВывестиКартинкуПоТекущемуТовару(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиПодписка", 0.3, Истина);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("РеклМатериалы", Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("id_TT", 11024));				
	Список.Параметры.УстановитьЗначениеПараметра("Заявка", Параметры.Заявка);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаГраница", ТекущаяДата() - 86400 * 14);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ВидРекламногоМатериала.Ширина = 33;
	
КонецПроцедуры
