
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для каждого Стр Из Состав Цикл
	
		НС = Движения.УдержанияСФизЛиц.Добавить();
		НС.Период 		= Дата;
		НС.ФизЛицо 		= Стр.Сотрудник;
		НС.Сумма 		= Стр.Сумма;
		НС.СуммаСНДФЛ 	= Стр.Сумма/0.87;
		НС.Комментарий 	= Стр.Комментарий;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//
	СуммаДокумента = Состав.Итог("Сумма");
	
	//
	Если Состав.Количество() Тогда
		Комментарий = Состав[0].Комментарий;
	КонецЕсли; 
	
КонецПроцедуры
