
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокМагазинов = МеханизмОбменаСообщениями.ПолучитьСписокПодразделений("Магазины");
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если Не ЗначениеЗаполнено(Отправка) Тогда
		Сообщить("Выберите шаблон отправки");
		Возврат;
	КонецЕсли; 
	Фл=Ложь;
	Для каждого Эл Из СписокМагазинов Цикл
		Если Эл.Пометка Тогда
			Фл=Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	Если Не Фл Тогда
		Сообщить("Необходимо отметить хотя бы один магазин");
		Возврат;
	КонецЕсли; 
	ОтправитьСервер();
	ВладелецФормы.ОбновитьТЗРезНаСервере("ФильтрВсеСообщения");
КонецПроцедуры

&НаСервере
Процедура ОтправитьСервер()
	ТЗОтправки=Новый ТаблицаЗначений;
	ТЗОтправки.Колонки.Добавить("ТорговаяТочка",Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТЗОтправки.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗОтправки.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗОтправки.Колонки.Добавить("Комментарий",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
	Для каждого Эл Из СписокМагазинов Цикл
		Если Эл.Пометка Тогда
			Для каждого Стр Из Объект.Товары Цикл
				СтрНов=ТЗОтправки.Добавить();
			    СтрНов.ТорговаяТочка=Эл.Значение;
				СтрНов.Номенклатура=Стр.Номенклатура;
				СтрНов.Характеристика=Стр.Характеристика;
				СтрНов.Комментарий=Стр.Комментарий;
			КонецЦикла; 
		КонецЕсли; 	
	КонецЦикла;
	АдресВХран=Справочники.ПравилаРаботыСотрудников.СформироватьДинамическуюЧастьПоПараметрам(Отправка,ТЗОтправки,ТекущаяДата(),Ложь,Истина);
	Если ЗначениеЗаполнено(АдресВХран) Тогда
		Справочники.ПравилаРаботыСотрудников.СформироватьСообщенияМагазинамОбИзмененииВерсииСДинамическойЧастью(Отправка,АдресВХран,Ложь);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтправки(Команда)
	Парам=Новый Структура("Правило",Отправка);
	ОткрытьФорму("Обработка.ПочтоваяРассылкаРеестраОтправок.Форма.Форма",Парам,,"ПочтоваяРассылкаРеестраОтправок");	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Фишка="";
	Элементы.Товары.ТекущиеДанные.Описание="";
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Фишка=ЗначРекв(Элементы.Товары.ТекущиеДанные.Номенклатура,"Фишка");
		Элементы.Товары.ТекущиеДанные.Описание=ЗначРекв(Элементы.Товары.ТекущиеДанные.Номенклатура,"Описание");
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначРекв(Ссылка,ИмяРекв)
	Возврат  СформироватьОписание(Ссылка[ИмяРекв]);
КонецФункции // ()

&НаСервереБезКонтекста
Функция СформироватьОписание(Описание)
	СтрокаИтог="";
	Фл=Ложь;
    Для Сч=1 По СтрДлина(Описание) Цикл
		Симв=Сред(Описание,Сч,1);
		Если Симв=">" или Симв="<" Тогда
		    Фл=Не Фл;
			Продолжить;
		КонецЕсли;
		Если Фл Тогда
			Продолжить;
		КонецЕсли; 
		//Если Найти("абвгдеёжзийклмнопрстуфхцчшщьыъэюяabcdefghijklmopqrstuvwxyz1234567890-_=+""?!.,()*%#:;№",Нрег(Симв))>0 Тогда
			СтрокаИтог=СтрокаИтог+Симв;
		//Иначе	
		//	СтрокаИтог=СтрокаИтог+" ";
		//КонецЕсли; 
	КонецЦикла;
	Возврат СтрокаИтог;
КонецФункции // ()
