
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Отказ = Ложь;
	ЗаполнитьТекстСообщения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОтправитьСообщениеНаСервере();
		ЗакрытиеПослеОтправки = Истина;
		ОповеститьОЗаписиНового(Неопределено);
		Закрыть();
	Исключение
		Предупреждение("Не удалось отправить сообщение");
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщения(Отказ)

	ТекДата = Обработки.СообщенияМОС.ПолучитьРабочуюДатуМОС();
	НовыйТекстСообщения = ПолучитьМодифицированныйТекстСообщения(ТекДата);
	Если СтрДлина(НовыйТекстСообщения) > 1000 Тогда
		Сообщить("Превышена максимальная длина текстового сообщения! Переадресация невозможна");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.ТекстСообщения = НовыйТекстСообщения;

КонецПроцедуры


&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	ДанныеДляMessage = Новый Структура;
	МассивДанныхДляMessages = Новый Массив;
	МассивДанныхДляRecipietns = Неопределено;
	
	ДанныеДляMessage.Вставить("TTL", СрокАктуальности);
	ДанныеДляMessage.Вставить("Role", ?(ЗначениеЗаполнено(РольПолучателя.Код), Число(РольПолучателя.Код), ""));
	ДанныеДляMessage.Вставить("Direction", 2);
	ДанныеДляMessage.Вставить("ShopNo", Магазин);
	ДанныеДляMessage.Вставить("ShopNo_rep", Магазин);
	ДанныеДляMessage.Вставить("MessageText", Объект.ТекстСообщения);
	ДанныеДляMessage.Вставить("MessageType", 2);
	ДанныеДляMessage.Вставить("Author", Число(Объект.КодСотрудника));
	ДанныеДляMessage.Вставить("AddDateTime", ТекДата);
	ДанныеДляMessage.Вставить("RoleSender", Объект.РольПользователя.Код);
	ДанныеДляMessage.Вставить("Subject", Объект.Тема);
	ДанныеДляMessage.Вставить("IDMes", ИДРод);
	ДанныеДляMessage.Вставить("TypeAddr", 3);
	ДанныеДляMessage.Вставить("Direction", 2);
	ДанныеДляMessage.Вставить("Status", 1);
	
	МассивДанныхДляMessages.Добавить(ОбщегоНазначения.СкопироватьУниверсальнуюКоллекцию(ДанныеДляMessage));
	
	ДанныеДляЗаписи = Новый Структура("Messages, Recipients", МассивДанныхДляMessages, МассивДанныхДляRecipietns);
	ИДСообщения = 0;
	Обработки.СообщенияМОС.ДобавитьЗаписиВТаблицыSQL(ДанныеДляЗаписи, ИДСообщения);
	
	СоединениеСБДSQL = МеханизмОбменаСообщениямиПовтИсп.ПолучитьСоединениеСБДSQL("SMS_REPL");
	ТекстКомандыSQL = "UPDATE SMS_REPL.dbo.info_exch_messages SET Status = 5 WHERE id = CAST('" + ИДПереадресации + "' AS uniqueidentifier)"; 
	СоединениеСБДSQL.Execute(ТекстКомандыSQL);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.РеквизитОбъект, Объект);
	
	СрокАктуальности = Обработки.СообщенияМОС.ПолучитьЗначениеTTL();
	СО1 = Новый Структура;
	СО1.Вставить("Идентификатор", Параметры.ИД);
	МСС = Объект.Сообщения.НайтиСтроки(СО1);
	Если МСС.Количество() = 0 Тогда
		Сообщить("Не найдена строка сообщения");
		Отказ = Истина;
		Возврат;
	Иначе
		ТекДанные = МСС[0];
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекДанные);
	ИДРод = Параметры.ИДРод;
	ИДПереадресации = ТекДанные.Идентификатор;
	
	Объект.РольПользователя = ТекДанные.РольПолучателя;
	Объект.Тема = ТекДанные.Тема;
	Объект.ТипСообщения = Перечисления.ТипыСообщенийМОС.Инцидент;
	ТекстИсходногоСообщения = Параметры.ТекстСообщения;
	Магазин = ТекДанные.КодПодразделения;
	
	Заголовок = Заголовок + Обработки.СообщенияМОС.ПолучитьДобавкуКЗаголовкуОкна();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗакрытиеПослеОтправки Тогда
		Ответ1 = Вопрос("При закрытии введённые данные будут утеряны! Вы действительно хотите закрыть данное окно?", РежимДиалогаВопрос.ДаНет);
		Если Ответ1 = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьМодифицированныйТекстСообщения(Дата1)
	
	НовыйТекст = "Переадресация: " + Строка(Дата1) + ", от " + Строка(Объект.РольПользователя) + " ("
			+ Строка(Объект.Пользователь) + ") к " + Строка(РольПолучателя) + ".";
	Если ЗначениеЗаполнено(Комментарий) Тогда
		НовыйТекст = НовыйТекст + Символы.ПС + "Комментарий: " + СокрЛП(Комментарий);
	КонецЕсли;
	НовыйТекст = НовыйТекст + Символы.ПС + СокрЛП(ТекстИсходногоСообщения);
	Возврат НовыйТекст;

КонецФункции // ()

