
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Регистратор = Параметры.Регистратор;
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Регистратор",Параметры.Регистратор);
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Регистратор");	
	ПользователскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
	ПользователскийПараметр.Использование = Истина;
	ПользователскийПараметр.Значение = Параметры.Регистратор;
	//СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Регистратор");	
	ПользователскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
	ПользователскийПараметр.Использование = Истина;
	ПользователскийПараметр.Значение = Регистратор;
	//СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Регистратор");	
	ПользователскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
	ПользователскийПараметр.Использование = Истина;
	ПользователскийПараметр.Значение = Регистратор;
	СкомпоноватьРезультат();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//Вставить содержимое обработчика
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	СкомпоноватьРезультатНаСервере()	
//	
//КонецПроцедуры

//Процедура СкомпоноватьРезультатНаСервере()
//	
//	СкомпоноватьРезультат(Элементы.Результат);
//	
//КонецПроцедуры