
//+++АК LATV 2018.07.14 ИП-00019272
&НаКлиенте
Процедура Загрузить(Команда)

	GUID = Нрег(GUID);
	ПозицияСсылки = Найти(GUID, "uuid=");
	Если ПозицияСсылки > 0 Тогда
		GUID = Сред(GUID, ПозицияСсылки + 5);
	КонецЕсли;
	
	GUID = СтрЗаменить(Нрег(GUID), "-","");
	
	GUID = Лев(GUID, 8) + "-" + Сред(GUID, 9, 4) + "-" + Сред(GUID, 13, 4) + "-" + Сред(GUID, 17, 4) + "-" + Прав(GUID, 12);
	
	ТекстОшибка = ""; 
	Результат = ОбменССистемойВетис.ЗагрузитьВСД( , , , GUID, СтруктурнаяЕдиница, Организация, Истина, ТекстОшибка);
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ не загружен.'"));
		Возврат;
	КонецЕсли;
	
	//++ХЖК 
	Если НЕ ПустаяСтрока(ТекстОшибка) Тогда 
		Если Вопрос(ТекстОшибка + Символы.ПС +  "Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			УдалитьЗапись(Результат);
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда	
		ОбменССистемойВетис.ОбновитьСоответствияКонтрагентовПоИНН();
		ОбменССистемойВетис.ОбновитьКонтрагентовВСД();
	КонецЕсли;	
	//--ХЖК 

	Закрыть(Результат);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗапись(УИД)
	МенджерЗаписи = РегистрыСведений.МЙ_ВетеринарныеДокументы.СоздатьМенеджерЗаписи();
	МенджерЗаписи.UUID = УИД;
	МенджерЗаписи.Прочитать();
	МенджерЗаписи.Удалить();
КонецПроцедуры 
