
&НаСервере
Функция ПолучитьМассивТТ()
	
	МассивВозврат = Новый Массив();
	МассивВозврат.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("id_tt", 30));
	МассивВозврат.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("id_tt", 8));
	
	Возврат МассивВозврат;
	
КонецФункции	

&НаКлиенте
Процедура СкладНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивТТ());
	
КонецПроцедуры
