
&НаКлиенте
Процедура Загрузить(Команда)
	
	МассивЗначений = Новый Массив;
	
	Для н = 1 По ТабКЗагрузке.ВысотаТаблицы Цикл
		ТекТекстЯчейки = СокрЛП(ТабКЗагрузке.Область(н, 1, н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекТекстЯчейки) Тогда Продолжить; КонецЕсли;
		МассивЗначений.Добавить(ТекТекстЯчейки);
	КонецЦикла;
	
	Если МассивЗначений.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Получатели не выбраны!");
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(МассивЗначений);
	
КонецПроцедуры
