
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

&НаСервере
Процедура УправлениеФормой()
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		Элементы.ГруппаФайл.ТекущаяСтраница = Элементы.ГруппаФайлДобавление;
	Иначе
		Элементы.ГруппаФайл.ТекущаяСтраница = Элементы.ГруппаФайлОткрытие;
	КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая()Тогда
		
		Если Параметры.Свойство("Номенклатура")Тогда
			
			Номенклатура = Параметры.Номенклатура;
			Если ЗначениеЗаполнено(Номенклатура)Тогда
				
				ВСоставе = Ложь;
				НоменклатураИлиРодительЕстьВСоставе(Номенклатура, ВСоставе);
				
				Если Не ВСоставе Тогда
					
					НС = Объект.Состав.Добавить();
					НС.Номенклатура = Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура ВыбратьФайлГостТУ(Команда)
	
	#Если Не ВебКлиент Тогда
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогФайла.МножественныйВыбор = Ложь;
		ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
		
		Если ДиалогФайла.Выбрать() Тогда
			
			Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогФайла.МножественныйВыбор = Ложь;
		ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
		
		Если ДиалогФайла.Выбрать() Тогда
			
			ПолноеИмяФайла   = ДиалогФайла.ПолноеИмяФайла;
			ИмяФайлаСРасширением = ПолучитьСтрокуОтделеннойСимволом(ПолноеИмяФайла, "\");
			Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(ПолноеИмяФайла);
			
			АдресВременногоХранилища = "";
			Если ПоместитьФайл(АдресВременногоХранилища, ПолноеИмяФайла,, Ложь)Тогда
				ЗаписатьФайлНаСервере(АдресВременногоХранилища, ИмяФайлаСРасширением, Расширение);
			Иначе 
				Сообщить("Не удалось добавить файл.");
			КонецЕсли;
			
		КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	
		Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Объект.ИмяФайлаСРасширением);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
		Если ПолучитьФайл(АдресФайла, ИмяВременногоФайла, Ложь) Тогда
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Вы действительно хотите удалить файл ГОСТ/ТУ?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// Т.к. файлы хранятся на сервере
	УдалитьФайлНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Процедура ВидСтандартаКачестваПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьСтрокуОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат "";
  	
КонецФункции

&НаСервере
Функция ПолучитьКаталогХраненияФайлов()

	Возврат Константы.КаталогХраненияФайлов.Получить();	

КонецФункции // ()

&НаСервере
Процедура УдалитьФайлНаСервере()
	
	Попытка
	
		УдалитьФайлы(Объект.ИмяФайла);
		
		Объект.ИмяФайла = "";
		Объект.ИмяФайлаСРасширением = "";
		
		Модифицированность = Истина;
	
	Исключение
		
	КонецПопытки;	
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаСРасширениемНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	
		Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Объект.ИмяФайлаСРасширением);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
		Если ПолучитьФайл(АдресФайла, ИмяВременногоФайла, Ложь) Тогда
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ОкончаниеВводаГостаТу");
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураИлиРодительЕстьВСоставе(Номенклатура, ВСоставе)
	
	НайденныеСтроки = Объект.Состав.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	Если НайденныеСтроки.Количество()=0 Тогда
		Если ЗначениеЗаполнено(Номенклатура.Родитель)Тогда
			НоменклатураИлиРодительЕстьВСоставе(Номенклатура.Родитель, ВСоставе);	
		КонецЕсли;
	Иначе
		ВСоставе = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлНаСервере(АдресВременногоХранилища, ИмяФайлаСРасширением, Расширение)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Попытка
		КаталогХраненияФайлов = ПолучитьКаталогХраненияФайлов();
		
		Если Прав(КаталогХраненияФайлов, 1) <> "\" Тогда
			КаталогХраненияФайлов = КаталогХраненияФайлов + "\";
		КонецЕсли;
		
	Исключение
		Сообщить("Не удалось получить каталог хранения файлов.");
		Возврат;
		
	КонецПопытки;
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;
	ИмяФайлаНаСервере = КаталогХраненияФайлов + УникальноеИмяФайла + "." + Расширение;
	
	Попытка
		
		ДвоичныеДанные.Записать(ИмяФайлаНаСервере);
		
		Объект.ИмяФайла = ИмяФайлаНаСервере;
		Объект.ИмяФайлаСРасширением = ИмяФайлаСРасширением;
		
		Модифицированность = Истина;
		
	Исключение
		Сообщить("Не удалось добавить файл.");
	КонецПопытки;
	
КонецПроцедуры





