
&НаСервереБезКонтекста
Функция ПолучитьЛабораториюДляПользователя()
	Возврат РегистрыСведений.СоответствиеВебПользователейЛабораториям.ПолучитьТекущуюЛабораторию();
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+++АК VERN 20161003 ИП-00013751.001.00000001
	//исключаем отбор по лаборатории для некоторых сотрудников
	Если НЕ ДополнительныеИнструментыCRM тогда
	//---АК VERN 20161003 ИП-00013751.001.00000001
	
		// Если пользователь зашел через веб-клиента, то наложим отбор только по его лаборатории
		#Если ВебКлиент ИЛИ ТонкийКлиент Тогда
		
		Если НЕ ЭтоПоставщик Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Лаборатория");
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование 	= Истина;
			ЭлементОтбора.ПравоеЗначение 	= ПолучитьЛабораториюДляПользователя();
			ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		
		#КонецЕсли
		
	//+++АК VERN 20161003 ИП-00013751.001.00000001
	//исключаем отбор по лаборатории для некоторых сотрудников
	КонецЕсли;
	//---АК VERN 20161003 ИП-00013751.001.00000001
	
	//+++АК KIRN 2018.02.28 ИП-00018031  
	ВключитьОтборСпискаНаКлиенте(флТолькоПоследние6Месяцев);
	//---АК KIRN 	
КонецПроцедуры

//+++АК VERN 20161003 ИП-00013751.001.00000001
//исключаем отбор по лаборатории для некоторых сотрудников
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеИнструментыCRM = РольДоступна("АК_ДополнительныеИнструментыCRM")
									ИЛИ РольДоступна("ПолныеПрава");
	
	//+++АК SHEP 20170803 ИП-00016394
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПоставщик = ПараметрыСеанса.ТекущийКонтрагент;
	ЭтоПоставщик = ЗначениеЗаполнено(ТекущийПоставщик);
	
	Если ЭтоПоставщик Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "Производитель", ТекущийПоставщик);
	КонецЕсли;
	//---АК SHEP 20170803
	
	//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПроверкаКачестваТоваров") ИЛИ РольДоступна("ПроверкаКачестваТоваровВебКлиент") Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Видимость = Истина;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Видимость  = Истина;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Видимость        = Истина;
	КонецЕсли;	
	//---АК LAGP
	
КонецПроцедуры
//---АК VERN 20161003 ИП-00013751.001.00000001


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено добавлять записи!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено удалять записи!");
	КонецЕсли;
КонецПроцедуры

//+++АК KIRN 2018.02.28 ИП-00018031       
&НаКлиенте
Процедура ОтобратьПоследние(Команда)
	флТолькоПоследние6Месяцев = Не флТолькоПоследние6Месяцев;
	ВключитьОтборСпискаНаКлиенте(флТолькоПоследние6Месяцев);
КонецПроцедуры
//---АК KIRN ИП-00018031      

//+++АК KIRN 2018.02.28 ИП-00018031  
&НаКлиенте 
ПРоцедура ВключитьОтборСпискаНаКлиенте(Вкл = ложь)
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьПоследние.Пометка = Вкл;
	ВключитьОтборСписка(Вкл);
КОнецПроцедуры
//---АК KIRN 


//+++АК KIRN 2018.02.28 ИП-00018031        
&НаСервере
Процедура ВключитьОтборСписка(Вкл = Ложь)
	//Если Не Вкл ТОгда
	//	Возврат;
	//КонецЕСли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаПрикрепления", ДобавитьМесяц(ТекущаяДата(),-6),ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Вкл);
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаПрикрепления");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.ПравоеЗначение = ДобавитьМесяц(ТекущаяДата(),-6);;
	//ЭлементОтбора.Использование = Истина;
КонецПРоцедуры
//---АК KIRN 

//+++АК KIRN 2018.02.28 ИП-00018031        
&НаСервере
Функция ПолучитьСтруктуруСвойствСтрокНаСервере(мСтроки)
	мСтруктурыСвойствСтрок = Новый Массив;
	ДЛя Каждого Стр из мСтроки Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИмяФайлаСРасширением", Стр.ИмяФайлаСРасширением);
		СтруктураДанных.Вставить("ИмяФайла",Стр.ИмяФайла);
		СтруктураДанных.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Стр.ИмяФайла), Новый УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Ссылка",Стр.Ссылка);
		мСтруктурыСвойствСтрок.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат мСтруктурыСвойствСтрок;
КонецФункции
//---АК KIRN 


//+++АК KIRN 2018.02.28 ИП-00018031        
&НаКлиенте
Процедура ПечататьФайлПротокола(Команда)
	
	ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	мсСтруктурСвойств = ПолучитьСтруктуруСвойствСтрокНаСервере(ВыбранныеСтроки);
	
	ДЛя Каждого Стр из мсСтруктурСвойств Цикл
		
		Об = Стр;
		Если ПустаяСтрока(Об.ИмяФайла)Тогда
			Возврат;
		КонецЕсли;
		
		#Если Не ВебКлиент Тогда
			
			Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Об.ИмяФайлаСРасширением);
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
			//АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
			//АдресФайла = ПоместитьФайлВоВременноеХранилище(Об);
			Если ПолучитьФайл(Стр.АдресФайла, ИмяВременногоФайла, Ложь) Тогда
				ЗапуститьПриложение(ИмяВременногоФайла);
			КонецЕсли;
			
		#Иначе
			
			Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
				УстановитьРасширениеРаботыСФайлами();
			КонецЕсли;
			
			Если ПодключитьРасширениеРаботыСФайлами() Тогда
				
				//ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(Об.ИмяФайла, ПоместитьФайлВоВременноеХранилище(Об));
				ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(Об.ИмяФайла, Стр.АдресФайла));
				ПолучаемыеФайлы = Новый Массив;
				ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
				
				ПолученныеФайлы = Новый Массив;
				
				ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
				ДВ.Заголовок = "Укажите каталог для скачивания...";
				
				Если ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы, ДВ, Истина) Тогда	
					
					ПолноеИмяФайлаНаКлиенте = ПолученныеФайлы[0].Имя;
					ДвоичныеДанные = ПолучитьИзвременногохранилища(ПолученныеФайлы[0].Хранение);
					
					ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
					
				КонецЕсли;
				
			Иначе
				ВызватьИсключение "Для данного браузера использование расширения для работы с файлами не поддерживается.";
				
			КонецЕсли;
			
		#КонецЕсли
	КонецЦикла;
КонецПроцедуры
//---АК KIRN

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьНеВкусвилл(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка Тогда
		ОтобратьВкусвиллБезФайлов(Истина);	
	КонецЕсли;
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка Тогда
		ОтобратьВкусвиллСФайлами(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.НеРавно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка);
	
КонецПроцедуры

&НаСервере
Функция КонтрагентПоКоду(Код)
	Возврат Справочники.Контрагенты.НайтиПоКоду(Код);
КонецФункции	

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьВкусвиллСФайлами(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка Тогда
		ОтобратьВкусвиллБезФайлов(Истина);	
	КонецЕсли;	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка Тогда
		ОтобратьНеВкусвилл(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.Равно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяФайла", "", ВидСравненияКомпоновкиДанных.Заполнено, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка);
	
КонецПроцедуры

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьВкусвиллБезФайлов(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка Тогда
		ОтобратьВкусвиллСФайлами(Истина);	
	КонецЕсли;
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка Тогда
		ОтобратьНеВкусвилл(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.Равно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяФайла", "", ВидСравненияКомпоновкиДанных.НеЗаполнено, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка);
	
КонецПроцедуры
 
	

