
&НаСервереБезКонтекста
Функция ПолучитьВладельца(мХарактеристика)
	
	Возврат мХарактеристика.Владелец;
	
КонецФункции


&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Запись.Комплект = ПолучитьВладельца(Запись.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляющаяПриИзменении(Элемент)
	
	Запись.ТоварКомплекта = ПолучитьВладельца(Запись.Составляющая);
	
КонецПроцедуры

//+++АК SaMi 2018.08.17 ИП-00018340.01
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Запись.Комплект, "ЭтоКомплект, ПроизводитсяВМагазине"); 
	
	Если НЕ ЗначенияРеквизитов.ЭтоКомплект И НЕ ЗначенияРеквизитов.ПроизводитсяВМагазине Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Для товара, указываемого в качестве комплекта должен быть установлен один из признаков ""Это комплект"" или ""Производится в магазине""!";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры
//---АК SaMi  2018.08.17 
