
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+++АК_Кибарев, 12.09.17, ИП-00016684
	//АК_УстновитьОтборВСписке(ЭтаФорма)
	//---АК_Кибарев, 12.09.17, ИП-00016684
	  
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаПечатиЭтикеток");
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаВВ(Команда)
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ПараметрыРасчетаФорматаВВ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоСтруктурнымЕдиницам(Команда)
	
	ОткрытьФорму("Отчет.ОтчетПоСтруктурнымЕдиницам.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияТорговыхТочек(Команда)
	
	ОткрытьФорму("Отчет.ДвиженияТорговыхТочек.Форма.ФормаОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОткрытию(Команда)
	
	ОткрытьФорму("Отчет.АК_ОтчетПоСтроительству.Форма");
	
КонецПроцедуры

//+++ AK suvv 2018.10.01 
&НаСервере
Функция ПолучитьСЕПоКоду(Код)
	
	Возврат Справочники.СтруктурныеЕдиницы.НайтиПоКоду(Код);
	
КонецФункции

//+++ AK suvv 2018.10.01 ИП-00019795
&НаКлиенте
Процедура ОткрытьФормуДопСвойств(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктурнаяЕдиница = ПолучитьСЕПоКоду(ТекСтрока.Код);
	
	Отбор           = Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ПараметрыОтбора = Новый структура("Отбор", Отбор);	
	
	ОткрытьФорму("РегистрСведений.ЗначенияСвойствСтруктурныхЕдиниц.Форма.ФормаСписка", ПараметрыОтбора);
		
КонецПроцедуры //--- AK suvv


