
Процедура ПриЗаписи(Отказ, Замещение)
	
	Договоры = Новый Массив;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Договоры.Найти(Запись.Договор) = Неопределено Тогда
			Договоры.Добавить(Запись.Договор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Договор Из Договоры Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(СтатусыДоговоровАрендыСрезПоследних.ДатаОкончанияАренды) КАК ДатаОкончанияАренды
		                      |ИЗ
		                      |	РегистрСведений.СтатусыДоговоровАренды.СрезПоследних(, Договор = &Договор) КАК СтатусыДоговоровАрендыСрезПоследних");
							  
		Запрос.УстановитьПараметр("Договор", Договор);
		
		ДатаОкончанияДоговора = Неопределено;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаОкончанияДоговора = Выборка.ДатаОкончанияАренды;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончанияДоговора) И ДатаОкончанияДоговора<>Договор.СрокДействия Тогда
			ДоговорОбъект = Договор.ПолучитьОбъект();
			ДоговорОбъект.СрокДействия = ДатаОкончанияДоговора;
			Попытка
				ДоговорОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
