
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.РазрешеныЛюбыеОперацииСЧекЛистом, Ложь) Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОтветственныеСтрокой = "";
	ТЧОтветственные = Объект.Ответственные;
	Для Каждого Стр из ТЧОтветственные Цикл
		ОтветственныеСтрокой = ОтветственныеСтрокой + Стр.Ответственный + ", ";
	КонецЦикла;
	
	ОтветственныеСтрокой = ?(ОтветственныеСтрокой <> "", Лев(ОтветственныеСтрокой, СтрДлина(ОтветственныеСтрокой) - 2), ОтветственныеСтрокой);
	Объект.ОтветственныеСтрокой = ОтветственныеСтрокой;
	
КонецПроцедуры
