
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	
	// Подключаемся к бухгалтерии
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе бухгалтерии");
		Возврат;
	КонецПопытки;
	
	// Запрос к бухгалтерии за данными по 76.05
	Запрос = v82.NewObject("Запрос");  
	
	// Берем дату из отчета
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="НаДату" Тогда
			Запрос.УстановитьПараметр("Дата", Параметр.Значение.Дата);
			ТекДата = Параметр.Значение.Дата;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	ТекстЗапроса = "ВЫБРАТЬ
	//+++АК sils 11.09.2018 ИП-00017858.04
	////+++АК sils 28.04.2018 ИП-00017858.04
	//|	ХозрасчетныйОстатки.Организация.ИНН КАК Организация_ИНН,
	//|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1.НаименованиеПолное КАК СТРОКА(200)) КАК Контрагент_НаименованиеПолное,
	////---АК
	//|	ХозрасчетныйОстатки.Субконто1.ИНН КАК Контрагент_ИНН,
	//|	ХозрасчетныйОстатки.Субконто1.Наименование КАК Контрагент_Наименование,
	//|	ХозрасчетныйОстатки.Субконто2.Наименование КАК Договор_Наименование,
	//|	ХозрасчетныйОстатки.Субконто2.Номер КАК Договор_Номер,
	//|	ХозрасчетныйОстатки.Субконто2.Дата КАК Договор_Дата,
	//|	ХозрасчетныйОстатки.Субконто2.Код КАК Договор_Код,
	//|	ХозрасчетныйОстатки.Субконто2.СрокДействия КАК Договор_СрокДействия,
	//|	ХозрасчетныйОстатки.СуммаОстаток
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	//---АК
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками), , ) КАК ХозрасчетныйОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Субконто1 КАК Субконто1,
	|			СУММА(ВложенныйЗапрос.Кол) КАК Кол
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|				ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	|				1 КАК Кол
	|			ИЗ
	|				РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками), , ) КАК ХозрасчетныйОстатки
	|			ГДЕ
	|				ХозрасчетныйОстатки.СуммаОстаток <> 0) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Субконто1) КАК ВложенныйЗапрос
	|		ПО ХозрасчетныйОстатки.Субконто1 = ВложенныйЗапрос.Субконто1
	|ГДЕ
	|	ВложенныйЗапрос.Кол > 0
	//+++АК sils 11.09.2018 ИП-00017858.04
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ХозрасчетныйОстатки.Субконто1.Наименование";
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Субконто1,
	|	ВложенныйЗапрос.Субконто2,
	|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Остатки.Организация КАК Организация,
	|		ВТ_Остатки.Субконто1 КАК Субконто1,
	|		ВТ_Остатки.Субконто2 КАК Субконто2,
	|		ВТ_Остатки.СуммаОстаток КАК СуммаОстаток
	|	ИЗ
	|		ВТ_Остатки КАК ВТ_Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорыКонтрагентов.Организация,
	|		ДоговорыКонтрагентов.Владелец,
	|		ДоговорыКонтрагентов.Ссылка,
	|		0
	|	ИЗ
	|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|	ГДЕ
	|		ДоговорыКонтрагентов.Владелец В
	|				(ВЫБРАТЬ
	|					ВТ_Остатки.Субконто1
	|				ИЗ
	|					ВТ_Остатки)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Субконто1,
	|	ВложенныйЗапрос.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Организация.ИНН КАК Организация_ИНН,
	|	ВТ_Данные.Субконто1 КАК Контрагент,
	|	ВЫРАЗИТЬ(ВТ_Данные.Субконто1.НаименованиеПолное КАК СТРОКА(200)) КАК Контрагент_НаименованиеПолное,
	|	ВТ_Данные.Субконто1.ИНН КАК Контрагент_ИНН,
	|	ВТ_Данные.Субконто1.Наименование КАК Контрагент_Наименование,
	|	ВТ_Данные.Субконто2.Наименование КАК Договор_Наименование,
	|	ВТ_Данные.Субконто2.Номер КАК Договор_Номер,
	|	ВТ_Данные.Субконто2.Дата КАК Договор_Дата,
	|	ВТ_Данные.Субконто2.Код КАК Договор_Код,
	|	ВТ_Данные.Субконто2.СрокДействия КАК Договор_СрокДействия,
	//+++ AK suvv 2018.09.24 ИП-00019877 
	//|	ВТ_Данные.СуммаОстаток
	|	Сумма(ВТ_Данные.СуммаОстаток) КАК СуммаОстаток
	//--- AK suvv
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	//+++ AK suvv 2018.09.24 ИП-00019877
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Организация.ИНН,
	|	ВТ_Данные.Субконто1,
	|	ВТ_Данные.Субконто2.Наименование,
	|	ВТ_Данные.Субконто2.Номер,
	|	ВТ_Данные.Субконто2.Дата,
	|	ВТ_Данные.Субконто2.СрокДействия,
	|	ВЫРАЗИТЬ(ВТ_Данные.Субконто1.НаименованиеПолное КАК СТРОКА(200)),
	|	ВТ_Данные.Субконто1.ИНН,
	|	ВТ_Данные.Субконто1.Наименование,
	|	ВТ_Данные.Субконто2.Код	
	//--- AK suvv
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Данные.Субконто1.Наименование";
	//---АК
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируем табличку и заполняем с запроса
	ТЗ_Бух = Новый ТаблицаЗначений;
	//+++АК sils 28.04.2018 ИП-00017858.04
	ТЗ_Бух.Колонки.Добавить("Организация_ИНН", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));	
	ТЗ_Бух.Колонки.Добавить("Контрагент_УИД", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));	
	ТЗ_Бух.Колонки.Добавить("Контрагент_НаименованиеПолное", Новый ОписаниеТипов("Строка"), Новый КвалификаторыСтроки(200));	
	//---АК
	ТЗ_Бух.Колонки.Добавить("Контрагент_ИНН", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));	
	ТЗ_Бух.Колонки.Добавить("Контрагент_Наименование", Новый ОписаниеТипов("Строка"), Новый КвалификаторыСтроки(100));	
	ТЗ_Бух.Колонки.Добавить("Договор_Наименование", Новый ОписаниеТипов("Строка"));	
	ТЗ_Бух.Колонки.Добавить("Договор_Код", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(9)));	
	ТЗ_Бух.Колонки.Добавить("Договор_Номер", Новый ОписаниеТипов("Строка"));	
	ТЗ_Бух.Колонки.Добавить("Договор_Дата", Новый ОписаниеТипов("Дата"));	
	ТЗ_Бух.Колонки.Добавить("Договор_СрокДействия", Новый ОписаниеТипов("Дата"));	
	ТЗ_Бух.Колонки.Добавить("СуммаОстаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));	
	
	Пока Выборка.Следующий() Цикл
		НовСтр = ТЗ_Бух.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		НовСтр.СуммаОстаток = Число(СтрЗаменить(Выборка.СуммаОстаток, Символы.НПП, ""));
		//+++АК sils 03.07.2018 ИП-00017858.04
		НовСтр.Контрагент_УИД = v82.XMLСтрока(Выборка.Контрагент.УникальныйИдентификатор());
		//---АК
	КонецЦикла;
	
	// Теперь запрос местный к финансам.
	// Надо найти контрагента
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_Бух", ТЗ_Бух);
	Запрос.Текст = "ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04	
	               |	ТЗ_Бух.Организация_ИНН,
				   //---АК
	               |	ТЗ_Бух.Контрагент_ИНН,
	               |	ТЗ_Бух.Контрагент_Наименование,
	               |	ТЗ_Бух.Договор_Наименование,
	               |	ТЗ_Бух.Договор_Код,
	               |	ТЗ_Бух.Договор_Номер,
	               |	ТЗ_Бух.Договор_Дата,
	               |	ТЗ_Бух.Договор_СрокДействия,
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|	ТЗ_Бух.СуммаОстаток,
				   //|	ТЗ_Бух.Контрагент_ИНН КАК Контрагент_ИНН1
	               |	ТЗ_Бух.Контрагент_УИД,
	               |	ТЗ_Бух.Контрагент_НаименованиеПолное,
	               |	ТЗ_Бух.СуммаОстаток
				   //---АК
	               |ПОМЕСТИТЬ Бух
	               |ИЗ
	               |	&ТЗ_Бух КАК ТЗ_Бух
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|		КОГДА ВложенныйЗапрос.Ссылка ЕСТЬ NULL
				   //|			ТОГДА НЕОПРЕДЕЛЕНО
				   //|		ИНАЧЕ ВложенныйЗапрос.Ссылка
				   //|	КОНЕЦ КАК Контрагент,
	               |		КОГДА Контрагенты.Ссылка ЕСТЬ NULL
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ Контрагенты.Ссылка
	               |	КОНЕЦ КАК Контрагент,
	               |	Организации.Ссылка КАК Организация,
	               |	Бух.Контрагент_УИД,
	               |	Бух.Контрагент_НаименованиеПолное,
	               |	Контр_НаимПолное.Ссылка КАК Контр_НаимПолное,
				   //---АК
	               |	Бух.Договор_Наименование,
	               |	Бух.Договор_Код,
	               |	Бух.Договор_Номер,
	               |	Бух.Договор_Дата,
	               |	Бух.Договор_СрокДействия,
	               |	Бух.СуммаОстаток,
	               |	Бух.Контрагент_ИНН,
	               |	Бух.Контрагент_Наименование
	               |ИЗ
	               |	Бух КАК Бух
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Контрагенты.Ссылка КАК Ссылка,
	               |			Контрагенты.ИНН КАК ИНН
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				Контрагенты.ИНН КАК ИНН,
	               |				МАКСИМУМ(Контрагенты.Код) КАК Код
	               |			ИЗ
	               |				Справочник.Контрагенты КАК Контрагенты
	               |			ГДЕ
	               |				Контрагенты.ИНН <> ""000000000000""
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Контрагенты.ИНН) КАК ВложенныйЗапрос
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |				ПО ВложенныйЗапрос.ИНН = Контрагенты.ИНН
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|					И ВложенныйЗапрос.Код = Контрагенты.Код) КАК ВложенныйЗапрос
				   //|		ПО Бух.Контрагент_ИНН = ВложенныйЗапрос.ИНН";
	               |					И ВложенныйЗапрос.Код = Контрагенты.Код) КАК Контрагенты
	               |		ПО Бух.Контрагент_ИНН = Контрагенты.ИНН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Организации.Ссылка КАК Ссылка,
	               |			Организации.ИНН КАК ИНН
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				Организации.ИНН КАК ИНН,
	               |				МАКСИМУМ(Организации.Код) КАК Код
	               |			ИЗ
	               |				Справочник.Организации КАК Организации
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Организации.ИНН) КАК ВложенныйЗапрос
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |				ПО ВложенныйЗапрос.ИНН = Организации.ИНН
	               |					И ВложенныйЗапрос.Код = Организации.Код) КАК Организации
	               |		ПО Бух.Организация_ИНН = Организации.ИНН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200)) КАК НаименованиеПолное,
	               |			Контрагенты.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Справочник.Контрагенты КАК Контрагенты
	               |		ГДЕ
	               |			НЕ Контрагенты.ПометкаУдаления) КАК Контр_НаимПолное
	               |		ПО ВЫРАЗИТЬ(Бух.Контрагент_НаименованиеПолное КАК СТРОКА(200)) = ВЫРАЗИТЬ(Контр_НаимПолное.НаименованиеПолное КАК СТРОКА(200))";
				   //---АК
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТекСтр = ТЗ.Количество();
	Пока ТекСтр <> 0 Цикл
		стр = ТЗ[ТекСтр - 1];
		Если не ЗначениеЗаполнено(стр.Контрагент) Тогда
			//+++АК sils 03.07.2018 ИП-00017858.04
			//Сообщить("Контрагент " + СокрЛП(стр.Контрагент_Наименование) + "(ИНН " + стр.Контрагент_ИНН + ")");
			Если СокрЛП(стр.Контрагент_УИД) <> "" Тогда
				//Сообщить("	Поиск по УИД " + стр.Контрагент_УИД);
				КонтрСсылка = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(стр.Контрагент_УИД));
				КонтрОбъект = КонтрСсылка.ПолучитьОбъект();
				Если КонтрОбъект <> Неопределено Тогда
					стр.Контрагент = КонтрОбъект.Ссылка;
					//Сообщить("		" + стр.Контрагент);
				КонецЕсли;
			КонецЕсли;
			Если не ЗначениеЗаполнено(стр.Контрагент) Тогда
				//Сообщить("	Поиск по полн.наим. " + стр.Контрагент_НаименованиеПолное);
				Если ЗначениеЗаполнено(стр.Контр_НаимПолное) Тогда
					стр.Контрагент = стр.Контр_НаимПолное.Ссылка;
					//Сообщить("		" + стр.Контрагент);
				КонецЕсли;;
			КонецЕсли;
			Если не ЗначениеЗаполнено(стр.Контрагент) Тогда
			//---АК
			Сообщить("Не найден контрагент " + СокрЛП(стр.Контрагент_Наименование) + "(ИНН " + стр.Контрагент_ИНН + ") сумма бух.: " + стр.СуммаОстаток);
			ТЗ.Удалить(стр);
			//+++АК sils 03.07.2018 ИП-00017858.04
			КонецЕсли;
			//---АК
		ИначеЕсли СокрЛП(стр.Договор_Наименование) = "" и СокрЛП(стр.Договор_Код) = "" Тогда
			Сообщить("Не задан договор у контрагента " + СокрЛП(стр.Контрагент_Наименование) + "(ИНН " + стр.Контрагент_ИНН + ") сумма бух.: " + стр.СуммаОстаток);
			ТЗ.Удалить(стр);
		КонецЕсли;
		ТекСтр = ТекСтр - 1;
	КонецЦикла;
	
	// Теперь запрос местный к финансам.
	// Надо найти контрагента, договор, торговую точку, сумму по 60.1. Короче кучу всего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Дата", ТекДата);
	//+++АК sils 28.04.2018 ИП-00017858.04
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	//---АК
	Запрос.Текст = "ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ТЗ_Бух.Организация,
				   //---АК
	               |	ТЗ_Бух.Контрагент,
	               |	ТЗ_Бух.Договор_Наименование,
	               |	ТЗ_Бух.Договор_Код,
	               |	ТЗ_Бух.Договор_Номер,
	               |	ТЗ_Бух.Договор_Дата,
	               |	ТЗ_Бух.Договор_СрокДействия,
	               |	ТЗ_Бух.СуммаОстаток
	               |ПОМЕСТИТЬ Бух
	               |ИЗ
	               |	&ТЗ КАК ТЗ_Бух
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ФинансовыйОстатки.Организация,
				   //---АК
	               |	ФинансовыйОстатки.Субконто2 КАК Контрагент,
	               |	ФинансовыйОстатки.Субконто3 КАК ТорговаяТочка,
	               |	ФинансовыйОстатки.СуммаОстаток
	               |ПОМЕСТИТЬ Фин
	               |ИЗ
	               |	РегистрБухгалтерии.Финансовый.Остатки(&Дата, Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОбеспечительныйВзнос), , ) КАК ФинансовыйОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасторжениеДоговораАренды.ДокументОснование,
	               |	РасторжениеДоговораАренды.Ссылка,
	               |	РасторжениеДоговораАренды.ДатаОкончанияДоговора
	               |ПОМЕСТИТЬ РасторжениеДоговора
	               |ИЗ
	               |	Документ.РасторжениеДоговораАренды КАК РасторжениеДоговораАренды
	               |ГДЕ
	               |	РасторжениеДоговораАренды.Проведен
				   //+++АК sils 18.09.2018 ИП-00017858.04
				   //|	И РасторжениеДоговораАренды.Дата <= &Дата
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительноеСоглашение.Ссылка,
	               |	ДополнительноеСоглашение.ДокументОснование,
	               |	ДополнительноеСоглашение.ДатаОкончанияДоговора
	               |ПОМЕСТИТЬ ДопСогл_ДатаОкончания
	               |ИЗ
	               |	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДополнительноеСоглашение.Дата КАК Дата,
	               |			ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	               |			МАКСИМУМ(ДополнительноеСоглашение.Номер) КАК Номер
	               |		ИЗ
	               |			Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ДополнительноеСоглашение.Дата КАК Дата,
	               |					ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |					МАКСИМУМ(ДополнительноеСоглашение.ДатаОкончанияДоговора) КАК ДатаОкончанияДоговора
	               |				ИЗ
	               |					Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							МАКСИМУМ(ДополнительноеСоглашение.Дата) КАК Дата,
	               |							ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование
	               |						ИЗ
	               |							Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ГДЕ
	               |							ДополнительноеСоглашение.Проведен
	               |							И НЕ ДополнительноеСоглашение.УчитыватьЗалог
				   //+++АК sils 31.10.2018 ИП-00017858.04
				   //|							И ДополнительноеСоглашение.Дата <= &Дата
				   //---АК
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							ДополнительноеСоглашение.ДокументОснование) КАК ВложенныйЗапрос
	               |						ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |							И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |				ГДЕ
	               |					ДополнительноеСоглашение.Проведен
	               |					И НЕ ДополнительноеСоглашение.УчитыватьЗалог
				   //+++АК sils 31.10.2018 ИП-00017858.04
				   //|					И ДополнительноеСоглашение.Дата <= &Дата
				   //---АК
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ДополнительноеСоглашение.ДокументОснование,
	               |					ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |				ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |					И ДополнительноеСоглашение.ДатаОкончанияДоговора = ВложенныйЗапрос.ДатаОкончанияДоговора
	               |					И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |		ГДЕ
	               |			ДополнительноеСоглашение.Проведен
	               |			И НЕ ДополнительноеСоглашение.УчитыватьЗалог
				   //+++АК sils 31.10.2018 ИП-00017858.04
				   //|			И ДополнительноеСоглашение.Дата <= &Дата
				   //---АК
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ДополнительноеСоглашение.ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора,
	               |			ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |		ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |			И ДополнительноеСоглашение.Номер = ВложенныйЗапрос.Номер
	               |ГДЕ
	               |	ДополнительноеСоглашение.Проведен
	               |	И НЕ ДополнительноеСоглашение.УчитыватьЗалог
				   //+++АК sils 31.10.2018 ИП-00017858.04
				   //|	И ДополнительноеСоглашение.Дата <= &Дата
				   //---АК
				   //+++АК sils 31.10.2018 ИП-00017858.04
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительноеСоглашение.Ссылка,
	               |	ДополнительноеСоглашение.ДокументОснование,
	               |	ДополнительноеСоглашение.ДатаОкончанияДоговора
	               |ПОМЕСТИТЬ ДопСогл_ДатаОкончанияЗалог
	               |ИЗ
	               |	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДополнительноеСоглашение.Дата КАК Дата,
	               |			ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	               |			МАКСИМУМ(ДополнительноеСоглашение.Номер) КАК Номер
	               |		ИЗ
	               |			Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ДополнительноеСоглашение.Дата КАК Дата,
	               |					ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |					МАКСИМУМ(ДополнительноеСоглашение.ДатаОкончанияДоговора) КАК ДатаОкончанияДоговора
	               |				ИЗ
	               |					Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							МАКСИМУМ(ДополнительноеСоглашение.Дата) КАК Дата,
	               |							ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование
	               |						ИЗ
	               |							Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ГДЕ
	               |							ДополнительноеСоглашение.Проведен
	               |							И ДополнительноеСоглашение.УчитыватьЗалог
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							ДополнительноеСоглашение.ДокументОснование) КАК ВложенныйЗапрос
	               |						ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |							И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |				ГДЕ
	               |					ДополнительноеСоглашение.Проведен
	               |					И ДополнительноеСоглашение.УчитыватьЗалог
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ДополнительноеСоглашение.ДокументОснование,
	               |					ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |				ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |					И ДополнительноеСоглашение.ДатаОкончанияДоговора = ВложенныйЗапрос.ДатаОкончанияДоговора
	               |					И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |		ГДЕ
	               |			ДополнительноеСоглашение.Проведен
	               |			И ДополнительноеСоглашение.УчитыватьЗалог
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ДополнительноеСоглашение.ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора,
	               |			ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |		ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |			И ДополнительноеСоглашение.Номер = ВложенныйЗапрос.Номер
	               |ГДЕ
	               |	ДополнительноеСоглашение.Проведен
	               |И ДополнительноеСоглашение.УчитыватьЗалог
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительноеСоглашение.Ссылка,
	               |	ДополнительноеСоглашение.ДокументОснование,
	               |	ДополнительноеСоглашение.ДатаОкончанияДоговора,
	               |	ДополнительноеСоглашение.СуммаЗалогаБезналичные
	               |ПОМЕСТИТЬ ДопСогл_Депозит
	               |ИЗ
	               |	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДополнительноеСоглашение.Дата КАК Дата,
	               |			ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	               |			МАКСИМУМ(ДополнительноеСоглашение.Номер) КАК Номер
	               |		ИЗ
	               |			Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ДополнительноеСоглашение.Дата КАК Дата,
	               |					ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование,
	               |					МАКСИМУМ(ДополнительноеСоглашение.ДатаОкончанияДоговора) КАК ДатаОкончанияДоговора
	               |				ИЗ
	               |					Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							МАКСИМУМ(ДополнительноеСоглашение.Дата) КАК Дата,
	               |							ДополнительноеСоглашение.ДокументОснование КАК ДокументОснование
	               |						ИЗ
	               |							Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	               |						ГДЕ
	               |							ДополнительноеСоглашение.Проведен
	               |							И ДополнительноеСоглашение.УчитыватьЗалог
	               |							И ДополнительноеСоглашение.Дата <= &Дата
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							ДополнительноеСоглашение.ДокументОснование) КАК ВложенныйЗапрос
	               |						ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |							И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |				ГДЕ
	               |					ДополнительноеСоглашение.Проведен
	               |					И ДополнительноеСоглашение.УчитыватьЗалог
	               |					И ДополнительноеСоглашение.Дата <= &Дата
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ДополнительноеСоглашение.ДокументОснование,
	               |					ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |				ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |					И ДополнительноеСоглашение.ДатаОкончанияДоговора = ВложенныйЗапрос.ДатаОкончанияДоговора
	               |					И ДополнительноеСоглашение.ДокументОснование = ВложенныйЗапрос.ДокументОснование
	               |		ГДЕ
	               |			ДополнительноеСоглашение.Проведен
	               |			И ДополнительноеСоглашение.УчитыватьЗалог
	               |			И ДополнительноеСоглашение.Дата <= &Дата
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ДополнительноеСоглашение.ДокументОснование,
	               |			ДополнительноеСоглашение.ДатаОкончанияДоговора,
	               |			ДополнительноеСоглашение.Дата) КАК ВложенныйЗапрос
	               |		ПО ДополнительноеСоглашение.Дата = ВложенныйЗапрос.Дата
	               |			И ДополнительноеСоглашение.Номер = ВложенныйЗапрос.Номер
	               |ГДЕ
	               |	ДополнительноеСоглашение.Проведен
	               |	И ДополнительноеСоглашение.УчитыватьЗалог
	               |	И ДополнительноеСоглашение.Дата <= &Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ВложенныйЗапрос.Организация,
				   //---АК
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ОбъектАрендыСтруктурнаяЕдиница КАК ТТ,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.ДатаЗаключенияДоговора КАК ДатаЗаключения,
	               |	ВЫБОР
	               |		КОГДА НЕ ВложенныйЗапрос.ДатаРасторжения ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВложенныйЗапрос.ДатаОкончания > ВложенныйЗапрос.ДатаРасторжения
	               |						ТОГДА ВложенныйЗапрос.ДатаРасторжения
	               |					ИНАЧЕ ВложенныйЗапрос.ДатаОкончания
	               |				КОНЕЦ
	               |		ИНАЧЕ ВложенныйЗапрос.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВложенныйЗапрос.Ссылка КАК ЗаключениеДоговора
	               |ПОМЕСТИТЬ ЗаклДог_ДатаОконч
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаключениеДоговораАренды.Ссылка КАК Ссылка,
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |		ЗаключениеДоговораАренды.Организация КАК Организация,
				   //---АК
	               |		ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	               |		ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ЗаключениеДоговораАренды.ОбъектАренды.СтруктурнаяЕдиница КАК ОбъектАрендыСтруктурнаяЕдиница,
	               |		ЗаключениеДоговораАренды.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора,
				   //+++АК sils 31.10.2018 ИП-00017858.04
				   //|		ВЫБОР
				   //|			КОГДА НЕ ДопСогл_ДатаОкончания.ДатаОкончанияДоговора ЕСТЬ NULL
				   //|					И НЕ ДопСогл_Депозит.ДатаОкончанияДоговора ЕСТЬ NULL
				   //|				ТОГДА ВЫБОР
				   //|						КОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора > ДопСогл_Депозит.ДатаОкончанияДоговора
				   //|							ТОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора
				   //|						ИНАЧЕ ДопСогл_Депозит.ДатаОкончанияДоговора
				   //|					КОНЕЦ
				   //|			КОГДА НЕ ДопСогл_ДатаОкончания.ДатаОкончанияДоговора ЕСТЬ NULL
				   //|				ТОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора
				   //|			КОГДА НЕ ДопСогл_Депозит.ДатаОкончанияДоговора ЕСТЬ NULL
				   //|				ТОГДА ДопСогл_Депозит.ДатаОкончанияДоговора
	               |		ВЫБОР
	               |			КОГДА НЕ ДопСогл_ДатаОкончания.ДатаОкончанияДоговора ЕСТЬ NULL
	               |					И НЕ ДопСогл_ДатаОкончанияЗалог.ДатаОкончанияДоговора ЕСТЬ NULL
	               |				ТОГДА ВЫБОР
	               |						КОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора > ДопСогл_ДатаОкончанияЗалог.ДатаОкончанияДоговора
	               |							ТОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора
	               |						ИНАЧЕ ДопСогл_ДатаОкончанияЗалог.ДатаОкончанияДоговора
	               |					КОНЕЦ
	               |			КОГДА НЕ ДопСогл_ДатаОкончания.ДатаОкончанияДоговора ЕСТЬ NULL
	               |				ТОГДА ДопСогл_ДатаОкончания.ДатаОкончанияДоговора
	               |			КОГДА НЕ ДопСогл_ДатаОкончанияЗалог.ДатаОкончанияДоговора ЕСТЬ NULL
	               |				ТОГДА ДопСогл_ДатаОкончанияЗалог.ДатаОкончанияДоговора
				   //---АК
	               |			ИНАЧЕ ЗаключениеДоговораАренды.ДатаОкончанияДоговора
	               |		КОНЕЦ КАК ДатаОкончания,
	               |		ВЫБОР
	               |			КОГДА ДопСогл_Депозит.СуммаЗалогаБезналичные ЕСТЬ NULL
	               |				ТОГДА ЗаключениеДоговораАренды.СуммаЗалогаБезналичные
	               |			ИНАЧЕ ДопСогл_Депозит.СуммаЗалогаБезналичные
	               |		КОНЕЦ КАК Сумма,
	               |		РасторжениеДоговора.ДатаОкончанияДоговора КАК ДатаРасторжения
	               |	ИЗ
	               |		Документ.ЗаключениеДоговораАренды КАК ЗаключениеДоговораАренды
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РасторжениеДоговора КАК РасторжениеДоговора
	               |			ПО ЗаключениеДоговораАренды.Ссылка = РасторжениеДоговора.ДокументОснование
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДопСогл_ДатаОкончания КАК ДопСогл_ДатаОкончания
	               |			ПО ЗаключениеДоговораАренды.Ссылка = ДопСогл_ДатаОкончания.ДокументОснование
				   //+++АК sils 31.10.2018 ИП-00017858.04
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДопСогл_ДатаОкончанияЗалог КАК ДопСогл_ДатаОкончанияЗалог
	               |			ПО ЗаключениеДоговораАренды.Ссылка = ДопСогл_ДатаОкончанияЗалог.ДокументОснование
				   //---АК
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДопСогл_Депозит КАК ДопСогл_Депозит
	               |			ПО ЗаключениеДоговораАренды.Ссылка = ДопСогл_Депозит.ДокументОснование
	               |	ГДЕ
	               |		ЗаключениеДоговораАренды.Проведен
	               |		И ЗаключениеДоговораАренды.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.Аренда)
	               |		И ЗаключениеДоговораАренды.УчитыватьЗалог
	               |		И ЗаключениеДоговораАренды.Дата <= &Дата) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ЗаклДог_ДатаОконч.Организация,
				   //---АК
	               |	ЗаклДог_ДатаОконч.Контрагент КАК Контрагент,
	               |	ЗаклДог_ДатаОконч.ТТ КАК ТТ,
	               |	ЗаклДог_ДатаОконч.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ЗаклДог_ДатаОконч.Сумма КАК Сумма,
	               |	ЗаклДог_ДатаОконч.ДатаЗаключения КАК ДатаЗаключения,
	               |	ЗаклДог_ДатаОконч.ДатаОкончания КАК ДатаОкончания,
	               |	ЗаклДог_ДатаОконч.ЗаключениеДоговора КАК ЗаключениеДоговора
	               |ПОМЕСТИТЬ ЗаклДог_Просроченные
	               |ИЗ
	               |	ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			ЗаклДог_ДатаОконч.Организация КАК Организация,
				   //---АК
	               |			ЗаклДог_ДатаОконч.Контрагент КАК Контрагент,
	               |			ЗаклДог_ДатаОконч.ТТ КАК ТТ,
	               |			МАКСИМУМ(ЗаклДог_ДатаОконч.ДоговорКонтрагента.Код) КАК ДоговорКонтрагентаКод
	               |		ИЗ
	               |			ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |					ЗаклДог_ДатаОконч.Организация КАК Организация,
				   //---АК
	               |					ЗаклДог_ДатаОконч.Контрагент КАК Контрагент,
	               |					ЗаклДог_ДатаОконч.ТТ КАК ТТ,
	               |					МАКСИМУМ(ЗаклДог_ДатаОконч.ДоговорКонтрагента.Дата) КАК ДоговорКонтрагентаДата
	               |				ИЗ
	               |					ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |				ГДЕ
	               |					ЗаклДог_ДатаОконч.ДатаОкончания < &Дата
	               |				
	               |				СГРУППИРОВАТЬ ПО
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |					ЗаклДог_ДатаОконч.Организация,
				   //---АК
	               |					ЗаклДог_ДатаОконч.Контрагент,
	               |					ЗаклДог_ДатаОконч.ТТ) КАК ВложенныйЗапрос
	               |				ПО ЗаклДог_ДатаОконч.Контрагент = ВложенныйЗапрос.Контрагент
	               |					И ЗаклДог_ДатаОконч.ТТ = ВложенныйЗапрос.ТТ
	               |					И ЗаклДог_ДатаОконч.ДоговорКонтрагента.Дата = ВложенныйЗапрос.ДоговорКонтрагентаДата
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |					И ЗаклДог_ДатаОконч.Организация = ВложенныйЗапрос.Организация
				   //---АК
	               |		
	               |		СГРУППИРОВАТЬ ПО
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			ЗаклДог_ДатаОконч.Организация,
				   //---АК
	               |			ЗаклДог_ДатаОконч.Контрагент,
	               |			ЗаклДог_ДатаОконч.ТТ) КАК ВложенныйЗапрос
	               |		ПО ЗаклДог_ДатаОконч.Контрагент = ВложенныйЗапрос.Контрагент
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			И ЗаклДог_ДатаОконч.Организация = ВложенныйЗапрос.Организация
				   //---АК
	               |			И ЗаклДог_ДатаОконч.ТТ = ВложенныйЗапрос.ТТ
	               |			И ЗаклДог_ДатаОконч.ДоговорКонтрагента.Код = ВложенныйЗапрос.ДоговорКонтрагентаКод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ЗаклДог_ДатаОконч.Организация,
				   //---АК
	               |	ЗаклДог_ДатаОконч.Контрагент КАК Контрагент,
	               |	ЗаклДог_ДатаОконч.ТТ КАК ТТ,
	               |	ЗаклДог_ДатаОконч.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ЗаклДог_ДатаОконч.Сумма КАК Сумма,
	               |	ЗаклДог_ДатаОконч.ДатаЗаключения КАК ДатаЗаключения,
	               |	ЗаклДог_ДатаОконч.ДатаОкончания КАК ДатаОкончания,
	               |	ЗаклДог_ДатаОконч.ЗаключениеДоговора КАК ЗаключениеДоговора
	               |ПОМЕСТИТЬ ЗаклДог_НеПросроч
	               |ИЗ
	               |	ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |ГДЕ
	               |	ЗаклДог_ДатаОконч.ДатаОкончания >= &Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ЗаклДог_Просроченные.Организация,
				   //---АК
	               |	ЗаклДог_Просроченные.Контрагент,
	               |	ЗаклДог_Просроченные.ТТ,
	               |	ЗаклДог_Просроченные.ДоговорКонтрагента,
	               |	ЗаклДог_Просроченные.Сумма,
	               |	ЗаклДог_Просроченные.ДатаЗаключения,
	               |	ЗаклДог_Просроченные.ДатаОкончания,
	               |	ЗаклДог_Просроченные.ЗаключениеДоговора
	               |ИЗ
	               |	ЗаклДог_Просроченные КАК ЗаклДог_Просроченные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |			ВложенныйЗапрос.ТТ КАК ТТ,
	               |			ВложенныйЗапрос.КолДействующих КАК КолДействующих,
	               |			ВложенныйЗапрос.КолПросроченных КАК КолПросроченных
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |				ВложенныйЗапрос.ТТ КАК ТТ,
	               |				СУММА(ВложенныйЗапрос.КолДействующих) КАК КолДействующих,
	               |				СУММА(ВложенныйЗапрос.КолПросроченных) КАК КолПросроченных
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ЗаклДог_ДатаОконч.Контрагент КАК Контрагент,
	               |					ЗаклДог_ДатаОконч.ТТ КАК ТТ,
	               |					ЗаклДог_ДатаОконч.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |					ЗаклДог_ДатаОконч.ЗаключениеДоговора КАК ЗаключениеДоговора,
	               |					ВЫБОР
	               |						КОГДА ЗаклДог_ДатаОконч.ДатаОкончания >= &Дата
	               |							ТОГДА 1
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК КолДействующих,
	               |					ВЫБОР
	               |						КОГДА ЗаклДог_ДатаОконч.ДатаОкончания < &Дата
	               |							ТОГДА 1
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК КолПросроченных
	               |				ИЗ
	               |					ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч) КАК ВложенныйЗапрос
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВложенныйЗапрос.Контрагент,
	               |				ВложенныйЗапрос.ТТ) КАК ВложенныйЗапрос
	               |		ГДЕ
	               |			ВложенныйЗапрос.КолДействующих = 0
	               |			И ВложенныйЗапрос.КолПросроченных <> 0) КАК ПодсчетКоличества
	               |		ПО ЗаклДог_Просроченные.Контрагент = ПодсчетКоличества.Контрагент
	               |			И ЗаклДог_Просроченные.ТТ = ПодсчетКоличества.ТТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ВложенныйЗапрос.Организация,
				   //---АК
	               |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |	ВложенныйЗапрос.ТТ КАК ТТ,
	               |	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	               |	СУММА(ВложенныйЗапрос.Кол) КАК Кол
	               |ПОМЕСТИТЬ ЗаклДог_КолДогПоТТ
	               |ИЗ
	               |	(ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |		ЗаклДог_НеПросроч.Организация КАК Организация,
				   //---АК
	               |		ЗаклДог_НеПросроч.Контрагент КАК Контрагент,
	               |		ЗаклДог_НеПросроч.ТТ КАК ТТ,
	               |		ЗаклДог_НеПросроч.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ЗаклДог_НеПросроч.Сумма КАК Сумма,
	               |		ЗаклДог_НеПросроч.ДатаЗаключения КАК ДатаЗаключения,
	               |		ЗаклДог_НеПросроч.ДатаОкончания КАК ДатаОкончания,
	               |		ЗаклДог_НеПросроч.ЗаключениеДоговора КАК ЗаключениеДоговора,
	               |		1 КАК Кол
	               |	ИЗ
	               |		ЗаклДог_НеПросроч КАК ЗаклДог_НеПросроч) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Контрагент,
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|	ВложенныйЗапрос.ТТ
	               |	ВложенныйЗапрос.ТТ,
	               |	ВложенныйЗапрос.Организация
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ РасторжениеДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДопСогл_ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДопСогл_Депозит
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	Фин_ЗаклДог_ПоДоговорам.Организация,
				   //---АК
	               |	Фин_ЗаклДог_ПоДоговорам.Контрагент,
	               |	Фин_ЗаклДог_ПоДоговорам.ТорговаяТочка,
	               |	Фин_ЗаклДог_ПоДоговорам.СуммаОстаток,
	               |	Фин_ЗаклДог_ПоДоговорам.ДоговорКонтрагента,
	               |	Фин_ЗаклДог_ПоДоговорам.ДатаОкончания,
	               |	Фин_ЗаклДог_ПоДоговорам.СуммаЗалога КАК СуммаЗалога,
	               |	Фин_ЗаклДог_ПоДоговорам.ЗаключениеДоговора,
	               |	Фин_ЗаклДог_ПоДоговорам.ДатаЗаключения
	               |ПОМЕСТИТЬ ФинСДоговором
	               |ИЗ
	               |	(ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |		ВложенныйЗапрос.Организация КАК Организация,
				   //---АК
	               |		ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |		ВложенныйЗапрос.ТорговаяТочка КАК ТорговаяТочка,
	               |		ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВложенныйЗапрос.ЗаключениеДоговора КАК ЗаключениеДоговора,
	               |		ВложенныйЗапрос.ДатаЗаключения КАК ДатаЗаключения,
	               |		ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания,
	               |		ВложенныйЗапрос.СуммаЗалога КАК СуммаЗалога,
	               |		СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			ВложенныйЗапрос.Организация КАК Организация,
				   //---АК
	               |			ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |			ВложенныйЗапрос.ТорговаяТочка КАК ТорговаяТочка,
	               |			ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			ВложенныйЗапрос.ЗаключениеДоговора КАК ЗаключениеДоговора,
	               |			ВложенныйЗапрос.ДатаЗаключения КАК ДатаЗаключения,
	               |			ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания,
	               |			ВложенныйЗапрос.СуммаЗалога КАК СуммаЗалога,
	               |			ВложенныйЗапрос.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			(ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |				Фин.Организация КАК Организация,
				   //---АК
	               |				Фин.Контрагент КАК Контрагент,
	               |				Фин.ТорговаяТочка КАК ТорговаяТочка,
	               |				ЗаклДог_НеПросроч.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				ЗаклДог_НеПросроч.ЗаключениеДоговора КАК ЗаключениеДоговора,
	               |				ЗаклДог_НеПросроч.ДатаЗаключения КАК ДатаЗаключения,
	               |				ЗаклДог_НеПросроч.ДатаОкончания КАК ДатаОкончания,
	               |				ЗаклДог_НеПросроч.Сумма КАК СуммаЗалога,
	               |				ВЫБОР
	               |					КОГДА ЗаклДог_КолДогПоТТ.Кол = 1
	               |						ТОГДА Фин.СуммаОстаток
	               |					КОГДА ЗаклДог_КолДогПоТТ.Кол > 1
	               |						ТОГДА ЗаклДог_НеПросроч.Сумма
	               |				КОНЕЦ КАК СуммаОстаток
	               |			ИЗ
	               |				Фин КАК Фин
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаклДог_НеПросроч КАК ЗаклДог_НеПросроч
	               |					ПО Фин.Контрагент = ЗаклДог_НеПросроч.Контрагент
	               |						И Фин.ТорговаяТочка = ЗаклДог_НеПросроч.ТТ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |						И Фин.Организация = ЗаклДог_НеПросроч.Организация
				   //---АК
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаклДог_КолДогПоТТ КАК ЗаклДог_КолДогПоТТ
	               |					ПО Фин.Контрагент = ЗаклДог_КолДогПоТТ.Контрагент
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|						И Фин.ТорговаяТочка = ЗаклДог_КолДогПоТТ.ТТ) КАК ВложенныйЗапрос
	               |						И Фин.ТорговаяТочка = ЗаклДог_КолДогПоТТ.ТТ
	               |						И Фин.Организация = ЗаклДог_КолДогПоТТ.Организация) КАК ВложенныйЗапрос
				   //---АК
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			Фин.Организация,
				   //---АК
	               |			Фин.Контрагент,
	               |			Фин.ТорговаяТочка,
	               |			ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			ВЫБОР
	               |				КОГДА ЗаклДог_КолДогПоТТ.Кол ЕСТЬ NULL
	               |					ТОГДА Фин.СуммаОстаток
	               |				КОГДА ЗаклДог_КолДогПоТТ.Кол > 1
	               |					ТОГДА Фин.СуммаОстаток - ЗаклДог_КолДогПоТТ.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ
	               |		ИЗ
	               |			Фин КАК Фин
	               |				ЛЕВОЕ СОЕДИНЕНИЕ ЗаклДог_КолДогПоТТ КАК ЗаклДог_КолДогПоТТ
	               |				ПО Фин.Контрагент = ЗаклДог_КолДогПоТТ.Контрагент
	               |					И Фин.ТорговаяТочка = ЗаклДог_КолДогПоТТ.ТТ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |					И Фин.Организация = ЗаклДог_КолДогПоТТ.Организация
				   //---АК
	               |		ГДЕ
	               |			(ЗаклДог_КолДогПоТТ.Кол > 1
	               |						И Фин.СуммаОстаток <> ЗаклДог_КолДогПоТТ.Сумма
	               |					ИЛИ ЗаклДог_КолДогПоТТ.Кол ЕСТЬ NULL)) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Контрагент,
	               |		ВложенныйЗапрос.ТорговаяТочка,
	               |		ВложенныйЗапрос.ДоговорКонтрагента,
	               |		ВложенныйЗапрос.ЗаключениеДоговора,
	               |		ВложенныйЗапрос.ДатаЗаключения,
	               |		ВложенныйЗапрос.ДатаОкончания,
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|		ВложенныйЗапрос.СуммаЗалога) КАК Фин_ЗаклДог_ПоДоговорам
	               |		ВложенныйЗапрос.СуммаЗалога,
	               |		ВложенныйЗапрос.Организация) КАК Фин_ЗаклДог_ПоДоговорам
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	Бух.Организация,
				   //---АК
	               |	Бух.Контрагент,
	               |	Бух.Договор_Наименование,
	               |	Бух.Договор_Номер,
	               |	Бух.Договор_Дата,
	               |	Бух.Договор_СрокДействия,
	               |	Бух.СуммаОстаток,
	               |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	               |	ЗаклДог_ДатаОконч.ТТ КАК ТорговаяТочка,
	               |	ЗаклДог_ДатаОконч.ДатаОкончания
	               |ПОМЕСТИТЬ БухИтог
	               |ИЗ
	               |	Бух КАК Бух
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |		ПО Бух.Контрагент = ЗаклДог_ДатаОконч.Контрагент
	               |			И Бух.Договор_Код = ЗаклДог_ДатаОконч.ДоговорКонтрагента.Код
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			И Бух.Организация = ЗаклДог_ДатаОконч.Организация
				   //---АК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО Бух.Договор_Код = ДоговорыКонтрагентов.Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ВЫБОР
	               |		КОГДА БухИтог.Организация ЕСТЬ NULL
	               |			ТОГДА ФинСДоговором.Организация
	               |		ИНАЧЕ БухИтог.Организация
	               |	КОНЕЦ КАК Организация,
				   //---АК
	               |	ВЫБОР
	               |		КОГДА БухИтог.Контрагент ЕСТЬ NULL
	               |			ТОГДА ФинСДоговором.Контрагент
	               |		ИНАЧЕ БухИтог.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА БухИтог.ТорговаяТочка ЕСТЬ NULL
	               |			ТОГДА ФинСДоговором.ТорговаяТочка
	               |		ИНАЧЕ БухИтог.ТорговаяТочка
	               |	КОНЕЦ КАК ТорговаяТочка,
	               |	ВЫБОР
	               |		КОГДА БухИтог.ДоговорКонтрагента ЕСТЬ NULL
	               |			ТОГДА ФинСДоговором.ДоговорКонтрагента
	               |		ИНАЧЕ БухИтог.ДоговорКонтрагента
	               |	КОНЕЦ КАК ДоговорКонтрагента,
	               |	ВЫБОР
	               |		КОГДА НЕ ФинСДоговором.ДоговорКонтрагента ЕСТЬ NULL
	               |			ТОГДА ФинСДоговором.ДоговорКонтрагента.Наименование
	               |		КОГДА НЕ БухИтог.ДоговорКонтрагента ЕСТЬ NULL
	               |			ТОГДА БухИтог.ДоговорКонтрагента.Наименование
	               |		ИНАЧЕ БухИтог.Договор_Наименование
	               |	КОНЕЦ КАК Договор_Наименование,
	               |	ФинСДоговором.ЗаключениеДоговора,
	               |	ФинСДоговором.СуммаЗалога КАК СуммаЗалога,
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|	ВЫРАЗИТЬ(БухИтог.Договор_СрокДействия КАК ДАТА) КАК Договор_СрокДействия,
				   //|	ФинСДоговором.ДатаОкончания,
				   //|	БухИтог.СуммаОстаток КАК СуммаОстаток,
				   //|	ФинСДоговором.СуммаОстаток КАК СуммаОстаток_Фин
	               |	ВЫБОР
	               |		КОГДА БухИтог.Договор_СрокДействия ЕСТЬ NULL
	               |			ТОГДА &ПустаяДата
	               |		ИНАЧЕ БухИтог.Договор_СрокДействия
	               |	КОНЕЦ КАК Договор_СрокДействия,
	               |	ВЫБОР
	               |		КОГДА ФинСДоговором.ДатаОкончания ЕСТЬ NULL
	               |			ТОГДА &ПустаяДата
	               |		ИНАЧЕ ФинСДоговором.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА БухИтог.СуммаОстаток ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ БухИтог.СуммаОстаток
	               |	КОНЕЦ КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА ФинСДоговором.СуммаОстаток ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ ФинСДоговором.СуммаОстаток
	               |	КОНЕЦ КАК СуммаОстаток_Фин
				   //---АК
	               |ПОМЕСТИТЬ БУиФИН
	               |ИЗ
	               |	БухИтог КАК БухИтог
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ФинСДоговором КАК ФинСДоговором
	               |		ПО БухИтог.Контрагент = ФинСДоговором.Контрагент
	               |			И БухИтог.ДоговорКонтрагента = ФинСДоговором.ДоговорКонтрагента
	               |			И БухИтог.ТорговаяТочка = ФинСДоговором.ТорговаяТочка
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			И БухИтог.Организация = ФинСДоговором.Организация
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	БУиФИН.Организация,
				   //---АК
	               |	БУиФИН.Контрагент,
	               |	БУиФИН.ТорговаяТочка,
	               |	БУиФИН.ДоговорКонтрагента,
	               |	БУиФИН.Договор_Наименование,
	               |	ВЫБОР
	               |		КОГДА БУиФИН.ЗаключениеДоговора ЕСТЬ NULL
	               |			ТОГДА ЗаклДог_ДатаОконч.ЗаключениеДоговора
	               |		ИНАЧЕ БУиФИН.ЗаключениеДоговора
	               |	КОНЕЦ КАК ЗаключениеДоговора,
	               |	ВЫБОР
	               |		КОГДА БУиФИН.ЗаключениеДоговора ЕСТЬ NULL
	               |			ТОГДА ЗаклДог_ДатаОконч.Сумма
	               |		ИНАЧЕ БУиФИН.СуммаЗалога
	               |	КОНЕЦ КАК СуммаЗалога,
	               |	БУиФИН.Договор_СрокДействия,
	               |	ВЫБОР
	               |		КОГДА БУиФИН.ЗаключениеДоговора ЕСТЬ NULL
	               |			ТОГДА ЗаклДог_ДатаОконч.ДатаОкончания
	               |		ИНАЧЕ БУиФИН.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	БУиФИН.СуммаОстаток,
	               |	БУиФИН.СуммаОстаток_Фин
	               |ПОМЕСТИТЬ ПередОтбором
	               |ИЗ
	               |	БУиФИН КАК БУиФИН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаклДог_ДатаОконч КАК ЗаклДог_ДатаОконч
	               |		ПО БУиФИН.Контрагент = ЗаклДог_ДатаОконч.Контрагент
	               |			И БУиФИН.ТорговаяТочка = ЗаклДог_ДатаОконч.ТТ
	               |			И БУиФИН.ДоговорКонтрагента = ЗаклДог_ДатаОконч.ДоговорКонтрагента
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			И БУиФИН.Организация = ЗаклДог_ДатаОконч.Организация
				   //---АК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Бух
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Фин
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ЗаклДог_ДатаОконч
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ЗаклДог_Просроченные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ЗаклДог_КолДогПоТТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ЗаклДог_НеПросроч
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ФинСДоговором
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ БухИтог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ БУиФИН
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |	ПередОтбором.Организация,
				   //---АК
	               |	ПередОтбором.Контрагент,
	               |	ПередОтбором.ТорговаяТочка,
	               |	ПередОтбором.ДоговорКонтрагента,
	               |	ПередОтбором.Договор_Наименование,
	               |	ПередОтбором.ЗаключениеДоговора,
	               |	ПередОтбором.СуммаЗалога,
	               |	ПередОтбором.Договор_СрокДействия,
	               |	ПередОтбором.ДатаОкончания,
	               |	ПередОтбором.СуммаОстаток,
	               |	ПередОтбором.СуммаОстаток_Фин
	               |ИЗ
	               |	ПередОтбором КАК ПередОтбором
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				   //+++АК sils 28.04.2018 ИП-00017858.04
	               |			ПередОтбором.Организация КАК Организация,
	               |			ПередОтбором.ДоговорКонтрагента КАК ДоговорКонтрагента,
				   //---АК
	               |			ПередОтбором.Контрагент КАК Контрагент,
	               |			ПередОтбором.ТорговаяТочка КАК ТорговаяТочка
	               |		ИЗ
	               |			ПередОтбором КАК ПередОтбором
	               |		ГДЕ
	               |			НЕ(НАЧАЛОПЕРИОДА(ПередОтбором.Договор_СрокДействия, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПередОтбором.ДатаОкончания, ДЕНЬ)
	               |						И ПередОтбором.СуммаЗалога = ПередОтбором.СуммаОстаток
	               |						И ПередОтбором.СуммаЗалога = ПередОтбором.СуммаОстаток_Фин)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПередОтбором.Контрагент,
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|			ПередОтбором.ТорговаяТочка) КАК ВложенныйЗапрос
	               |			ПередОтбором.ТорговаяТочка,
	               |			ПередОтбором.ДоговорКонтрагента,
	               |			ПередОтбором.Организация) КАК ВложенныйЗапрос
				   //---АК
	               |		ПО ПередОтбором.Контрагент = ВложенныйЗапрос.Контрагент
				   //+++АК sils 28.04.2018 ИП-00017858.04
				   //|			И ПередОтбором.ТорговаяТочка = ВложенныйЗапрос.ТорговаяТочка";
	               |			И ПередОтбором.ТорговаяТочка = ВложенныйЗапрос.ТорговаяТочка
				   //+++АК sils 11.09.2018 ИП-00017858.04
				   //|			И ПередОтбором.Организация = ВложенныйЗапрос.Организация";
	               |			И ПередОтбором.Организация = ВложенныйЗапрос.Организация
	               |			И ПередОтбором.ДоговорКонтрагента = ВложенныйЗапрос.ДоговорКонтрагента
	               |ГДЕ
	               |	(ПередОтбором.СуммаОстаток <> 0
	               |			ИЛИ ПередОтбором.СуммаОстаток_Фин <> 0)";				   
				   //---АК
				   //---АК
	ТЗ_Итог = Запрос.Выполнить().Выгрузить();

	//***********************************************************************
	// Ну это мы полученное в СКД засовываем
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ_Итог);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры
