

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого Стр Из ВладелецФормы.Сортировка Цикл
		НовСтр=Сортировка.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла; 
	Для каждого Кол Из ВладелецФормы.ПолучитьКолонки() Цикл
		Элементы.СортировкаПоле.СписокВыбора.Добавить(Кол);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ВладелецФормы.Сортировка.Очистить();
	Для каждого Стр Из Сортировка Цикл
		Если ЗначениеЗаполнено(Стр.Поле) Тогда
			НовСтр=ВладелецФормы.Сортировка.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		КонецЕсли; 
	КонецЦикла; 
	СтрСорт="";
	Для каждого Стр Из Сортировка Цикл
		Если ЗначениеЗаполнено(Стр.Поле) Тогда
			СтрСорт=СтрСорт+","+Стр.Поле+" "+Стр.Порядок;
		КонецЕсли; 
	КонецЦикла; 
	СтрСорт=Прав(СтрСорт,СтрДлина(СтрСорт)-1);
	Если ЗначениеЗаполнено(СтрСорт) Тогда
		ВладелецФормы.Товары.Сортировать(СтрСорт);
	КонецЕсли;
	Закрыть();
КонецПроцедуры


