
Процедура ПриЗаписи(Отказ)
	Если не ЭтотОбъект.Проект тогда
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МобильноеПриложение.Ссылка
		|ИЗ
		|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
		|ГДЕ
		|	МобильноеПриложение.Профиль = ЗНАЧЕНИЕ(Справочник.МП_ПрофилиИспользования.Строитель)
		|	И МобильноеПриложение.ПометкаУдаления = ЛОЖЬ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла;
	КонецЕсли;
	
	//++AK LOBV Пишем историю
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	АК_ИсторияСтроительстваСрезПоследних.ДатаНачала,
	             |	АК_ИсторияСтроительстваСрезПоследних.ДатаПлановогоЗавершения,
	             |	АК_ИсторияСтроительстваСрезПоследних.ДатаФактическогоЗавершения,
	             |	АК_ИсторияСтроительстваСрезПоследних.Статус,
	             |	АК_ИсторияСтроительстваСрезПоследних.Комментарий
	             |ИЗ
	             |	РегистрСведений.АК_ИсторияСтроительства.СрезПоследних(
	             |			&Дата,
	             |			Проект = &Проект
	             |				И Этап = &Этап) КАК АК_ИсторияСтроительстваСрезПоследних";
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Проект",?(ЭтотОбъект.Проект,ЭтотОбъект.Ссылка,ЭтотОбъект.ЧастьПроекта));
	Запрос.УстановитьПараметр("Этап",?(ЭтотОбъект.Проект,Документы.МП_ЗаданиеСтроителей.ПустаяСсылка(),ЭтотОбъект.Ссылка));
	Выборка=Запрос.Выполнить().Выбрать();
	ДелаемЗапись=Ложь;
	Если Выборка.Следующий() тогда
		Если ЭтотОбъект.ДатаНачала<>Выборка.ДатаНачала или
			ЭтотОбъект.ДатаПлановогоЗавершения<>Выборка.ДатаПлановогоЗавершения или
			ЭтотОбъект.ДатаФактическогоЗавершения<>Выборка.ДатаФактическогоЗавершения или
			ЭтотОбъект.Статус<>Выборка.Статус или
			ЭтотОбъект.Комментарий<>Выборка.Комментарий тогда
			ДелаемЗапись=Истина;
		КонецЕсли;
	Иначе
		ДелаемЗапись=Истина;
	КонецЕСли;
	Если ДелаемЗапись тогда
		МенеджерЗаписи=РегистрыСведений.АК_ИсторияСтроительства.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Проект=?(ЭтотОбъект.Проект,ЭтотОбъект.Ссылка,ЭтотОбъект.ЧастьПроекта);
			МенеджерЗаписи.Этап=?(ЭтотОбъект.Проект,Документы.МП_ЗаданиеСтроителей.ПустаяСсылка(),ЭтотОбъект.Ссылка);
			МенеджерЗаписи.Период=ТекущаяДата();
			МенеджерЗаписи.ДатаНачала=ЭтотОбъект.ДатаНачала;
			МенеджерЗаписи.ДатаПлановогоЗавершения=ЭтотОбъект.ДатаПлановогоЗавершения;
			МенеджерЗаписи.ДатаФактическогоЗавершения=ЭтотОбъект.ДатаФактическогоЗавершения;
			МенеджерЗаписи.Статус=ЭтотОбъект.Статус;
			МенеджерЗаписи.Комментарий=ЭтотОбъект.Комментарий;
			МенеджерЗаписи.Пользователь=ПараметрыСеанса.ТекущийПользователь;
			МенеджерЗаписи.Записать();
		КонецЕсли;
				
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыСтроительства.Приостановлено") Тогда
		ПроверяемыеРеквизиты.Добавить("Комментарий");
	КонецЕсли;
	
КонецПроцедуры
//++AK Lobv
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.СтатусДоЗаписи<>ЭтотОбъект.Статус тогда
		ПричинаОтправкиОповещения="";
		Если ЭтотОбъект.Статус=Перечисления.СтатусыСтроительства.НеСогласовано тогда
			ПричинаОтправкиОповещения="Требуется согласование";
		ИначеЕсли ЭтотОбъект.Статус=Перечисления.СтатусыСтроительства.Согласовано тогда
			ПричинаОтправкиОповещения="Получено согласование";
		ИначеЕсли ЭтотОбъект.Статус=Перечисления.СтатусыСтроительства.ТребуетДоработки тогда
			ПричинаОтправкиОповещения="Требуется доработка";
		ИначеЕсли ЭтотОбъект.Статус=Перечисления.СтатусыСтроительства.Завершено тогда
			ПричинаОтправкиОповещения="Завершение";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПричинаОтправкиОповещения) тогда 
		УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
		Почта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Почта.Подключиться(Профиль);
		Письмо.Тема = ПричинаОтправкиОповещения+". Объект "+Строка(ЭтотОбъект.ОбъектCтроительства)+". "+?(ЭтотОбъект.Проект,"Проект ","Этап ")+Строка(ЭтотОбъект.ТипСобытия);
		ТекстСообщения = Письмо.Тексты.Добавить();
		ТекстСообщения.Текст     = 
			"Статус: "+Строка(ЭтотОбъект.Статус)+Символы.ПС+
			"Комментарий: "+Строка(ЭтотОбъект.Комментарий)+Символы.ПС+
			"Ответственный: "+Строка(ЭтотОбъект.Ответственный)+Символы.ПС;
		ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;

		Письмо.ИмяОтправителя = ""+УчетнаяЗапись+"";
		Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
		Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
		
		Если ПричинаОтправкиОповещения="Требуется согласование" или ПричинаОтправкиОповещения="Завершение" тогда
			ЭлПочтаОтветственного="posuhv@mail.ru";
		Иначе
			ЭлПочтаОтветственного=ПолучитьЭлПочтуОтветственного(ЭтотОбъект.Ответственный);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлПочтаОтветственного) тогда
			Получатель = Письмо.Получатели.Добавить();
			Получатель.Адрес           = ЭлПочтаОтветственного;
			Получатель.ОтображаемоеИмя = ЭлПочтаОтветственного;
			Почта.Послать(Письмо);
		КонецЕсли;
		
		//Если это проект, то после согласования мы отправляем письмо всем поставщикам
		Если ЭтотОбъект.Проект и ПричинаОтправкиОповещения="Получено согласование" тогда
			Письмо.Тема = "График производства работ по объекту "+Строка(ЭтотОбъект.ОбъектCтроительства.Адрес)+".";
			ТекстСообщения.Текст     = 
			"Добрый день!"+Символы.ПС+
			"Направляем Вам график производства работ по объекту "+Строка(ЭтотОбъект.ОбъектCтроительства.Адрес)+": "+Символы.ПС;
			ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
			ЗапросЭтапов=Новый Запрос;
			ЗапросЭтапов.Текст="ВЫБРАТЬ
			             |	МП_ЗаданиеСтроителей.ТипСобытия,
			             |	МП_ЗаданиеСтроителей.ДатаНачала КАК ДатаНачала,
			             |	МП_ЗаданиеСтроителей.ДатаПлановогоЗавершения КАК ДатаПлановогоЗавершения
			             |ИЗ
			             |	Документ.МП_ЗаданиеСтроителей КАК МП_ЗаданиеСтроителей
			             |ГДЕ
			             |	МП_ЗаданиеСтроителей.ЧастьПроекта = &ЧастьПроекта
			             |	И МП_ЗаданиеСтроителей.ПометкаУдаления = ЛОЖЬ
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	ДатаНачала,
			             |	ДатаПлановогоЗавершения";
			ЗапросЭтапов.УстановитьПараметр("ЧастьПроекта",ЭтотОбъект.Ссылка);
			ВыборкаЭтапов=ЗапросЭтапов.Выполнить().Выбрать();
			Пока ВыборкаЭтапов.Следующий() цикл
				ТекстСообщения.Текст     =ТекстСообщения.Текст+"- "+Строка(ВыборкаЭтапов.ТипСобытия)+?(ЗначениеЗаполнено(ВыборкаЭтапов.ДатаНачала)," с "+Строка(Формат(ВыборкаЭтапов.ДатаНачала,"ДЛФ=Д")),"")+?(ЗначениеЗаполнено(ВыборкаЭтапов.ДатаПлановогоЗавершения)," по "+Строка(Формат(ВыборкаЭтапов.ДатаПлановогоЗавершения,"ДЛФ=Д")),"")+Символы.ПС;	
			КонецЦикла;
			Письмо.Получатели.Очистить();
			Для каждого СтрПоставщик из ЭтотОбъект.Поставщики цикл
				Если ЗначениеЗаполнено(СтрПоставщик.ЭлПочта) тогда
					Получатель = Письмо.Получатели.Добавить();
					Получатель.Адрес           = СтрПоставщик.ЭлПочта;
					Получатель.ОтображаемоеИмя = СтрПоставщик.ЭлПочта;
				КонецЕсли;
			КонецЦикла;
			Если Письмо.Получатели.Количество()>0 тогда
				Почта.Послать(Письмо);
			КонецЕсли;
		КонецЕсли;
		
		Почта.Отключиться();
		КонецЕсли;
		ЭтотОбъект.СтатусДоЗаписи=ЭтотОбъект.Статус;
		КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьЭлПочтуОтветственного(Ответственный)
	Отбор=Новый Структура;
	Отбор.Вставить("Объект",Ответственный);
	Отбор.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Отбор.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	ЭлПочта=РегистрыСведений.КонтактнаяИнформация.Получить(Отбор).Представление;
	Возврат ЭлПочта;
КонецФункции
//--AK Lobv