
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	Если НЕ ЗначениеЗаполнено(СтатусМагазина) Тогда
		СтатусМагазина = Перечисления.СтатусыМагазинаДляВебЗаказов.Новый;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Ссылка.ТорговаяТочка)
		И ЗначениеЗаполнено(ТорговаяТочка) Тогда
		Если ТекущаяДата() - НачалоДня(ТекущаяДата()) <= 57600 Тогда
			ДатаПередачиВМагазин = ТекущаяДата();
		Иначе
			ДатаПередачиВМагазин = НачалоДня(ТекущаяДата()) + 86400;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	НомерТочки = ТорговаяТочка.НомерТочки;
	
	Если НЕ ОбщегоНазначения.ЭтоКопияБазы() Тогда
		Если ДополнительныеСвойства.Свойство("НеВыгружатьЗаказыВСкл")
			И ДополнительныеСвойства.НеВыгружатьЗаказыВСкл = Истина Тогда
		Иначе
			Попытка
				ЗапросНомера = Новый Запрос();
				ЗапросНомера.Текст = "ВЫБРАТЬ
				                     |	CMS1C_ДополнительныеРеквизитыЗаказа.Номер
				                     |ИЗ
				                     |	РегистрСведений.CMS1C_ДополнительныеРеквизитыЗаказа КАК CMS1C_ДополнительныеРеквизитыЗаказа
				                     |ГДЕ
				                     |	CMS1C_ДополнительныеРеквизитыЗаказа.Заказ = &Заказ";
									 
				ЗапросНомера.УстановитьПараметр("Заказ", Ссылка);
				ВыборкаНомера = ЗапросНомера.Выполнить().Выбрать();
				Если ВыборкаНомера.Следующий() Тогда
					НомерДляСкл = ВыборкаНомера.Номер;
				Иначе	
					НомерДляСкл = Номер;
				КонецЕсли;	
				Пока Лев(НомерДляСкл, 1) = "0" Цикл
					НомерДляСкл = Сред(НомерДляСкл, 2);
				КонецЦикла;
				НомерЧислом = Число(НомерДляСкл);
				Если ЗначениеЗаполнено(НомерЧислом) Тогда
					ADOСоединение = Новый COMОбъект("ADODB.Connection");
					ADOСоединение.ConnectionTimeOut = 0;
					ADOСоединение.CommandTimeOut    = 0;
					
					СтрСоедиение = ОбменСAccess.ПолучитьСтрокуСоединения("sms_izbenka");
					
					ADOСоединение.ConnectionString  = СтрСоедиение;
					ADOСоединение.Open();
					
					//обработаем изменения шапки
					ТабСравненияШапки = Новый ТаблицаЗначений();
					ТабСравненияШапки.Колонки.Добавить("date_z", Новый ОписаниеТипов("Дата"));
					ТабСравненияШапки.Колонки.Добавить("tel_pok", Новый ОписаниеТипов("Строка"));
					ТабСравненияШапки.Колонки.Добавить("fio_pok", Новый ОписаниеТипов("Строка"));
					ТабСравненияШапки.Колонки.Добавить("komment", Новый ОписаниеТипов("Строка"));
					ТабСравненияШапки.Колонки.Добавить("shopno_rep", Новый ОписаниеТипов("Число"));
					
					СтрЗапрос = "SELECT Zakaz_D.N_zakaz as N_zakaz, Zakaz_D.date_z, Zakaz_D.tel_pok, Zakaz_D.fio_pok, Zakaz_D.komment, Zakaz_D.shopno_rep
								|FROM [SMS_REPL].[dbo].[Zakaz_D] as Zakaz_D (nolock)
								|WHERE Zakaz_D.N_zakaz = " + ВнешниеДанные.ФорматПоля(НомерЧислом);
								
					rs = ADOСоединение.Execute(СтрЗапрос);
					Попытка
						rs.MoveFirst();
						
						Если НЕ rs.EOF() Тогда
							СтрокаДоб = ТабСравненияШапки.Добавить();
							СтрокаДоб.date_z = rs.Fields("date_z").Value;
							СтрокаДоб.tel_pok = rs.Fields("tel_pok").Value;
							СтрокаДоб.fio_pok = rs.Fields("fio_pok").Value;
							СтрокаДоб.komment = rs.Fields("komment").Value;
							СтрокаДоб.shopno_rep = rs.Fields("shopno_rep").Value;
						КонецЕсли;
					Исключение
					КонецПопытки;
					
					СтрЗапросШапка = "";
					Если ТабСравненияШапки.Количество() = 0 Тогда
						СтрЗапросШапка = "INSERT INTO [SMS_REPL].[dbo].[Zakaz_D]
										 |([N_zakaz]
										 |	  ,[date_z]
										 |	  ,[tel_pok]
										 |	  ,[fio_pok]
										 |	  ,[komment]
										 |	  ,[shopno_rep])
										 |VALUES 
										 |(" + ВнешниеДанные.ФорматПоля(НомерЧислом) //N_zakaz
										 + ", " + ВнешниеДанные.ФорматПоля(Дата, Истина) //date_z
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(Телефон, 10)) //tel_pok
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(ФИОПокупателя, 100)) //fio_pok
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(Комментарий, 300)) //komment
										 + ", " + ВнешниеДанные.ФорматПоля(НомерТочки) //shopno_rep
										 + ")";
					ИначеЕсли ТабСравненияШапки.Количество() > 0 
						И ТабСравненияШапки[0].shopno_rep = НомерТочки Тогда
						Если (Прав(Телефон, 10) <> СокрЛП(ТабСравненияШапки[0].tel_pok)
							ИЛИ Прав(ФИОПокупателя, 100) <> СокрЛП(ТабСравненияШапки[0].fio_pok)
							ИЛИ Прав(Комментарий, 300) <> СокрЛП(ТабСравненияШапки[0].komment)) Тогда
							СтрЗапросШапка = "UPDATE [SMS_REPL].[dbo].[Zakaz_D]
	   									|SET [date_z] = " + ВнешниеДанные.ФорматПоля(Дата, Истина) //date_z
										+ ", [tel_pok] = " + ВнешниеДанные.ФорматПоля(Прав(Телефон, 10)) //tel_pok
										+ ", [fio_pok] = " + ВнешниеДанные.ФорматПоля(Прав(ФИОПокупателя, 100)) //fio_pok
										+ ", [komment] = " + ВнешниеДанные.ФорматПоля(Прав(Комментарий, 300)) //komment
										+ ", [shopno_rep] = " + ВнешниеДанные.ФорматПоля(НомерТочки) //shopno_rep
										+ " WHERE [N_zakaz] = " + ВнешниеДанные.ФорматПоля(НомерЧислом);
						КонецЕсли;				
					Иначе
						СтрЗапросШапка = "DELETE FROM [SMS_REPL].[dbo].[Zakaz_D]
	      								|WHERE [N_zakaz] = " + ВнешниеДанные.ФорматПоля(НомерЧислом) + "
										|
										|INSERT INTO [SMS_REPL].[dbo].[Zakaz_D]
										 |([N_zakaz]
										 |	  ,[date_z]
										 |	  ,[tel_pok]
										 |	  ,[fio_pok]
										 |	  ,[komment]
										 |	  ,[shopno_rep])
										 |VALUES 
										 |(" + ВнешниеДанные.ФорматПоля(НомерЧислом) //N_zakaz
										 + ", " + ВнешниеДанные.ФорматПоля(Дата, Истина) //date_z
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(Телефон, 10)) //tel_pok
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(ФИОПокупателя, 100)) //fio_pok
										 + ", " + ВнешниеДанные.ФорматПоля(Прав(Комментарий, 300)) //komment
										 + ", " + ВнешниеДанные.ФорматПоля(НомерТочки) //shopno_rep
										 + ")";				
					КонецЕсли;	
					
					//теперь обработаем изменения по таб части
					ТоварыКВыгрузке = Товары.Выгрузить();
					Для Каждого СтрокаУслуга Из Услуги Цикл
						ЗаполнитьЗначенияСвойств(ТоварыКВыгрузке.Добавить(), СтрокаУслуга);
					КонецЦикла;	
					ТоварыКВыгрузке.Свернуть("Номенклатура", "Количество, Сумма");
					ТоварыКВыгрузке.Колонки.Добавить("id_tov", Новый ОписаниеТипов("Число"));
					ТоварыКВыгрузке.Колонки.Добавить("shopno_rep", Новый ОписаниеТипов("Число"));
					
					Запрос = Новый Запрос();
					Запрос.Текст = "ВЫБРАТЬ
					                     |	Номенклатура.Ссылка,
					                     |	Номенклатура.id_tov
					                     |ИЗ
					                     |	Справочник.Номенклатура КАК Номенклатура
					                     |ГДЕ
					                     |	Номенклатура.Ссылка В(&Товары)";
										 
					Запрос.УстановитьПараметр("Товары", ТоварыКВыгрузке.ВыгрузитьКолонку("Номенклатура"));
					ТабКешТовары = Запрос.Выполнить().Выгрузить();
					
					Для Каждого СтрокаТаб Из ТоварыКВыгрузке Цикл
						СтрокаКеш = ТабКешТовары.Найти(СтрокаТаб.Номенклатура, "Ссылка");
						СтрокаТаб.id_tov = СтрокаКеш.id_tov;
						СтрокаТаб.shopno_rep = НомерТочки;
					КонецЦикла;
					
					ТоварыВСкл = Новый ТаблицаЗначений();
					ТоварыВСкл.Колонки.Добавить("id_tov", Новый ОписаниеТипов("Число"));
					ТоварыВСкл.Колонки.Добавить("kolvo", Новый ОписаниеТипов("Число"));
					ТоварыВСкл.Колонки.Добавить("Summa", Новый ОписаниеТипов("Число"));
					ТоварыВСкл.Колонки.Добавить("row_rep", Новый ОписаниеТипов("Строка"));
					ТоварыВСкл.Колонки.Добавить("shopno_rep", Новый ОписаниеТипов("Число"));
					
					СтрЗапрос = "SELECT Zakaz_D_t.id_tov, Zakaz_D_t.kolvo, Zakaz_D_t.kolvo * Zakaz_D_t.price as Summa, Zakaz_D_t.row_rep, Zakaz_D_t.shopno_rep
								|FROM [SMS_REPL].[dbo].[Zakaz_D_t] as Zakaz_D_t (nolock)
								|WHERE Zakaz_D_t.N_zakaz = " + ВнешниеДанные.ФорматПоля(НомерЧислом);
								
					rs = ADOСоединение.Execute(СтрЗапрос);
					Попытка
						rs.MoveFirst();
						
						Пока НЕ rs.EOF() Цикл
							СтрокаДоб = ТоварыВСкл.Добавить();
							СтрокаДоб.id_tov = rs.Fields("id_tov").Value;
							СтрокаДоб.kolvo = rs.Fields("kolvo").Value;
							СтрокаДоб.Summa = rs.Fields("Summa").Value;
							СтрокаДоб.row_rep = Сред(rs.Fields("row_rep").Value, 2, 36);
							СтрокаДоб.shopno_rep = rs.Fields("shopno_rep").Value;
							rs.MoveNext();
						КонецЦикла;
					Исключение
					КонецПопытки;
					
					Запрос.УстановитьПараметр("ТабБаза", ТоварыКВыгрузке);
					Запрос.УстановитьПараметр("ТабСкл", ТоварыВСкл);
					Запрос.Текст = "ВЫБРАТЬ
					               |	Таб.id_tov КАК id_tov,
					               |	Таб.Количество КАК Количество,
					               |	Таб.Сумма КАК Сумма,
					               |	Таб.shopno_rep КАК shopno_rep
					               |ПОМЕСТИТЬ ВТ_ВБазе
					               |ИЗ
					               |	&ТабБаза КАК Таб
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	Таб.id_tov КАК id_tov,
					               |	Таб.kolvo КАК kolvo,
					               |	Таб.Summa КАК Summa,
					               |	Таб.row_rep КАК row_rep,
					               |	Таб.shopno_rep КАК shopno_rep
					               |ПОМЕСТИТЬ ВТ_ВСкл
					               |ИЗ
					               |	&ТабСкл КАК Таб
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |ВЫБРАТЬ
					               |	ВТ_ВБазе.id_tov КАК id_tovВБазе,
					               |	ВТ_ВБазе.Количество КАК КоличествоВБазе,
					               |	ВТ_ВБазе.Сумма КАК СуммаВБазе,
					               |	ВТ_ВБазе.shopno_rep КАК shopno_repВБазе,
					               |	ВТ_ВСкл.id_tov КАК id_tovВСкл,
					               |	ВТ_ВСкл.kolvo КАК kolvoВСкл,
					               |	ВТ_ВСкл.Summa КАК SummaВСкл,
					               |	ВТ_ВСкл.row_rep КАК row_repВСкл,
					               |	ВТ_ВСкл.shopno_rep КАК shopno_repВСкл,
					               |	ВЫБОР
					               |		КОГДА НЕ ВТ_ВБазе.id_tov ЕСТЬ NULL 
					               |				И ВТ_ВСкл.id_tov ЕСТЬ NULL 
					               |			ТОГДА 0
					               |		КОГДА НЕ ВТ_ВСкл.id_tov ЕСТЬ NULL 
					               |				И ВТ_ВБазе.id_tov ЕСТЬ NULL 
					               |			ТОГДА 1
					               |		КОГДА ЕСТЬNULL(ВТ_ВБазе.Количество, 0) <> ЕСТЬNULL(ВТ_ВСкл.kolvo, 0)
					               |				ИЛИ ЕСТЬNULL(ВТ_ВБазе.Сумма, 0) <> ЕСТЬNULL(ВТ_ВСкл.Summa, 0)
					               |			ТОГДА 2
					               |	КОНЕЦ КАК ВидОперации
					               |ИЗ
					               |	ВТ_ВБазе КАК ВТ_ВБазе
					               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВСкл КАК ВТ_ВСкл
					               |		ПО ВТ_ВБазе.id_tov = ВТ_ВСкл.id_tov
					               |			И ВТ_ВБазе.shopno_rep = ВТ_ВСкл.shopno_rep
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	ВидОперации УБЫВ
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |УНИЧТОЖИТЬ ВТ_ВСкл
					               |;
					               |
					               |////////////////////////////////////////////////////////////////////////////////
					               |УНИЧТОЖИТЬ ВТ_ВБазе";
								   
					Выборка = Запрос.Выполнить().Выбрать();
					СтрЗапросТовары = "";
					Пока Выборка.Следующий() Цикл
						Если Выборка.ВидОперации = 0 Тогда
							СтрЗапросТовары = СтрЗапросТовары + ?(ЗначениеЗаполнено(СтрЗапросТовары), Символы.ПС, "")
									+ "INSERT INTO [SMS_REPL].[dbo].[Zakaz_D_t]
										 |	  ([N_zakaz]
										 |	  ,[id_tov]
										 |	  ,[kolvo]
										 |	  ,[price]
										 |	  ,[shopno_rep])
										 |VALUES 
										 |(" + ВнешниеДанные.ФорматПоля(НомерЧислом) //N_zakaz
										+ "," + ВнешниеДанные.ФорматПоля(Выборка.id_tovВБазе) //id_tov
										+ "," + ВнешниеДанные.ФорматПоля(Выборка.КоличествоВБазе) //kolvo
										+ "," + ВнешниеДанные.ФорматПоля(?(Выборка.КоличествоВБазе = 0, 0, Выборка.СуммаВБазе / Выборка.КоличествоВБазе)) //price
										+ "," + ВнешниеДанные.ФорматПоля(Выборка.shopno_repВБазе) //shopno_rep
										+ ")";
						ИначеЕсли Выборка.ВидОперации = 2 Тогда
							СтрЗапросТовары = СтрЗапросТовары + ?(ЗначениеЗаполнено(СтрЗапросТовары), Символы.ПС, "")
									+ "UPDATE [SMS_REPL].[dbo].[Zakaz_D_t]
										 |SET [id_tov] = " + ВнешниеДанные.ФорматПоля(Выборка.id_tovВБазе) + "
										 |	  ,[kolvo] = " + ВнешниеДанные.ФорматПоля(Выборка.КоличествоВБазе) + "
										 |	  ,[price] = " + ВнешниеДанные.ФорматПоля(?(Выборка.КоличествоВБазе = 0, 0, Выборка.СуммаВБазе / Выборка.КоличествоВБазе)) + "
										 |	  ,[shopno_rep] = " + Выборка.shopno_repВБазе + "
										 |WHERE Zakaz_D_t.N_zakaz = " + ВнешниеДанные.ФорматПоля(НомерЧислом) + " and Zakaz_D_t.row_rep = " + ВнешниеДанные.ФорматПоля(Выборка.row_repВСкл);
						ИначеЕсли Выборка.ВидОперации = 1 Тогда
							СтрЗапросТовары = СтрЗапросТовары + ?(ЗначениеЗаполнено(СтрЗапросТовары), Символы.ПС, "")
									+ "DELETE FROM [SMS_REPL].[dbo].[Zakaz_D_t]
										 |WHERE Zakaz_D_t.N_zakaz = " + ВнешниеДанные.ФорматПоля(НомерЧислом) + " and Zakaz_D_t.row_rep = " + ВнешниеДанные.ФорматПоля(Выборка.row_repВСкл);				 
														
						КонецЕсли;	
					КонецЦикла;	
								   
					ADOСоединение.Execute("Begin Transaction" + Символы.ПС + СтрЗапросШапка + Символы.ПС
						+ СтрЗапросТовары 
						+ Символы.ПС + "Commit");
					ADOСоединение.Close();	
				КонецЕсли;				
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
