
Функция ПолучитьАналогТовара(мТовар)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", мТовар);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АналогиНоменклатурыТовары.Ссылка
	|ИЗ
	|	Справочник.АналогиНоменклатуры.Товары КАК АналогиНоменклатурыТовары
	|ГДЕ
	|	АналогиНоменклатурыТовары.Номенклатура = &Номенклатура
	|	И НЕ АналогиНоменклатурыТовары.Ссылка.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.АналогиНоменклатуры.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	
	Если ЭтаФорма.Товар.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекАналог = ПолучитьАналогТовара(ЭтаФорма.Товар);
	
	ОтборНаФорме = ЭтаФорма.Список.Отбор;
	ПолеКомпоновкиСсылка 		= ОтборНаФорме.ДоступныеПоляОтбора.Элементы.Найти("Ссылка").Поле;
	Если ОтборНаФорме.Элементы.Количество() = 0 Тогда
		ЭлементОтбора = ОтборНаФорме.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= ПолеКомпоновкиСсылка;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ТекАналог;
	Иначе
		Для Каждого ЭлементОтбора Из ОтборНаФорме.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
				ЭлементОтбора.Использование 	= Истина;
				ЭлементОтбора.ПравоеЗначение 	= ТекАналог;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборНаФорме = ЭтаФорма.Список.Отбор;
	ПолеКомпоновкиСсылка = ОтборНаФорме.ДоступныеПоляОтбора.Элементы.Найти("Ссылка").Поле;
	Для Каждого ЭлементОтбора Из ОтборНаФорме.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
