
#Если Клиент Тогда
	
Процедура ФормаФизическогоЛицаПередОткрытием(Форма, ДополнительныеДействия) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ФормаФизическогоЛицаПередОткрытием

Процедура ФормаФизическогоЛицаПриОткрытии(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ФормаФизическогоЛицаПриОткрытии

Процедура ФормаФизическогоЛицаДополнительныеДействия(Элемент, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ВыполнитьДополнительныеДействия

Процедура ФормаФизическогоЛицаОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры // ФормаФизическогоЛицаОбработкаОповещения

#КонецЕсли

Функция КодДоступаФизлицаПоКоду(Код) Экспорт
	КонтрольнаяСумма = 0;

	Для Сч = 1 По СтрДлина(Код) Цикл
		КонтрольнаяСумма = КонтрольнаяСумма  + Сред(Код, Сч, 1);
	КонецЦикла;

	КодДоступа = Формат(Число(Код), "ЧГ=") + Прав(Формат(КонтрольнаяСумма, "ЧЦ=3; ЧВН=; ЧГ="), 2);
	Возврат КодДоступа;
КонецФункции	