
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "ДополнительнаяОбработка 8.2.");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	
	//ДополнительнаяОбработка
	//ДополнительныйОтчет
	//ЗаполнениеОбъекта
	//Отчет
	//ПечатанаяФорма
	//СозданиеСвязанныхОбъектов
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	РегистрационныеДанные.Вставить("Информация", "Акт сверки и заказы");
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "Акт сверки и заказы";
	строкаКоманды.Представление = "Акт сверки и заказы";
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
	
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	////////////// назначение (в каких объектах используется) /////////////////////////
	//для печ.форм, заполнения, ввода свазанных объектов
	//МассивНазначений = Новый Массив;
	//МассивНазначений.Добавить("Документ.*"); // все документы назначаются
	//МассивНазначений.Добавить("Документ.АвансовыйОтчет");
	//МассивНазначений.Добавить("Документ.ЗаказПокупателя");
	//РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьПрокси(СообщениеОбОшибке = "") Экспорт
	
	Адрес =  "http://85.21.77.93/IzbenkaFin//ws/MutualSettlements?wsdl";
	ЛогинВС="ObmenMP";		
	ПарольВС="666";	
	Попытка
		Определения = Новый WSОпределения(Адрес, ЛогинВС, ПарольВС);
		Прокси = Новый WSПрокси(Определения, "MutualSettlements", "MutualSettlements", "MutualSettlementsSoap");
		Прокси.Пользователь = ЛогинВС;
		Прокси.Пароль = ПарольВС;
		Возврат Прокси;
	Исключение
	КонецПопытки;

	Адрес = "http://213.79.84.245/IzbenkaFin/ws/MutualSettlements?wsdl";
	
	Попытка
		Определения = Новый WSОпределения(Адрес, ЛогинВС, ПарольВС);
		Прокси = Новый WSПрокси(Определения, "MutualSettlements", "MutualSettlements", "MutualSettlementsSoap");
		Прокси.Пользователь = ЛогинВС;
		Прокси.Пароль = ПарольВС;
		Возврат Прокси;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
		Инфо = ИнформацияОбОшибке();
		Описание = Инфо.Причина.Описание;
		Если Найти(Описание, "При создании описания сервиса произошла ошибка")
			ИЛИ Найти(Описание, "Ошибка HTTP") Тогда
			СообщениеОбОшибке = НСтр("ru='По указанному адресу сервис недоступен.';en='The service is not available.'");
		Иначе
			СообщениеОбОшибке = Инфо.Причина.Описание;
			Сообщить(СообщениеОбОшибке);
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции // ПолучитьПрокси()

 