
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтборДок") Тогда
		Док=Параметры.ОтборДок;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииСервер();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер()
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение=Док;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование=Истина;
	//ОбъектОтчета=РеквизитФормыВЗначение("Отчет");
	СкомпоноватьРезультат();
	//ЗначениеВРеквизитФормы(ОбъектОтчета,"Отчет");
КонецПроцедуры
