
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СтруктураВозврата = Новый Структура("Номенклатура, Характеристика, НоменклатураКопия, ХарактеристикаКопия, ХарактеристикаИД, ХарактеристикаИДКопия",
	ТекущиеДанные.Номенклатура,ТекущиеДанные.Характеристика, ТекущиеДанные.НоменклатураКопия,ТекущиеДанные.ХарактеристикаКопия, ТекущиеДанные.ХарактеристикаИД,ТекущиеДанные.ХарактеристикаИДКопия);
	
	ЗаполнитьНаименованияСервер(СтруктураВозврата);
	
	Этаформа.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованияСервер(СтруктураВозврата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец.Наименование КАК Наименование,
	|	ХарактеристикиНоменклатуры.Владелец.НаименованиеПолное КАК НаименованиеПолное,
	|	ХарактеристикиНоменклатуры.Владелец.НаименованиеДляСМС КАК НаименованиеКраткое,
	|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХр
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Ссылка = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", СтруктураВозврата.Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураВозврата.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
			СтруктураВозврата.Вставить("НаименованиеПолное", ВыборкаДетальныеЗаписи.НаименованиеПолное);
			СтруктураВозврата.Вставить("НаименованиеКраткое", ВыборкаДетальныеЗаписи.НаименованиеКраткое);
			СтруктураВозврата.Вставить("НаименованиеХр", ВыборкаДетальныеЗаписи.НаименованиеХр);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
