
// форма с возможностью установки фильтра по полям открываемого списка, в параметрых должна быть структура отбор, с перечнем полей и значений отбора

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		Для каждого ПараметрОтбора Из Параметры.Отбор Цикл
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрОтбора.Ключ);
			ЭлементОтбора.ПравоеЗначение = ПараметрОтбора.Значение;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры
