
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабДок = ПолучитьТабличныйДокумент();

	ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	ТабДок.РазмерКолонтитулаСнизу	= 0;
	ТабДок.РазмерКолонтитулаСверху 	= 0;
	ТабДок.ПолеСверху 	= 5;
	ТабДок.ПолеСнизу 	= 5;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.АвтоМасштаб	= Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокумент()
	Возврат Отчеты.ЛистУчетаСклада.ПолучитьОтчет(ТаблицаСкладов.Выгрузить().ВыгрузитьКолонку("Склад"),Отчет.ДатаОтчета);
КонецФункции