
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КартинкаСсылка") Тогда
		АдресФото = Параметры.КартинкаСсылка;
	КонецЕсли;
	
	Элементы.Комментарий.Видимость = Параметры.Свойство("Комментарий");	
	
	Если Параметры.Свойство("Комментарий") Тогда
		Комментарий = Параметры.Комментарий;
	КонецЕсли;
	
	//Элементы.АдресФото.РазмерКартинки = РазмерКартинки.Пропорционально;
	
КонецПроцедуры

&НаКлиенте
Процедура РеальныйРазмер(Команда)
	
	Элементы.ФормаРеальныйРазмер.Пометка = НЕ Элементы.ФормаРеальныйРазмер.Пометка;
	
	Если Элементы.ФормаРеальныйРазмер.Пометка Тогда
		Элементы.Фото.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	Иначе
		Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	КонецЕсли; 
	
КонецПроцедуры
