
&НаСервере
Процедура ОтправитьНаСервере()
	ОсновнойМодуль = Обработки.КонтурEDI.Создать(); 
	ОсновнойМодуль.ИнициализироватьПодключаемыеМодули();
	Сообщение = ОсновнойМодуль.ПодготовитьИсходящееСообщение("PORDERS", Объект.Ссылка);  
	Если НЕ (Сообщение.СодержитОшибки = Истина) Тогда
		ПараметрыОтправки = Новый Структура();
		ПараметрыОтправки.Вставить("ОтправитьСообщениеИзФормы",	Истина);
		ПараметрыОтправки.Вставить("Сообщение",	Сообщение);
		ОсновнойМодуль.ОтправитьСообщение("PORDERS",Объект.Ссылка,ПараметрыОтправки);
		ОсновнойМодуль.Сообщить_КонтурEDI("Создано тестовое сообщение: PORDERS");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры
