
&НаКлиенте
Процедура ВыполнитьПересчетСебестоимостиИЗакрытиеМесяца(Команда)
	
	МесяцЗакрытия = НачалоМесяца(ТекущаяДата());
	Если ВвестиДату(МесяцЗакрытия, "Введите дату начала месяца расчета", ЧастиДаты.Дата) Тогда
		ДатаЗапрета = НастройкаПравДоступа.ПолучитьОбщуюДатуЗапретаДляПользователя();
		Если ДатаЗапрета >= МесяцЗакрытия Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Редактирование данных этого периода запрещено. Изменения не могут быть записаны...";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
		РегламентныеЗаданияСервер.ПересчитатьСебестоимостьВПроводках(НачалоМесяца(МесяцЗакрытия));
	КонецЕсли;	
	
КонецПроцедуры
