Перем СписокНомеровТТ;

//+++АК VERT 2018.08.14 Без номера, временная обработка, чтобы руками не делать
Процедура УстановитьПризнак(Флаг) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ЭлементМассива Из СписокНомеровТТ Цикл 
		СсылкаНаэлемент = Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("НомерТочки", ЭлементМассива);
		Если Не СсылкаНаэлемент.Пустая() Тогда 
			ОбъектЭлемент = СсылкаНаэлемент.ПолучитьОбъект();
			ОбъектЭлемент.НеУчаствуетВРаспределении = Флаг;
			ОбъектЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

СписокНомеровТТ = Новый Массив;
СписокНомеровТТ.Добавить(1600);
СписокНомеровТТ.Добавить(1674);
СписокНомеровТТ.Добавить(1707);
СписокНомеровТТ.Добавить(1726);
СписокНомеровТТ.Добавить(1749);
СписокНомеровТТ.Добавить(1789);