
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СразуСформироватьОтчет = Параметры.СразуСформироватьОтчет;
	Если СразуСформироватьОтчет = Истина Тогда
		НачалоПериода = Параметры.НачалоПериода;
		КонецПериода = Параметры.КонецПериода;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СразуСформироватьОтчет Тогда
		
		ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
		//ПериодПараметр2 = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("Период");
		ПараметрПериода = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).ИдентификаторПользовательскойНастройки);
		ПараметрПериода.Значение.ДатаНачала = НачалоДня(НачалоПериода);
		ПараметрПериода.Значение.ДатаОкончания = КонецДня(КонецПериода);
	    ПараметрПериода.Использование = Истина;
		
		СкомпоноватьРезультат();
	КонецЕсли;
КонецПроцедуры
