
&НаКлиенте
Процедура РедактироватьПериод(Команда)
	
	СтандартныйПериод = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = СтандартныйПериод;
	Если ДиалогРедактирования.Редактировать() Тогда
		СтандартныйПериод = ДиалогРедактирования.Период;
		Объект.ДатаНачала = СтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСервер()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьДанные(Объект.ДатаНачала, Объект.ДатаОкончания);
	
КонецПроцедуры	

Процедура РасчитатьПотериТип6()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьПотериТип6(Объект.ДатаНачала, Объект.ДатаОкончания);	
	
КонецПроцедуры

Процедура РасчитатьПотериТип1()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьПотериТип1(Объект.ДатаНачала, Объект.ДатаОкончания);	
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	РасчитатьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПотери6(Команда)
	
	РасчитатьПотериТип6();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПотери1(Команда)
	
	РасчитатьПотериТип1();
	
КонецПроцедуры
