
&НаСервере
Функция ПолучитьИПодключитьВнешнююОбработкуТоварныеОперации()
	
	Ссылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("ТоварныеОперации_Магазины");
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Ссылка.ХранилищеВнешнейОбработки.Получить());
	
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище, , Ложь);
	
	ВнешниеОбработки.Создать(ИмяОбработки);
	
	Возврат ИмяОбработки;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.МП_ЗадачаТехнолога.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	//ИмяОбработки = ПолучитьИПодключитьВнешнююОбработкуТоварныеОперации();
	//ОткрытьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма.ФормаСписка", Новый Структура("ИмяВнешнейОбработки", ИмяОбработки),, "ТД_ЖурналТовародвижения");
	//Оповестить("ЗапросНаОткрытиеТоварнойОперации", Новый Структура("ИД, КодОперацииПриСоздании", "", 411));
	
	ИмяОбработки = ПолучитьИПодключитьВнешнююОбработкуТоварныеОперации();
	Форма411 = ПолучитьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма.Форма", Новый Структура("ИД, КодОперацииПриСоздании", "", 411), , "ТД_ТоварнаяОперация");
	Если Форма411 = Неопределено Тогда Возврат; КонецЕсли;
	
	Товары411 = ЗаполнитьОбъектОперации(ПараметрКоманды, Форма411.Объект.Товары, Форма411.Объект.ТочкаПолучатель);
	КопироватьДанныеФормы(Товары411, Форма411.Объект.Товары);
	
	Форма411.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОбъектОперации(ЗадачаТехнологаСсылка, Знач ТоварыОбъекта, ТочкаПолучатель)
	
	Если ЗадачаТехнологаСсылка.ТипЗадания = Перечисления.ТипыЗаданийТехнологаМагазинам.СамовывозСМагазинов Тогда
		ТочкаПолучатель = 20;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачаТехнологаТовары.Номенклатура,
		|	ЗадачаТехнологаТовары.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ЗадачаТехнологаТовары.ДатаПроизводства,
		|	ЗадачаТехнологаТовары.Количество,
		|	ЗадачаТехнологаТовары.Сумма,
		|	ЗадачаТехнологаТовары.Цена
		|ИЗ
		|	Документ.МП_ЗадачаТехнолога.ПараметрыЗадачи КАК ЗадачаТехнологаТовары
		|ГДЕ
		|	ЗадачаТехнологаТовары.Ссылка = &Ссылка
		|	И НЕ ЗадачаТехнологаТовары.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", ЗадачаТехнологаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		НоваяСтрокаТЧ = ТоварыОбъекта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ВыборкаЗапроса);
		НоваяСтрокаТЧ.УидСтроки = Строка(Новый УникальныйИдентификатор());
		
	КонецЦикла;
	
	Возврат ТоварыОбъекта;
	
КонецФункции