////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет попытку проверку возможности вывода позиции из торговой точки //+++АК mika 2018.11.21 ИП-00020481 
//
// Параметры:
//  ТорговаяТочка  - <Тип.СправочникСсылка.ТорговаяТочка, Число> - Торговая точка
//  Номенклатура  - <Тип.СправочникСсылка.Номенклатура, Число> - Номенклатура
//  Интерактивно  - <Тип.Булево> - Признак Интерактивного вывода
//
// Возвращаемое значение:
//   <Тип.Булево>   - Признак запрета вывода
//
Функция ПроверкаПрограмногоВыводаПозицииИзАссортиментаАвто(ТорговаяТочка, Номенклатура, Интерактивно = Ложь, ТекстСообщенния = "") Экспорт
	
	Если ТипЗнч(ТорговаяТочка) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		НомерТТСтрока = Формат(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТорговаяТочка, "id_TT"),"ЧГ=0");
	Иначе
		НомерТТСтрока = Формат(НомерТТСтрока,"ЧГ=0");	
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ID_tovСтрока = Формат(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Номенклатура, "ID_tov"),"ЧГ=0");
	Иначе
		ID_tovСтрока = Формат(НомерТТСтрока,"ЧГ=0");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТТСтрока) И ЗначениеЗаполнено(ID_tovСтрока) Тогда
		
		ТаблицаАссортимента = Обработки.УстановкаТоварныхОграничений_Магазины.ПолучитьТаблицуЗапрещенныхКВыводуИзАссортиментаПозиций(НомерТТСтрока, ID_tovСтрока);		
		
		СтрокаУведомления = "";
		
		Для каждого Строка ИЗ ТаблицаАссортимента Цикл
			СтрокаУведомления = СтрокаУведомления + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ID магазина: %1 Номенклатура: %2 Статус: %3", Строка.id_TT, Строка.Номенклатура, Строка.СтатусСтрока)  + Символы.ПС;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаУведомления) Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекстСообщенния) Тогда
				ТекстСообщенния = "Запрещено выводить товары по которым ассортимент управляется автоматически: ";
			КонецЕсли;
			
			Если Интерактивно Тогда
				СтрокаУведомления = ТекстСообщенния + Символы.ПС + СтрокаУведомления;
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаУведомления);
			Иначе
				Попытка
					ФайлРегистрации = Новый ЗаписьТекста("\\10.0.0.51\1c$\WordToHTML_Аттестация\LogFile.txt", КодировкаТекста.ANSI, , Истина);
					ФайлРегистрации.Записать(Строка(ТекущаяДата()) + " попытка програмного вывода: " + ТекстСообщенния + СтрокаУведомления + Символы.ПФ);
					ФайлРегистрации.Закрыть();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции //ПроверкаПрограмногоВыводаПозицииИзАссортиментаАвто()