
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ГруппаОтборПриИзменении(Неопределено);
	//+++АК SHEP 20160421: добавил условие
	//Если ЭтаФорма.Список.Отбор.Элементы.Количество() = 0 Тогда
	//	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 		
	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");		
	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;		
	//	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.АК_ГруппыРассылки.УЕК");		
	//	ЭлементОтбора.Использование = Истина;		
	//	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;
	//---АК SHEP
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтборПриИзменении(Элемент)
	ТекОтбор = Список.Отбор.Элементы;
	ТекОтбор.Очистить();
	Если ЗначениеЗаполнено(Группа) Тогда
		УсловиеОтбора = ТекОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");
		УсловиеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		УсловиеОтбора.ПравоеЗначение = Группа;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Группы")Тогда
		Для Каждого мГруппа из Параметры.Группы Цикл
			Элементы.ГруппаОтбор.СписокВыбора.Добавить(мГруппа);
		КонецЦикла;
		Группа = Параметры.Группы[0];
	Иначе
		Элементы.ГруппаОтбор.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
КонецПроцедуры
