
Функция ЗаполнитьХМТЛ(ИдентификаторРаботы,ТаблицаФотографий) Экспорт
	ПерезаполнитьТаблицуФотографий(ИдентификаторРаботы,ТаблицаФотографий);
	ИндексСтрокиКартики = 0;	
	ПолныйТекстHTML = "
	|<html><body>
	|<table name = ""PictView"" scroling = ""no"">";	
	Для Каждого стр из ТаблицаФотографий Цикл
		ПолныйТекстHTML = ПолныйТекстHTML + "
		|<tr>";
		ИмяФайла = стр.ПутьКФайлу;
		ПолныйТекстHTML = ПолныйТекстHTML+ "
		|<td><table id=""" + ИндексСтрокиКартики + "_T" + """ border=""2"" cellpadding=""0"" bordercolor=#ffffff cellspacing=""0""><tr><td><img name=""picture"" width = 150 height=150 style = ""cursor: pointer"" id = """  + ИндексСтрокиКартики  + """ src = ""file:///" + СтрЗаменить(ИмяФайла, "\", "/") + """></td></tr></table></td>";	
		ПолныйТекстHTML = ПолныйТекстHTML + "
		|</tr>";
		ИндексСтрокиКартики = ИндексСтрокиКартики + 1;
	КонецЦикла;		
	ПолныйТекстHTML = ПолныйТекстHTML + "</body></html>";
	возврат ПолныйТекстHTML;
КонецФункции

Процедура ПерезаполнитьТаблицуФотографий(ИдентификаторРаботы,ТаблицаФотографий)
	ТаблицаФотографий.Очистить();
	КаталогХраненияФайловКартинок = Константы.МП_КаталогХраненияФайловЗадачМП.Получить();
	Если Прав(КаталогХраненияФайловКартинок, 1) <> "\" Тогда
		КаталогХраненияФайловКартинок = КаталогХраненияФайловКартинок + "\";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрикрепленныеФотоКОбъектам.ОтносительноеИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.ПрикрепленныеФотоКОбъектам КАК ПрикрепленныеФотоКОбъектам
	|ГДЕ
	|	ПрикрепленныеФотоКОбъектам.Объект = &УИН
	|	И ПрикрепленныеФотоКОбъектам.ТипЗаписи = ЗНАЧЕНИЕ(перечисление.ТипыЗаписейПриложенныхКартинок.РегламентнаяРабота)";
	Запрос.УстановитьПараметр("УИН",строка(ИдентификаторРаботы));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Файл = Новый Файл(КаталогХраненияФайловКартинок+Выборка.ИмяФайла);
		Если не Файл.Существует() Тогда 
		иначе
			стр = ТаблицаФотографий.Добавить();
			стр.ПутьКФайлу = КаталогХраненияФайловКартинок + Выборка.ИмяФайла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура НаписатьПисьмоЗаявкеОшибка(Объект) Экспорт

	СписокОбъектов = Новый СписокЗначений;
	
	Если ТипЗнч(Объект) = Тип("СписокЗначений") Тогда
		СписокОбъектов = Объект.Скопировать();
	Иначе
		СписокОбъектов.Добавить(Объект);
	КонецЕсли; 
	
	
	СтруктураНовогоПисьма = Новый Структура;
	СтруктураНовогоПисьма.Вставить("Основание", Объект);
	СтруктураНовогоПисьма.Вставить("Тема", "В заявке на внеплановое обслуживание № " + Строка(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " ОШИБКА");
	СтруктураНовогоПисьма.Вставить("ЗаявкаКандидата", Объект.Автор);
	СтруктураНовогоПисьма.Вставить("Тело", "В заявке на внеплановое обслуживание № " + Строка(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " ОШИБКА" + Символы.ПС+ Символы.ПС + "Ответственный: " + Объект.Автор
	+ Символы.ПС+ " Контрагент: " + Объект.Контрагент + Символы.ПС+ " Услуга: " + Объект.Услуга + Символы.ПС+ " Торговая точка: " + Объект.ТорговаяТочка);
	
	СписокКому = Новый СписокЗначений;
	
	Для каждого СтрокаСпискаОбъектов Из СписокОбъектов Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
		
		Запрос.УстановитьПараметр("Объект", СтрокаСпискаОбъектов.Значение.Автор);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Адрес = Выборка.Представление;
		КонецЕсли;                        			
		
		Если НЕ ПустаяСтрока(Адрес) Тогда
			СписокКому.Добавить(Адрес, Адрес);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураНовогоПисьма.Вставить("Кому", СписокКому);
	СтруктураНовогоПисьма.Вставить("Основание", Объект);
	
	СтруктураВозврата = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураНовогоПисьма,,, (НЕ ПустаяСтрока(Адрес)), "Отправить",,, Истина);
	
	СоответствиеПисем = Новый Соответствие();
	
	СсылкаНаПисьмо = СтруктураВозврата.ПисьмоСсылка;
	
	ТекстОшибок = "";
		
КонецПроцедуры


