
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Попытка	
		Если КомпоновщикНастроек.Настройки.Структура.Количество()>0 И КомпоновщикНастроек.Настройки.Структура[0].ИдентификаторОбъекта = "РасходникиБезИнкассации" Тогда
			Возврат;
		КонецЕсли;	
	Исключение
		
	КонецПопытки;	
	
	ДатаНач = Дата(1,1,1);
	ДатаКон = Дата(1,1,1);
	
	//+++АК POZM 2018.09.11 ИП-00018684.01 
	
	ДанныеФайлов.Очистить();
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		//ВыбФайл = Новый Файл(ИмяФайла);
		ПрочитатьФайл(ИмяФайла);
	КонецЕсли;
	
	Для каждого Стр  Из Файлы Цикл
		
		//ВыбФайл = Новый Файл(Стр.ПутьКФайлу);
		ПрочитатьФайл(Стр.ПутьКФайлу);
		
	КонецЦикла; 
	
	/// отчет
	СтандартнаяОбработка = Ложь;
	//	//Получаем схему из макета
	//СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если Поступления.Количество() > 0 Тогда
		МассДок = Поступления.ВыгрузитьКолонку("Поступление");
		СхемаКомпоновкиДанных.Параметры.ДокПост.Значение = МассДок;
		СхемаКомпоновкиДанных.Параметры.ПоПоступлениям.Значение = Истина;
	Иначе
		СхемаКомпоновкиДанных.Параметры.ДокПост.Значение = ЭтотОбъект.СопоставляемыйДокумент;
		Если ЗначениеЗаполнено(ЭтотОбъект.СопоставляемыйДокумент) Тогда
			СхемаКомпоновкиДанных.Параметры.ПоПоступлениям.Значение = Истина;
		Иначе
			СхемаКомпоновкиДанных.Параметры.ПоПоступлениям.Значение = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	СхемаКомпоновкиДанных.Параметры.ПериодВыборкиПоступлений.Значение.ДатаНачала = ДатаНач;
	СхемаКомпоновкиДанных.Параметры.ПериодВыборкиПоступлений.Значение.ДатаОкончания = КонецДня(ДатаКон);
	СхемаКомпоновкиДанных.Параметры.ДатаНач.Значение = ДатаНач;
	СхемаКомпоновкиДанных.Параметры.ДатаКон.Значение = КонецДня(ДатаКон);
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных=Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ДанныеФайлов",ЭтотОбъект.ДанныеФайлов.Выгрузить());										
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
	ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Процедура ПрочитатьФайл(ИмяФайлаФ)
	ДатаНач = ТекущаяДата();
	ДатаКон = Дата(1,1,1);

	Если НРег(Прав(ИмяФайлаФ,3)) = "txt" Тогда
		текст=Новый ТекстовыйДокумент;
		Текст.Прочитать(ИмяФайлаФ);
		
		ВсегоСтрок = Текст.КоличествоСтрок();
		
		НомерПервойСтроки=15;
		Назначение = "";
		НоваяСтрока = "";
		Для Счетчик = НомерПервойСтроки По ВсегоСтрок Цикл
			Строка=Текст.ПолучитьСтроку(Счетчик);
			СтрМасс=ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка, "¦");
			Если СтрМасс.Количество()=9 ИЛИ Счетчик + 5 = ВсегоСтрок Тогда   //+++АК LAGP 2018.02.15 ИП-00017210 Добавил "ИЛИ Счетчик + 5 = ВсегоСтрок", без этого не берет в расчёт я/к, если она в конце файла.
				/// заполнение остального в предыдущей строке
				//сумка №   26375808  для, (инкассация   28.04.2017 )
				Если Назначение <> "" И НЕ ТипЗнч(НоваяСтрока) = Тип("Строка") Тогда
					Если ЗначениеЗаполнено(НоваяСтрока) Тогда
						НоваяСтрока.НазначениеПлатежа = СокрЛП(СтрЗаменить(Назначение, "¦", ""));
					КонецЕсли;	
					Назначение = СтрЗаменить(Назначение,"¦","");
					Назначение = СтрЗаменить(Назначение," ","");
					ПозицияСумка = Найти(НРег(Назначение),"сумка№");
					
					//+++АК LAGP 2017.11.16 ИП-00017210 Сдача инкассации через банкомат
					ПозицияЯК1	 = Найти(НРег(Назначение),"я/к"); 
					ПозицияЯК2	 = Найти(НРег(Назначение),"я.к.");
					ПозицияЯК3 	 = ?(ПозицияЯК1 + ПозицияЯК2 > 0, 0, Найти(НРег(Назначение),"як"));
					Если ПозицияЯК3 > 0 Тогда
						ПоследнееВхождениеЯК = Ложь;
						Пока НЕ ПоследнееВхождениеЯК Цикл //продолжим поиск
							СледующаяПозицияЯК = Найти(НРег(Прав(Назначение, СтрДлина(Назначение) - ПозицияЯК3)),"як");
							Если СледующаяПозицияЯК > 0 Тогда
								ПозицияЯК3 = ПозицияЯК3 + СледующаяПозицияЯК;
							Иначе
								ПоследнееВхождениеЯК = Истина;
							КонецЕсли; 	 						
						КонецЦикла;
					КонецЕсли;		
					
					ПозицияЯК 	 = ПозицияЯК1 + ПозицияЯК2 + ПозицияЯК3;
					Понеслась 	 = Ложь;
					Если ПозицияЯК > 0 Тогда
						СтрокаНомерЯК = "";
						СтрокаПроверки = Прав(Назначение, СтрДлина(Назначение) - ПозицияЯК);
						Для Ном = 1 По СтрДлина(СтрокаПроверки) Цикл
							КодСимвола = КодСимвола(Сред(СтрокаПроверки, Ном, 1));
							ЦифраВНомерЯК = Сред(СтрокаПроверки, Ном, 1);
							Если КодСимвола >= 48 И КодСимвола <= 57 Тогда
								СтрокаНомерЯК = СтрокаНомерЯК + ЦифраВНомерЯК;
								Понеслась = Истина;
							ИначеЕсли Понеслась Тогда
								Прервать;
							КонецЕсли;	
						КонецЦикла;	
						НоваяСтрока.НомерСумки = СокрЛП(СтрокаНомерЯК);
					КонецЕсли;	
					//---АК LAGP
					
					Если ПозицияСумка>0 Тогда
						ПозицияДля = Найти(Назначение,"длязачисле");
						Если ПозицияДля<>0 Тогда
							НомерСумки = Сред(Назначение,ПозицияСумка+6,ПозицияДля-ПозицияСумка-6);
							Пока Лев(НомерСумки,1)="0" И СтрДлина(НомерСумки)>0 Цикл
								НомерСумки = Прав(НомерСумки,СтрДлина(НомерСумки)-1);
							КонецЦикла;	
							НоваяСтрока.НомерСумки = СокрЛП(НомерСумки);
						КонецЕсли;		
					КонецЕсли;
					ПозицияНач = Найти(НРег(Назначение),"(инкассация");
					Если ПозицияНач>0 Тогда
						ПозицияКон = Найти(НРег(Назначение),")общество");
						Если ПозицияКон<>0 Тогда
							ДатаИнкассации = СокрЛП(Сред(Назначение,ПозицияНач+11,ПозицияКон-ПозицияНач-11));
							НоваяСтрока.ДатаИнкассации = Дата(Число(Прав(ДатаИнкассации,4)),Число(Сред(ДатаИнкассации,4,2)),Число(Лев(ДатаИнкассации,2)));
							ДатаНач = Мин(ДатаНач,НоваяСтрока.ДатаИнкассации);
							ДатаКон = Макс(ДатаКон,НоваяСтрока.ДатаИнкассации);
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
				
				Попытка
					Если Число(СтрМасс[7])=0 Тогда
						Продолжить;
					КонецЕсли;	
					НоваяСтрока = ДанныеФайлов.Добавить();
					НоваяСтрока.Дата = Дата(Число("20"+Прав(СтрМасс[1],2)),Число(Сред(СтрМасс[1],4,2)),Число(Лев(СтрМасс[1],2)));
					НоваяСтрока.ОборотДт = СтрМасс[6];
					НоваяСтрока.ОборотКт = СтрМасс[7];
					НоваяСтрока.Сумма = СтрМасс[7];
					НоваяСтрока.НомерДок = СтрМасс[3];
					ДатаНач = Мин(ДатаНач,НоваяСтрока.Дата);
					ДатаКон = Макс(ДатаКон,НоваяСтрока.Дата);
					Назначение = "";
				Исключение
					
				КонецПопытки;
			Иначе
				Назначение = Назначение + Строка;
			КонецЕсли;	
			
		КонецЦикла;
		НоваяСтрока.НазначениеПлатежа = СокрЛП(СтрЗаменить(Назначение, "¦", ""));
	//+++АК POZM 2018.09.11 ИП-00018684.01 
	ИначеЕсли НРег(Прав(ИмяФайлаФ,3)) = "xls" ИЛИ НРег(Прав(ИмяФайлаФ,4)) = "xlsx" Тогда
		ТЗ=ПрочитатьЛистExcel(ИмяФайлаФ,2);
		й=0;
		Пока й<=ТЗ.Количество()-1 Цикл	
			
			
			ДатаСтрокой = ТЗ[й][0];
			Если НЕ ЗначениеЗаполнено(ДатаСтрокой) Тогда
				Прервать;
			КонецЕсли;	
			НоваяСтрока = ДанныеФайлов.Добавить();
					
			НоваяСтрока.Дата = Дата(Число("20"+Прав(ДатаСтрокой,2)),Число(Сред(ДатаСтрокой,4,2)),Число(Лев(ДатаСтрокой,2)));
			ДатаНач = Мин(ДатаНач,НоваяСтрока.Дата);
			ДатаКон = Макс(ДатаКон,НоваяСтрока.Дата);
			НоваяСтрока.ДатаИнкассации = НоваяСтрока.Дата;
			НоваяСтрока.НазначениеПлатежа = ТЗ[й][6];
			НоваяСтрока.НомерДок = ТЗ[й][1];
			
			НоваяСтрока.ОборотДт = Число(ТЗ[й][4]);
			НоваяСтрока.ОборотКт = Число(ТЗ[й][5]);
			НоваяСтрока.Сумма = НоваяСтрока.ОборотКт;
							
			НоваяСтрока.НомерСумки = "";
						
			Назначение = СокрЛП(СтрЗаменить(НоваяСтрока.НазначениеПлатежа,"¦",""));
			Симв = Лев(Назначение,1);
			Пока Найти("1234567890",Симв)> 0 И СтрДлина(Назначение) > 0 Цикл
				
				НоваяСтрока.НомерСумки = НоваяСтрока.НомерСумки + Симв;
				Назначение = Сред(Назначение,2);
				Симв = Лев(Назначение,1);
			КонецЦикла;	
			
			й = й + 1;
		КонецЦикла;	
	Иначе
		Сообщить("Неизвестный формат файла "+ИмяФайлаФ);
	КонецЕсли;	
	//---АК POZM 
КонецПроцедуры	

Функция ПрочитатьЛистExcel( ИмяФайлаФ, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт
	
	ТЗ = Неопределено;	
	
	Excel = Новый COMОбъект("Excel.Application");
	Excel.WorkBooks.Open(ИмяФайлаФ);
	
	ЛистЭксель = Excel.Sheets(1);
	Если ВсегоСтрок = 0 Тогда
		ВсегоСтрок = ЛистЭксель.Cells.SpecialCells(11).Row;
	КонецЕсли;
	Если ВсегоКолонок = 0 Тогда
		ВсегоКолонок = ЛистЭксель.Cells.SpecialCells(11).Column;
	КонецЕсли;
	Если ТЗ = Неопределено Тогда
		ТЗ =  Новый ТаблицаЗначений;
		Для Счетчик = 1 По ВсегоКолонок Цикл
			ТЗ.Колонки.Добавить("Колонка"+Счетчик, Новый ОписаниеТипов("Строка"));
		КонецЦикла;
	КонецЕсли;
	
	Для Счетчик = НомерПервойСтроки По ВсегоСтрок Цикл
		НоваяСтрока = ТЗ.Добавить();
	КонецЦикла;
	
	Область = ЛистЭксель.Range(ЛистЭксель.Cells(НомерПервойСтроки,НомерПервойКолонки), ЛистЭксель.Cells(ВсегоСтрок,ВсегоКолонок));
	ДанныеТЗ = Область.Value.Выгрузить();
	
	Для Счетчик = 0 По ВсегоКолонок-1 Цикл
		ТЗ.ЗагрузитьКолонку(ДанныеТЗ[Счетчик], Счетчик);
	КонецЦикла;
	ЛистЭксель = Неопределено;
	Excel.WorkBooks.Close();
	Excel = 0;
	Возврат ТЗ;
	
КонецФункции
