
Процедура ВыполнитьВозвратНаСервере(ВариантВыполнения)
	
	id_kontr = 0;
	Если ЗначениеЗаполнено(Объект.Характеристика) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК Справочник.Контрагенты).ИД КАК ИД
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель)";
		
		Запрос.УстановитьПараметр("Объект", Объект.Характеристика);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			id_kontr = Выборка.ИД;
		КонецЕсли;	
	КонецЕсли;	
	
	ADOСоединение = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionTimeOut = 0;
	ADOСоединение.CommandTimeOut    = 0;
	
	СтрСоедиение = ОбменСAccess.ПолучитьСтрокуСоединения("sms_izbenka");
	
	ADOСоединение.ConnectionString  = СтрСоедиение;
	ADOСоединение.Open();
	Если ВариантВыполнения тогда
		СтрЗапрос = "exec loyalty.dbo.refund_bad_product
		|	" + ВнешниеДанные.ФорматПоля(Объект.Товар.id_tov) + ", 
		|	" + ?(ЗначениеЗаполнено(id_kontr), ВнешниеДанные.ФорматПоля(id_kontr), "null") + ",
		|	" + ВнешниеДанные.ФорматПоля(Объект.ДатаНачалаПродаж, Истина) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ДатаОкончанияПродаж, Истина) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ТекстСообщенияВСМС) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ИД, Истина)+",
		|	" + ВнешниеДанные.ФорматПоля(Объект.ПроцентВозврата/100)+",
		|	" + ВнешниеДанные.ФорматПоля(Истина);
		
		ADOСоединение.Execute(СтрЗапрос);
	Иначе
		СтрЗапрос = "create table #tempt (Телефон nvarchar(150), Сообщение nvarchar(1000))
		|
		|				insert into #tempt
		|				exec Loyalty..refund_bad_product 
		|	" + ВнешниеДанные.ФорматПоля(Объект.Товар.id_tov) + ", 
		|	" + ?(ЗначениеЗаполнено(id_kontr), ВнешниеДанные.ФорматПоля(id_kontr), "null") + ",
		|	" + ВнешниеДанные.ФорматПоля(Объект.ДатаНачалаПродаж, Истина) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ДатаОкончанияПродаж, Истина) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ТекстСообщенияВСМС) + ", 
		|	" + ВнешниеДанные.ФорматПоля(Объект.ИД, Истина)+",
		|	" + ВнешниеДанные.ФорматПоля(Объект.ПроцентВозврата/100)+",
		|	" + ВнешниеДанные.ФорматПоля(Ложь)+"
		|
		|				select t.Телефон, CAST(t.Сообщение as nvarchar(1000)) as Сообщение from #tempt as t";
		
		rs = ADOСоединение.Execute(СтрЗапрос);
		Пока rs <> Неопределено И rs.Fields.Count <= 0 Цикл
			rs=rs.NextRecordSet();
		КонецЦикла;
		
		Попытка
			rs.MoveFirst();
			
			Пока НЕ rs.EOF() Цикл
				СтрокаДоб = ЭтаФорма.ОтправленныеСМС.Добавить();
				СтрокаДоб.Номер = Rs.Fields("Телефон").Value;
				СтрокаДоб.Сообщение = Rs.Fields("Сообщение").Value;   
				rs.MoveNext();
			КонецЦикла;
			ЭтаФорма.КоличествоСМС=ЭтаФорма.ОтправленныеСМС.Количество();
		Исключение
		КонецПопытки;
	КонецЕсли;
	ADOСоединение.Close();
	ADOСоединение = Неопределено;
   	
КонецПроцедуры	

Процедура ПерезаполнитьСписокОтправленныхСМС()

ОтправленныеСМС.Очистить();	

ADOСоединение = Новый COMОбъект("ADODB.Connection");
ADOСоединение.ConnectionTimeOut = 0;
ADOСоединение.CommandTimeOut    = 0;

СтрСоедиение = ОбменСAccess.ПолучитьСтрокуСоединения("sms_izbenka");

ADOСоединение.ConnectionString  = СтрСоедиение;
ADOСоединение.Open();

СтрЗапрос = "select ou.Number, ou.Message, ou.SendDate
|from IES..Outgoing (nolock) ou
|where ou.CashCheckNo = " + ВнешниеДанные.ФорматПоля(Объект.ИД) + " and ou.CashID is null";

rs = ADOСоединение.Execute(СтрЗапрос);

Попытка
	rs.MoveFirst();
	
	Пока НЕ rs.EOF() Цикл
		СтрокаДоб = ОтправленныеСМС.Добавить();
		СтрокаДоб.Номер 		= Rs.Fields("Number").Value;
		СтрокаДоб.Сообщение 		= Rs.Fields("Message").Value;
		СтрокаДоб.ДатаОтправки 		= Rs.Fields("SendDate").Value;
		rs.MoveNext();
	КонецЦикла;
Исключение
КонецПопытки;

ADOСоединение.Close();
ЭтаФорма.КоличествоСМС=ЭтаФорма.ОтправленныеСМС.Количество();

КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьВозврат(Команда)

Если Не ЗначениеЗаполнено(Объект.Товар) Тогда
	Предупреждение("Не указан товар");
	Возврат;
КонецЕсли;	

Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПродаж) Тогда
	Предупреждение("Не указана дата начала продаж товара");
	Возврат;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияПродаж) Тогда
	Предупреждение("Не указана дата окончания продаж товара");
	Возврат;
КонецЕсли;

Если Объект.ВозвратБылВыполнен Тогда
	Ответ = Вопрос("Возврат уже был выполнен. Все равно выполнить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
Иначе
	Ответ = Вопрос("Будет выполнен возврат. Вы уверены?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
КонецЕсли;
	
Записать();

ВыполнитьВозвратНаСервере(Истина);

Объект.ВозвратБылВыполнен = Истина;
Записать();

ПерезаполнитьСписокОтправленныхСМС();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

ПерезаполнитьСписокОтправленныхСМС();

КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСМС(Команда)
Если Не ЗначениеЗаполнено(Объект.Товар) Тогда
	Предупреждение("Не указан товар");
	Возврат;
КонецЕсли;	

Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПродаж) Тогда
	Предупреждение("Не указана дата начала продаж товара");
	Возврат;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияПродаж) Тогда
	Предупреждение("Не указана дата окончания продаж товара");
	Возврат;
КонецЕсли;

Если Объект.ВозвратБылВыполнен Тогда
	Ответ = Вопрос("Возврат уже был выполнен. Все равно выполнить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
КонецЕсли;
Записать();
ЭтаФорма.ОтправленныеСМС.Очистить();
ВыполнитьВозвратНаСервере(Ложь);
КонецПроцедуры
