Перем ЭтоНовыйОбъект;

Процедура ПередЗаписью(Отказ)
	
	ЭтоНовыйОбъект = ЭтоНовый();
	
	ЕстьВложения = (Вложения.Количество() > 0);
	
	Если ПустаяСтрока(Наименование) Тогда
		ФорматДок = Новый ФорматированныйДокумент;
		ФорматДок.УстановитьHTML(ТекстСообщения, Новый Структура);
		СтрокаДляНаименования = СокрЛП(СтрЗаменить(ФорматДок.ПолучитьТекст(), Символы.ПС, " "));
		Пока Найти(СтрокаДляНаименования, "  ") > 0 Цикл
			СтрокаДляНаименования = СтрЗаменить(СтрокаДляНаименования, "  ", " ");
		КонецЦикла;
		Наименование = СтрокаДляНаименования;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// отправка сообщения
	УстановитьПривилегированныйРежим(Истина);
	
	// если нет доп. св-ва "НеОтправлять", тогда отправляем
	Если ЛОЖЬ И ЭтоНовыйОбъект И НЕ ДополнительныеСвойства.Свойство("НеОтправлять") Тогда
		ОбработкаПочтоваяРассылкаОбъект = Обработки.ПочтоваяРассылка.Создать();
		ОбработкаПочтоваяРассылкаОбъект.АдресОтправителя = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.РассылкаИнформации");
		СписокПолучателей = Получатели.ВыгрузитьКолонку("Получатель");
		Если СписокПолучателей.Найти("ТорговыеТочки") <> Неопределено Тогда
			СписокПолучателей.Добавить("Избенка");
			СписокПолучателей.Добавить("Магазины");
		КонецЕсли;
		
		Для Каждого Получатель Из СписокПолучателей Цикл
			ОбработкаПочтоваяРассылкаОбъект[Получатель] = Истина;
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ЦФО Цикл
			НоваяСтрокаТЧ = ОбработкаПочтоваяРассылкаОбъект.ЦФО.Добавить();
			НоваяСтрокаТЧ.ЦФО = СтрокаТЧ.ЦФО;
		КонецЦикла;
		
		Если Вложения.Количество() > 0 Тогда
			КаталогХраненияФайлов = Справочники.СообщенияФизЛиц.КаталогХраненияФайлов(Владелец);
			Для Каждого СтрокаТЧ Из Вложения Цикл
				ФайлДвоичныхДанных = Новый Файл(КаталогХраненияФайлов + СтрокаТЧ.ИмяФайла);
				Если НЕ ФайлДвоичныхДанных.Существует() Тогда Продолжить; КонецЕсли;
				
				НоваяСтрокаТЧ = ОбработкаПочтоваяРассылкаОбъект.ВложенныеФайлы.Добавить();
				НоваяСтрокаТЧ.ИмяФайла = СтрокаТЧ.НазваниеФайла;
				НоваяСтрокаТЧ.СсылкаНаФайл = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлДвоичныхДанных.ПолноеИмя));
			КонецЦикла;
		КонецЕсли;
		
		ОбработкаПочтоваяРассылкаОбъект.ТекАдресПользователя = "shep@automacon.ru";
		ОбработкаПочтоваяРассылкаОбъект.ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ОбработкаПочтоваяРассылкаОбъект.ЗаголовокПисьма = Наименование;
		ОбработкаПочтоваяРассылкаОбъект.ТекстПисьма = ТекстСообщения;
		ОбработкаПочтоваяРассылкаОбъект.ОтправитьПочтовыеСообщения();
		ОбработкаПочтоваяРассылкаОбъект = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры
