
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		НастройкиОбмена.Параметры.УстановитьЗначениеПараметра("Владелец",ПредопределенноеЗначение("Справочник.CMS1C_НастройкиСайтов.ПустаяСсылка"));
	Иначе
		НастройкиОбмена.Параметры.УстановитьЗначениеПараметра("Владелец",ТекДанные.Ссылка);
	КонецЕСли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокПриАктивизацииСтроки("Мир");
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбменаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	
	сп = ПолучитьСписокCMS();
	
	НачальнаяCMS = сп[0].Значение;
	
	Ф = ПолучитьФорму("Справочник.CMS1C_НастройкиСайтов.Форма.ФормаЭлемента");
	Ф.Объект.СистемаУправленияСайтом = НачальнаяCMS;
	Ф.Открыть();
	
	
КонецПроцедуры

Функция ПолучитьСписокCMS()
	сп = Новый СписокЗначений();
	
	
	
	
	Для Каждого ТекЗначениеПеречисления из Перечисления.CMS1C_СистемыУправленияСайтами Цикл
		Если Метаданные.Обработки.Найти("CMS1C_"+СокрЛП(ТекЗначениеПеречисления)+"_ОбработкаОбмена") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		сп.Добавить(ТекЗначениеПеречисления,СокрЛП(ТекЗначениеПеречисления));
	КонецЦикла;
	Возврат сп;
КонецФУнкции


&НаКлиенте
Процедура НастройкиОбменаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;	
	Отказ = Истина;
	
	СтрокаНастройкиСайта = Элементы.Список.ТекущиеДанные;
	Если СтрокаНастройкиСайта = Неопределено Тогда
		Возврат;
	Конецесли;
	
	ТекущаяНастройкаСайта = СтрокаНастройкиСайта.Ссылка;
	
	Ф =ПолучитьФорму("Справочник.CMS1C_НастройкиОбменаССайтом.ФормаОбъекта");
	Ф.Объект.Владелец = ТекущаяНастройкаСайта;
	Ф.Открыть();
КонецПроцедуры

