
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();	
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.СвойствоСотрудника.ТолькоПросмотр = ЗначениеЗаполнено(Запись.Отсутствие);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтсутствиеПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//+++АК mika 2018.11.20 ИП-00020498 
	Если ЗначениеЗаполнено(Запись.Сотрудник) Тогда
		УказанТипВахты = ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Запись.Сотрудник, "ТипВахтыВГрафике"));
		Если Запись.СвойствоСотрудника > 2 И НЕ УказанТипВахты Тогда
			ТекущийОбъект.СвойствоСотрудника  = 0;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для планирования ""вахтовых"" выходов заполните ""Тип вахты в графике""(карточка физ. лица)!",,,,Отказ);
			Возврат;
		ИначеЕсли УказанТипВахты И ЗначениеЗаполнено(Запись.Отсутствие) И Запись.СвойствоСотрудника < 3 Тогда
			ТекущийОбъект.СвойствоСотрудника  = 3;
			Возврат;
		КонецЕсли;  
	КонецЕсли;                              
	//---АК mika
	
КонецПроцедуры


