
&НаКлиенте
Процедура ДобавитьНовыйКупон(Команда)
	
	ФормаДобавления = ПолучитьФорму("Обработка.ТипыКупонов.Форма.ФормаДобавления");
	ФормаДобавления.Добавление = 1;
	ФормаДобавления.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТипКупона(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТипКупона(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ВнешниеИсточникиДанных.Loyality.РазорватьСоединение();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СтрСоединенияДанныеТовародвижение = ОбменСAccess.ПолучитьСтрокуСоединения("loyalty");
	//пСоед = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	//пСоед.СтрокаСоединения= СтрСоединенияДанныеТовародвижение;
	//ВнешниеИсточникиДанных.Loyality.УстановитьОбщиеПараметрыСоединения(пСоед);
	ВнешниеИсточникиДанных.Loyality.УстановитьСоединение();
	
КонецПроцедуры

&НаСервере
Функция СертификатыНаСервере(КодКупона)
	
	Док = Новый ТабличныйДокумент;
	Макет = Обработки.ТипыКупонов.ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Док.Вывести(Шапка);
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ВнешниеИсточникиДанных.Loyality.УстановитьСоединение();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВыданныеКупоны.number_cert,
	|	ВыданныеКупоны.number,
	|	ВыданныеКупоны.ДатаДобавления
	|ИЗ
	|	ВнешнийИсточникДанных.Loyality.Таблица.ВыданныеКупоны КАК ВыданныеКупоны
	|ГДЕ
	|	ВыданныеКупоны.ТипКупона = &ТипКупона");
	Запрос.УстановитьПараметр("ТипКупона", КодКупона);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ВнешниеИсточникиДанных.Loyality.РазорватьСоединение();
	
	Для каждого Стр Из ТЗ Цикл	
		Строка.Параметры.Заполнить(Стр);
		Док.Вывести(Строка);
	КонецЦикла; 
	
	Возврат Док;
	
КонецФункции

&НаКлиенте
Процедура Сертификаты(Команда)
	
	Если НЕ Элементы.ТаблицаКупонов.ТекущиеДанные = Неопределено Тогда
		СписокСертификатов = СертификатыНаСервере(Элементы.ТаблицаКупонов.ТекущиеДанные.Инентификатор);
		СписокСертификатов.Показать("Сертификаты вида " + Элементы.ТаблицаКупонов.ТекущиеДанные.Наименование);
	КонецЕсли;
	
КонецПроцедуры
