
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если ПровереноОператором(ПараметрКоманды) Тогда
		ТабДок = Печать(ПараметрКоманды);

		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Истина;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать();
	Иначе
		Предупреждение("Накладную ТОРГ-13 можно распечатать только после проверки оператором",);
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция Печать(ПараметрКоманды)
	Возврат Документы.ЗаявкаНаСклад.ПечатьТОРГ13(ПараметрКоманды);
КонецФункции

&НаСервере
Функция ПровереноОператором(ПараметрКоманды)
	Возврат ПараметрКоманды.ПровереноОператором;
КонецФункции