
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//ТабВыкладкиЗаблокированы = Новый ТаблицаЗначений();
	//ТабВыкладкиЗаблокированы.Колонки.Добавить("МестоВыкладки");
	//ТабВыкладкиЗаблокированы.Колонки.Добавить("id_doc");
	//ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение();
	//ТекстЗапросаSQL = "SELECT DISTINCT TD.id_vikl, CAST(TD.id_doc as nvarchar(50)) as id_doc
	//  				|FROM [SMS_REPL].[dbo].[TD_move] TD (nolock) where ShopNo_rep <> 999 and operation_type IN (300, -300) and isnull(Confirm_type, 0) = 0 and isnull(id_vikl, 0) <> 0";
	//				
	//rs = ADOСоединение.Execute(ТекстЗапросаSQL);
	//Попытка
	//	rs.MoveFirst();
	//	Пока НЕ rs.Eof() Цикл
	//		НовСтр = ТабВыкладкиЗаблокированы.Добавить();
	//		НовСтр.МестоВыкладки = Справочники.МестаВыкладки.НайтиПоРеквизиту("ИД", rs.Fields("id_vikl").Value);
	//		НовСтр.id_doc = rs.Fields("id_doc").Value;
	//		rs.MoveNext();
	//	КонецЦикла;
	//	
	//Исключение
	//КонецПопытки;
	
	//ADOСоединение.Close();
					
	ПроверяемаяНоменклатура = Новый Массив();
	Для Каждого Запись Из ЭтотОбъект Цикл
		ПроверяемаяНоменклатура.Добавить(Запись.Номенклатура);
		//СтрокаЗаблокировано = ТабВыкладкиЗаблокированы.Найти(Запись.МестоВыкладки, "МестоВыкладки");
		//Если СтрокаЗаблокировано <> Неопределено Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя записать планограмму, так как место выкладки: " + Запись.МестоВыкладки + " заблокировано инвентаризацией в магазине. Id инвентаризации: " + СтрокаЗаблокировано.id_doc,,,,Отказ);
		//КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура", ПроверяемаяНоменклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыкладкаПланограммы.Номенклатура,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыкладкаПланограммы.МестоВыкладки.ТемпературныйРежим) КАК МестоВыкладкиТемпературныйРежим
	               |ИЗ
	               |	РегистрСведений.ВыкладкаПланограммы КАК ВыкладкаПланограммы
	               |ГДЕ
	               |	ВыкладкаПланограммы.МестоВыкладки.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.ТемпературныеРежимы.ПустаяСсылка)
	               |	И ВыкладкаПланограммы.Номенклатура В(&Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыкладкаПланограммы.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыкладкаПланограммы.МестоВыкладки.ТемпературныйРежим) > 1";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя записать планограмму, так как номенклатура: " + Выборка.Номенклатура + " оказывается в разных температурных режимах в сравнении с другой планограммой",,,, Отказ);
	КонецЦикла;	
	
КонецПроцедуры

//+++АК KIRN 2018.03.07 временно для задачи ИП-00018051 
//Процедура ПередЗаписью(Отказ, Замещение)
	//Запрос = Новый Запрос;
	//Запрос.Текст = "Выбрать
	//|	т.Номенклатура,
	//|	т.Планограмма,
	//|	т.МестоВыкладки,
	//|	т.ТоварВыведен
	//|ПОМЕСТИТЬ вт_Набор
	//|ИЗ
	//|	&Набор КАК т
	//|;
	//|Выбрать 
	//|	вт.Номенклатура,
	//|	вт.Планограмма,
	//|	вт.МестоВыкладки,
	//|	вт.ТоварВыведен,
	//|	рс.ТоварВыведен КАК ТоварВыведен_было
	//|ИЗ вт_Набор КАК вт ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыкладкаПланограммы КАК рс   ПО вт.Номенклатура = рс.Номенклатура И вт.Планограмма = рс.Планограмма и вт.МестоВыкладки = рс.МестоВыкладки
	//|ГДЕ
	//|	Выбор когда рс.ТоварВыведен ЕСТЬ NULL Тогда ЛОЖЬ Иначе вт.ТоварВыведен <> рс.ТоварВыведен Конец
	//|";
	//Запрос.УстановитьПараметр("Набор", ЭтотОбъект.Выгрузить());
	//Выборка = Запрос.Выполнить().Выбрать();
	//ТекстИзвещения = "<h2> Изменены следующие записи регистра (Номенклатура|Планограмма|МестоВыкладки|ТоварВыведен): пользователем "+глЗначениеПеременной("глТекущийПользователь")+"</h2>";
	//ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	//флИзмененНабор = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	ТекстИзвещения = ТекстИзвещения + Символы.ВК+"
	//	|<H4>"+Выборка.Номенклатура+" | "+Выборка.Планограмма+" | "+Выборка.МестоВыкладки+" | "+Выборка.ТоварВыведен+" | </h4>";
	//	флИзмененНабор = Истина;
	//КонецЦикла;
	//
	//Если флИзмененНабор Тогда
	//	Почта = Новый ИнтернетПочта;
	//	УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
	//	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	//	Письмо = Новый ИнтернетПочтовоеСообщение;
	//	Почта.Подключиться(Профиль);
	//	Письмо.Тема = "Запись регистра ВыкладкаПланограммы";
	//	
	//	Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
	//	Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
	//	Получатель = Письмо.Получатели.Добавить();
	//	Получатель.Адрес           = "sp@vkusvill.ru";
	//	Получатель.ОтображаемоеИмя = "sp@vkusvill.ru";
	//	
	//	
	//	ТекстСообщения = Письмо.Тексты.Добавить();
	//	ТекстСообщения.Текст     = ТекстИзвещения;
	//	ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	//	
	//	//ТекстДокумент = Неопределено;
	//	Почта.Послать(Письмо);
	//	Почта.Отключиться();
	//КонецЕСли;
//КонецПроцедуры
//---АК KIRN 