
//+++АК SHEP 2018.10.08 ИП-00020026 
&НаКлиенте
Процедура ПерейтиКСостояниям(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	УИДРаспределения = ТекущиеДанные.УИД;
	СтруктураОтбор = Новый Структура; //("УИД", УИДРаспределения);
	ПараметрыОткрытияФормы = Новый Структура("Отбор, УИДРаспределения", СтруктураОтбор, УИДРаспределения);
	ОткрытьФорму("РегистрСведений.СостоянияРаспределенийТоваров.ФормаСписка", ПараметрыОткрытияФормы);
	
КонецПроцедуры
