
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.МП_ЗаполнениеЗадачПоШаблону.ЗаполнитьСписокМагазинов(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Шаблон) Тогда
		Предупреждение("Выберите шаблон!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере() Экспорт

	Обработки.МП_ЗаполнениеЗадачПоШаблону.СформироватьНаСервере(Объект);

КонецПроцедуры // СформироватьНаСервере()


