
Процедура СчитатьДанныеНаСервере()
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение();
	
	ТекстЗапроса =
	"SELECT TOP 1 
	|	Ch.CloseDate,
	|	Ch.CashID,
	|	Ch.Opendate,
	|	ISNULL(VZ_KolvoPoz.KolvoPoz, 0) as KolvoPoz	
	|FROM SMS_UNION..Checks (nolock) as Ch
	| LEFT OUTER JOIN
	|	(SELECT
	|		CheckUID,
	|		COUNT(CashCheckLineNo) as KolvoPoz	|	
	|	FROM SMS_UNION..CheckLine (nolock)
	|	WHERE
	|		BonusCard_cl = " + ВнешниеДанные.ФорматПоля(КартаПокупателя) + "
	|  		and date_ch = " + ВнешниеДанные.ФорматПоля(ДатаПокупки, Истина) + "
	|	GROUP BY
	|		CheckUID) as VZ_KolvoPoz
	| ON Ch.CheckUid = VZ_KolvoPoz.CheckUID
	|Where
	|	Ch.CloseDate between " + ВнешниеДанные.ФорматПоля(НачалоДня(ДатаПокупки)) + " and " + ВнешниеДанные.ФорматПоля(КонецДня(ДатаПокупки)) + "
	|  	And Ch.BONUSCARD = " + ВнешниеДанные.ФорматПоля(КартаПокупателя) + "
	|" + ?(ЗначениеЗаполнено(Магазин), " And Ch.ShopNo = " + ВнешниеДанные.ФорматПоля(Магазин.НомерТочки), "") + "
	|ORDER BY
	|	CloseDate Desc";
  
	rs = ADOСоединение.Execute(ТекстЗапроса);
	Пока rs <> Неопределено
			И rs.Fields.Count <= 0 Цикл
		rs = rs.NextRecordSet();
	КонецЦикла;
	
	Попытка
		rs.MoveFirst();
		
		Пока НЕ rs.EOF() Цикл
			CashId = Rs.Fields("CashId").Value;
			ДатаНачалаЧека 	= Rs.Fields("Opendate").Value;
			ДатаКонецЧека 	= Rs.Fields("CloseDate").Value;
			ПозицийВЧеке 	= Rs.Fields("KolvoPoz").Value;
			rs.MoveNext();
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	ТекстЗапроса =
	"SELECT TOP 5 
	|	Ch.CloseDate,
	|	Ch.CashID,
	|	Ch.Opendate,
	|	ISNULL(VZ_KolvoPoz.KolvoPoz, 0) as KolvoPoz
	|FROM SMS_UNION..Checks (nolock) as Ch
	| LEFT OUTER JOIN
	|	(SELECT
	|		CheckUID,
	|		COUNT(CashCheckLineNo) as KolvoPoz
	|	FROM SMS_UNION..CheckLine (nolock)
	|	WHERE
	|		date_ch = " + ВнешниеДанные.ФорматПоля(ДатаПокупки, Истина) + "
	|	GROUP BY
	|		CheckUID) as VZ_KolvoPoz
	| ON Ch.CheckUid = VZ_KolvoPoz.CheckUID
	|Where
	|	CloseDate < " + ВнешниеДанные.ФорматПоля(ДатаКонецЧека) + "
	|  	And Cashid = " + ВнешниеДанные.ФорматПоля(CashId) + "
	|" + ?(ЗначениеЗаполнено(Магазин), " And ShopNo = " + ВнешниеДанные.ФорматПоля(Магазин.НомерТочки), "") + "
	|ORDER BY
	|	CloseDate Desc";
				  
	rs = ADOСоединение.Execute(ТекстЗапроса);
	Пока rs <> Неопределено
			И rs.Fields.Count <= 0 Цикл
		rs = rs.NextRecordSet();
	КонецЦикла;
	
	ЧекиПередПокупателем.Очистить();
	
	Попытка
		rs.MoveFirst();
		
		Пока НЕ rs.EOF() Цикл
			СтрокаДоб = ЧекиПередПокупателем.Добавить();
			СтрокаДоб.ДатаНачалаЧека 	= Rs.Fields("Opendate").Value;
			СтрокаДоб.ДатаКонецЧека 	= Rs.Fields("CloseDate").Value;
			СтрокаДоб.ПозицийВЧеке 		= Rs.Fields("KolvoPoz").Value;
			ПродолжительностьСекунд = СтрокаДоб.ДатаКонецЧека - СтрокаДоб.ДатаНачалаЧека;
			КолвоМинут 	= Цел(ПродолжительностьСекунд / 60);
			КолвоСекунд = ПродолжительностьСекунд - КолвоМинут * 60;
			СтрокаДоб.ВремяОбслуживания 	= Строка(КолвоМинут) + " мин. " + КолвоСекунд + " сек.";
			СтрокаДоб.СекундНаОднуПозицию 	= ?(СтрокаДоб.ПозицийВЧеке = 0, 0, ПродолжительностьСекунд / СтрокаДоб.ПозицийВЧеке);
			rs.MoveNext();
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	ADOСоединение.Close();
	ADOСоединение = Неопределено;
	
	ПродолжительностьСекунд = ДатаКонецЧека - ДатаНачалаЧека;
	КолвоМинут 	= Цел(ПродолжительностьСекунд / 60);
	КолвоСекунд = ПродолжительностьСекунд - КолвоМинут * 60;
	ВремяОбслуживанияПокупателя = Строка(КолвоМинут) + " мин. " + КолвоСекунд + " сек.";
	СекундНаОднуПозицию 		= ?(ПозицийВЧеке = 0, 0, ПродолжительностьСекунд / ПозицийВЧеке);
	
КонецПроцедуры	

&НаКлиенте
Процедура СчитатьДанные(Команда)
	
	Если НЕ ЗначениеЗаполнено(КартаПокупателя) Тогда
		Сообщить("Не указана карта покупателя");
		Возврат;
	КонецЕсли;
	
	//
	СчитатьДанныеНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ДатаПокупки 		= Параметры.ДатаПокупки;
	ЭтаФорма.КартаПокупателя 	= Параметры.КартаПокупателя;
	ЭтаФорма.Магазин 			= Параметры.Магазин;
	
	//
	СчитатьДанныеНаСервере();
	
КонецПроцедуры
