&НаСервере
Функция Печать(ПараметрКоманды)
	//+++АК BELN 2018.11.06 ИП-00019252 
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Документы.РасходныйОрдерСклад.ДоступнаПечать() Тогда
		Сообщить("Нет права на печать");
		Возврат Неопределено;
	КонецЕсли; 
	//---АК BELN 2018.11.06	
	Возврат обработки.АК_ПечатьТТН.ПечатьТранспортнойНакладной(ПараметрКоманды);
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Печать(ПараметрКоманды);
  	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	ТабДок.Показать("Печать транспортной накладной");
	
КонецПроцедуры
