
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КаталогХраненияФайлов = КаталогХраненияФайлов();
	Контрагент = Параметры.Контрагент;
	ЗаполнитьТаблицу();
КонецПроцедуры

Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыРекомендаций.Период КАК ДатаДобавления,
		|	ФайлыРекомендаций.Контрагент,
		|	ФайлыРекомендаций.ОтносительноеИмяФайла,
		|	ФайлыРекомендаций.ИмяФайла,
		|	ФайлыРекомендаций.Пользователь,
		|	ФайлыРекомендаций.Примечание
		|ИЗ
		|	РегистрСведений.ФайлыРекомендаций КАК ФайлыРекомендаций
		|ГДЕ
		|	ФайлыРекомендаций.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаФайлов.Загрузить(РезультатЗапроса);	
	
КонецПроцедуры	


&НаСервереБезКонтекста
Функция ЗаписатьФайлНаСервере(АдресВременногоХранилища, КаталогХраненияФайлов, ИмяФайла)
Перем Файл, ДвоичныеДанные;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Файл = Новый Файл(ИмяФайла);
	ОтносительноеИмяФайла = Строка(Новый УникальныйИдентификатор) + Файл.Расширение;
	
	Попытка
		ДвоичныеДанные.Записать(КаталогХраненияФайлов + ОтносительноеИмяФайла);
	Исключение
		Сообщить("Не удалось добавить файл.");
		Возврат "";
	КонецПопытки;
	
	Возврат ОтносительноеИмяФайла;
	
КонецФункции


&НаСервереБезКонтекста
Функция КаталогХраненияФайлов()
	
	УстановитьПривилегированныйРежим(Истина);
	КаталогХраненияФайлов = Константы.КаталогХраненияФайловКонтрагентов.Получить();
	КаталогХраненияФайлов = КаталогХраненияФайлов + ?(Прав(КаталогХраненияФайлов, 1) = "\", "", "\") + "КонтрагентыРекомендации";
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КаталогХраненияФайлов;
	
КонецФункции

&НаКлиенте
Процедура ФайлыРекомендацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФайлРекомендация();
	
КонецПроцедуры


&НаКлиенте
Процедура ПросмотрФайла(Команда)
	
	ОткрытьФайлРекомендация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлРекомендация()
	
	Перем Файл, ОтносительноеИмяФайла;
		
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ОтносительноеИмяФайла = ТекущиеДанные.ОтносительноеИмяФайла;
	Если НЕ ПустаяСтрока(ОтносительноеИмяФайла) Тогда
		АдресВремХранилища = ПолучитьФайлНаСервере(КаталогХраненияФайлов + ОтносительноеИмяФайла, УникальныйИдентификатор);
		Если ЗначениеЗаполнено(АдресВремХранилища) Тогда
			Файл = Новый Файл(ОтносительноеИмяФайла);
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВремХранилища);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ОткрытьФайлРекомендация();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если  ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;	
		
	ОбработкаРезультата = Новый ОписаниеОповещения("УдалитьЗавершение",ЭтаФорма);
	ТекстВопроса = "Удалить файл?";	
	ПоказатьВопрос(ОбработкаРезультата,ТекстВопроса,РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайлНаСервере(ИмяФайла, УникальныйИдентификатор)
Перем Файл;
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УдалитьНаСервере(ОтносительноеИмяФайла)
	
	МенеджерЗаписи = РегистрыСведений.ФайлыРекомендаций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОтносительноеИмяФайла = ОтносительноеИмяФайла;
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Период = ПолучитьПериод(Контрагент,ОтносительноеИмяФайла);
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Удалить();
	
	УдалитьФайлНаСервере(КаталогХраненияФайлов + ОтносительноеИмяФайла);
	ЗаполнитьТаблицу();
	
КонецПроцедуры

Функция ПолучитьПериод(Контрагент,ОтносительноеИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыРекомендаций.Период
		|ИЗ
		|	РегистрСведений.ФайлыРекомендаций КАК ФайлыРекомендаций
		|ГДЕ
		|	ФайлыРекомендаций.Контрагент = &Контрагент
		|	И ФайлыРекомендаций.ОтносительноеИмяФайла = &ОтносительноеИмяФайла";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ОтносительноеИмяФайла", ОтносительноеИмяФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Период
	КонецЦикла;
	
	Возврат Дата(1,1,1);

КонецФункции
	
Процедура УдалитьФайлНаСервере(ИмяФайла)
	Перем Файл;
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(Результат,Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьНаСервере(Элементы.ТаблицаФайлов.ТекущиеДанные.ОтносительноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ПрикрепленныеФайлы");
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)
	
	Перем Файл, ОтносительноеИмяФайла;
	
	Отказ = Истина;
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогОткрытияФайла.Фильтр = "Все файлы (*.*)|*.*|";
	
	Если ДиалогОткрытияФайла.Выбрать() = Ложь Тогда
	    Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
	ОтносительноеИмяФайла = ЗаписатьФайлНаСервере(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя)), КаталогХраненияФайлов, Файл.Имя);
	Если НЕ ЗначениеЗаполнено(ОтносительноеИмяФайла) Тогда
		Предупреждение("Ошибка при добавлении файла!");
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ФайлыРекомендаций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.ОтносительноеИмяФайла = ОтносительноеИмяФайла;
	МенеджерЗаписи.ИмяФайла = Файл.Имя;	
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
	ЗаполнитьТаблицу();

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФайлРекомендация();
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

