
Процедура ОткрытьОбработкуЗаполненияПродуктовыхГрупп() Экспорт
	Обработка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Редактирование продуктовых групп поставщиков"); 
	Если Обработка<>неопределено тогда
		ЭтоОбработка = ?(Обработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка, Истина, Ложь);	 
		Если ЭтоОбработка тогда
			Попытка
				ИмяФайла = ПолучитьИмяВременногоФайла();
				ДвоичныеДанные = Обработка.ХранилищеВнешнейОбработки.Получить();
				ДвоичныеДанные.Записать(ИмяФайла);
				
				Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
				
				Если Не Форма = Неопределено Тогда
					Форма.Открыть();
				Иначе
					ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
				КонецЕсли;
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

Процедура ОткрытьСправочникПравилаРаботы() Экспорт
	
	Форма = Справочники.ПравилаРаботыСотрудников.ПолучитьФорму("АК_ФормаСписка");
	Форма.ТолькоПоступающиеПредложения = Истина;
	Форма.Открыть();
	
КонецПроцедуры
