&НаКлиенте
Перем СтруктураДоИзменения;

&НаСервере
Процедура ПересчитатьОстатки()
	
	ЗапросОстатков = Новый Запрос();
	ЗапросОстатков.Текст = "ВЫБРАТЬ
	                       |	ТоварыНаСкладахОстатки.КоличествоОстаток
	                       |ИЗ
	                       |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                       |			&ДатаОстатков,
	                       |			Склад = &Склад
	                       |				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки";
						   
	ЗапросОстатков.УстановитьПараметр("ДатаОстатков", Новый Граница(ДатаНач - 1, ВидГраницы.Включая));
	ЗапросОстатков.УстановитьПараметр("Склад", ТорговаяТочка.СкладТорговогоЗала);
	ЗапросОстатков.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = ЗапросОстатков.Выполнить().Выбрать();
	НО = 0;
	Если Выборка.Следующий() Тогда
		НО = Выборка.КоличествоОстаток;
	КонецЕсли;
	
	КолвоСтрок = ПеренестиНаДругиеДаты.Количество();
	Для н = 1 По КолвоСтрок Цикл
		ПеренестиНаДругиеДаты[КолвоСтрок - н].НО = НО;
		ПеренестиНаДругиеДаты[КолвоСтрок - н].КО = НО + ПеренестиНаДругиеДаты[КолвоСтрок - н].Поступило
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].Продано
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].Дегустация
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].Списание
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].СписаниеПоКачеству
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].Бой
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].Акция
								+ ПеренестиНаДругиеДаты[КолвоСтрок - н].Разница
								+ ПеренестиНаДругиеДаты[КолвоСтрок - н].Комплектация
								+ ПеренестиНаДругиеДаты[КолвоСтрок - н].ПолученоСДругихТТ
								- ПеренестиНаДругиеДаты[КолвоСтрок - н].ОтправленоНаДругиеТТ;
								
		НО = ПеренестиНаДругиеДаты[КолвоСтрок - н].КО;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ПерезаполнитьТаблицуТоваров()
	
	ПеренестиНаДругиеДаты.Очистить();
	
	МаксДата = ДатаКон;
	МинДата = ДатаНач;
	
	МаксДата = Мин(МаксДата, ТекущаяДата() - 86400);
	
	Для Каждого СтрокаИзменение Из ИзмененияНоменклатуры Цикл
		МаксДата = Макс(МаксДата, СтрокаИзменение.Дата);
		МинДата = Мин(МинДата, СтрокаИзменение.Дата);
	КонецЦикла;
	
	ТабДвижения = ВнешниеДанные.ПолучитьДвиженияТоваровПолная(МинДата, МаксДата, ТорговаяТочка, Номенклатура);
	ТабДвижения.Колонки.День.Имя = "Дата";
	
	Для Каждого СтрокаТаб Из ТабДвижения Цикл
		Если СтрокаТаб.Дата < '20140401' Тогда
			СтрокаТаб.Поступило = СтрокаТаб.Поступило + СтрокаТаб.ПолученоСДругихТТ - СтрокаТаб.ОтправленоНаДругиеТТ;
			СтрокаТаб.ПолученоСДругихТТ = 0;
			СтрокаТаб.ОтправленоНаДругиеТТ = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаИзменение Из ИзмененияНоменклатуры Цикл
		СтрокаДвижений = ТабДвижения.Найти(СтрокаИзменение.Дата, "Дата");
		Если СтрокаДвижений = Неопределено Тогда
			СтрокаДвижений = ТабДвижения.Добавить();
			СтрокаДвижений.Дата = СтрокаИзменение.Дата;
			СтрокаДвижений.Поступило = 0;
			СтрокаДвижений.Продано = 0;
			СтрокаДвижений.Дегустация = 0;
			СтрокаДвижений.Списание = 0;
			СтрокаДвижений.СписаниеПоКачеству = 0;
			СтрокаДвижений.Бой = 0;
			СтрокаДвижений.Акция = 0;
			СтрокаДвижений.Разница = 0;
		КонецЕсли;	
		Если СтрокаИзменение.КодОперации = 400 Тогда
			СтрокаДвижений.Поступило = СтрокаДвижений.Поступило + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 510 Тогда
			СтрокаДвижений.Продано = СтрокаДвижений.Продано + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 101 Тогда
			СтрокаДвижений.Дегустация = СтрокаДвижений.Дегустация + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 102 Тогда
			СтрокаДвижений.Списание = СтрокаДвижений.Списание + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 103 Тогда
			СтрокаДвижений.СписаниеПоКачеству = СтрокаДвижений.СписаниеПоКачеству + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 104 Тогда
			СтрокаДвижений.Бой = СтрокаДвижений.Бой + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 105 Тогда
			СтрокаДвижений.Акция = СтрокаДвижений.Акция + СтрокаИзменение.Количество;
		КонецЕсли;
		Если СтрокаИзменение.КодОперации = 520 Тогда
			СтрокаДвижений.Разница = СтрокаДвижений.Разница + СтрокаИзменение.Количество;
		КонецЕсли;
	КонецЦикла;
	
	ДатаОбработки = МинДата;
	Пока ДатаОбработки <= МаксДата Цикл
		Если ТабДвижения.Найти(ДатаОбработки, "Дата") = Неопределено Тогда
			СтрокаТаб = ТабДвижения.Добавить();
			СтрокаТаб.Дата = ДатаОбработки;
		КонецЕсли;	
		ДатаОбработки = ДатаОбработки + 86400;
	КонецЦикла;
	
	ДатаНач = МинДата;
	
	ТабДвижения.Сортировать("Дата убыв");
	
	Для Каждого СтрокаДвижение Из ТабДвижения Цикл
		ЗаполнитьЗначенияСвойств(ПеренестиНаДругиеДаты.Добавить(), СтрокаДвижение);
	КонецЦикла;	
	
	ПересчитатьОстатки();
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ТекущиеЗначения);
	
	Для Каждого СтрокаИзменение Из Параметры.ТекущиеЗначения.Перенесено Цикл
		
		ЗаполнитьЗначенияСвойств(ИзмененияНоменклатуры.Добавить(), СтрокаИзменение);
		
	КонецЦикла;
	
	Если ТорговаяТочка.ТипРозничнойТочки = Перечисления.ТипыРозничныхТочек.Магазин Тогда
		Элементы.ПеренестиНаДругиеДатыПродажа.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	СредняяЦена = Документы.ЛистУчета.ПолучитьСреднююЦенуДляНоменклатуры(Номенклатура, ДатаЛиста);
	ПерезаполнитьТаблицуТоваров();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИзменений()
	
	Изменения = ИзмененияНоменклатуры.Выгрузить();
	Изменения.Свернуть("Дата, КодОперации", "Количество, СуммаОперации");
	
	МассивИзменений = Новый Массив();
	Для Каждого СтрокаИзменение Из Изменения Цикл
		Если СтрокаИзменение.Количество <> 0 Тогда
			СтруктураИзменение = Новый Структура("Дата, КодОперации, Количество, Сумма", СтрокаИзменение.Дата, СтрокаИзменение.КодОперации, СтрокаИзменение.Количество, СтрокаИзменение.СуммаОперации);
			МассивИзменений.Добавить(СтруктураИзменение);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат МассивИзменений;
	
КонецФункции	

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	Отказ = Ложь;
	
	Если ДельтаИзмененийПоТоварам <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма всех корректировок должна сходится в ноль!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	МассивИзменений = ПолучитьМассивИзменений();
	
	СтруктураИзменений = Новый Структура("МассивИзменений", МассивИзменений);
	
	Закрыть(СтруктураИзменений);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	
	НП = Новый ДиалогРедактированияСтандартногоПериода();
	НП.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	НП.Период.ДатаНачала = ДатаНач;
	НП.Период.ДатаОкончания = ДатаКон;
	
	Если НП.Редактировать() Тогда
		//ДатаНач = Макс(НП.Период.ДатаНачала, ТекущаяДата() - 28*86400);
		ДатаНач = НП.Период.ДатаНачала;
		ДатаКон = НП.Период.ДатаОкончания;
	КонецЕсли;
	
	ПерезаполнитьТаблицуТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНаДругиеДатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтруктураДоИзменения = Новый Структура("Поступило, Продано, Дегустация, Списание, СписаниеПоКачеству, Бой, Акция, Разница");
	ЗаполнитьЗначенияСвойств(СтруктураДоИзменения, Элементы.ПеренестиНаДругиеДаты.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНаДругиеДатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ПеренестиНаДругиеДаты.ТекущиеДанные;
	Если ТекДанные.Поступило <> СтруктураДоИзменения.Поступило Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 400;
		СтрокаТаб.Количество = ТекДанные.Поступило - СтруктураДоИзменения.Поступило;
	КонецЕсли;
	
	Если ТекДанные.Продано <> СтруктураДоИзменения.Продано Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 510;
		СтрокаТаб.Количество = ТекДанные.Продано - СтруктураДоИзменения.Продано;
		СтрокаТаб.СуммаОперации = СтрокаТаб.Количество * СредняяЦена;
	КонецЕсли;
	
	Если ТекДанные.Дегустация <> СтруктураДоИзменения.Дегустация Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 101;
		СтрокаТаб.Количество = ТекДанные.Дегустация - СтруктураДоИзменения.Дегустация;
	КонецЕсли;
	
	Если ТекДанные.Списание <> СтруктураДоИзменения.Списание Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 102;
		СтрокаТаб.Количество = ТекДанные.Списание - СтруктураДоИзменения.Списание;
	КонецЕсли;
	
	Если ТекДанные.СписаниеПоКачеству <> СтруктураДоИзменения.СписаниеПоКачеству Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 103;
		СтрокаТаб.Количество = ТекДанные.СписаниеПоКачеству - СтруктураДоИзменения.СписаниеПоКачеству;
	КонецЕсли;
	
	Если ТекДанные.Бой <> СтруктураДоИзменения.Бой Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 104;
		СтрокаТаб.Количество = ТекДанные.Бой - СтруктураДоИзменения.Бой;
	КонецЕсли;
	
	Если ТекДанные.Акция <> СтруктураДоИзменения.Акция Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 105;
		СтрокаТаб.Количество = ТекДанные.Акция - СтруктураДоИзменения.Акция;
	КонецЕсли;
	
	Если ТекДанные.Разница <> СтруктураДоИзменения.Разница Тогда
		СтрокаТаб = ИзмененияНоменклатуры.Добавить();
		СтрокаТаб.Дата = ТекДанные.Дата;
		СтрокаТаб.КодОперации = 520;
		СтрокаТаб.Количество = ТекДанные.Разница - СтруктураДоИзменения.Разница;
	КонецЕсли;
	
	ПересчитатьДельтуТоваров();
	ПересчитатьОстатки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДельтуТоваров()
	
	ДельтаИзмененийПоТоварам = 0;
	Для Каждого СтрокаТаб Из ИзмененияНоменклатуры Цикл
		Если СтрокаТаб.КодОперации = 400
			ИЛИ СтрокаТаб.КодОперации = 520 Тогда
			ДельтаИзмененийПоТоварам = ДельтаИзмененийПоТоварам + СтрокаТаб.Количество;
		КонецЕсли;	
		
		Если СтрокаТаб.КодОперации = 510 ИЛИ СтрокаТаб.КодОперации = 101 ИЛИ СтрокаТаб.КодОперации = 102
			ИЛИ СтрокаТаб.КодОперации = 103 ИЛИ СтрокаТаб.КодОперации = 104 ИЛИ СтрокаТаб.КодОперации = 105 Тогда
			ДельтаИзмененийПоТоварам = ДельтаИзмененийПоТоварам - СтрокаТаб.Количество;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьДельтуТоваров();
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПеремещений(ТекИдентификатор)
	
	ТекДанные = ПеренестиНаДругиеДаты.НайтиПоИдентификатору(ТекИдентификатор);
	РасшифровкаПеремещенийМеждуТТ.Очистить();
	ТаблицаПеремещений = ВнешниеДанные.ПолучитьТаблицуПеремещенийМеждуТТПолная(ТекДанные.Дата, ТекДанные.Дата, ТорговаяТочка, Номенклатура);
	Для Каждого СтрокаПеремещения Из ТаблицаПеремещений Цикл
		СтрокаДоб = РасшифровкаПеремещенийМеждуТТ.Добавить();
		СтрокаДоб.ТТ = СтрокаПеремещения.ТТКорреспондент;
		СтрокаДоб.Отправлено = СтрокаПеремещения.ОтправленоНаДругиеТТ;
		СтрокаДоб.Получено = СтрокаПеремещения.ПолученоСДругихТТ;
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПеренестиНаДругиеДатыПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьТаблицуПеремещений(Элементы.ПеренестиНаДругиеДаты.ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиНаДругиеДатыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ПеренестиНаДругиеДаты.ТекущиеДанные.Дата < НачалоДня(ТекущаяДата()) - 86400*28 Тогда
		Отказ = Истина;
		Сообщить("Зпрещено редактировать период ранее, чем 28 дней");
	КонецЕсли;	
	
КонецПроцедуры

