Функция ВремяВСтроку(Время)
	Результат = Формат(Время,"ДФ=yyyy-MM-dd")+" "+?(Час(Время)<10,"0","")+Формат(Время,"ДЛФ=T; ДП=0:00:00");
	Возврат "{ts'"+Результат+"'}"
КонецФункции

&НаСервере
Процедура ЗапроситьВидеоНаСервере()
	
	//+++АК sole 2018.08.24 ИП-00019249	
	Перем ЭтотОбъект;
	Перем БПР;

	БПР = Новый Структура();
	БПР.Вставить("ТипЗапроса", ЭтаФорма.ТипЗапроса);
	БПР.Вставить("Начало", ЭтаФорма.Начало);
	БПР.Вставить("Окончание", ЭтаФорма.Окончание);
	БПР.Вставить("НомерЧека", ЭтаФорма.НомерЧека);
	БПР.Вставить("Магазин", ЭтаФорма.Магазин);
	БПР.Вставить("ОбъектНаблюдения", ЭтаФорма.ОбъектНаблюдения);
	БПР.Вставить("КомментарийКВидео", ЭтаФорма.КомментарийКВидео);
	БПР.Вставить("Срочно", ЭтаФорма.Срочно);
	БПР.Вставить("Email", ЭтаФорма.Email);
	БПР.Вставить("КамерыСписок", ЭтаФорма.КамерыСписок);

	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗапроситьВидеоНаСервере(БПР);
    //---АК sole 2018.08.24 ИП-00019249                                                	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	
	Если ТипЗапроса = "Фото"и ИнтервалФото = 0  Тогда
		
		Сообщить("Интервал запроса фото не может быть равен 0.");	
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗапроситьВидеоНаСервере();
		ОповеститьОВыборе(Истина);
	Исключение
		Сообщить("Не удалось сформировать запрос")
	КонецПопытки
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Значения")Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.Значения);
		Если ЗначениеЗаполнено(НомерМагазина) Тогда 
			Магазин = Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("НомерТочки",Параметры.Значения.НомерМагазина);
			//Если ЗначениеЗаполнено(Магазин) Тогда 
			//	НомерМагазина = НомерМагазинаПоСсылке(Магазин);
			//Иначе
			//	НомерМагазина = 0;
			//КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Магазин) Тогда 			
			НомерМагазина = НомерМагазинаПоСсылке(Магазин);
		Иначе
			НомерМагазина = 0;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Значения.Свойство("МагазинТек") и ЗначениеЗаполнено(Параметры.Значения.МагазинТек) Тогда
		Магазин = Параметры.Значения.МагазинТек;
		Если ЗначениеЗаполнено(Магазин) Тогда 
			НомерМагазина = НомерМагазинаПоСсылке(Магазин);
		Иначе
			НомерМагазина = 0;
		КонецЕсли;
		Элементы.Магазин.ТолькоПросмотр = Истина;
	КонецЕсли;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если ЗначениеЗаполнено(Ответственный)Тогда
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Адрес
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект =&Ответственный
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя)";
		Запрос.УстановитьПараметр("Ответственный",Ответственный);
		Адреса = Запрос.Выполнить().Выбрать();
		Адреса.Следующий();
		Email = Адреса.Адрес;
	КонецЕсли;
	//	МассивТипов = Новый Массив;
	//МассивТипов.Добавить(Тип("Строка"));
	//Элементы.ОбъектНаблюдения.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыСтроки(200));
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Магазин) и ЗначениеЗаполнено(ОбъектНаблюдения) и ТипЗнч(ОбъектНаблюдения) = Тип("СправочникСсылка.РабочиеМеста") и ОбъектНаблюденияСтруктурнаяЕдиница(ОбъектНаблюдения) <> Магазин Тогда 
		ОбъектНаблюдения = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;             
	
	ПолучитьИДКамерСервер();
	Если ЗначениеЗаполнено(Магазин) Тогда 
		НомерМагазина = НомерМагазинаПоСсылке(Магазин);
	Иначе
		НомерМагазина = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ОбъектНаблюденияСтруктурнаяЕдиница (ОбъектНаблюденияСсылка) 
	
Возврат ОбъектНаблюденияСсылка.СтруктурнаяЕдиница;	
КонецФункции

&НаКлиенте
Процедура ОбъектНаблюденияПриИзменении(Элемент)
	
	ПолучитьИДКамерСервер();
	
	Если ЗначениеЗаполнено(Магазин) и ТипЗнч(ОбъектНаблюдения) = Тип("СправочникСсылка.РабочиеМеста") Тогда 
		НомерКассы = НомерКассыПоСсылке(ОбъектНаблюдения);
	Иначе
		НомерКассы = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НомерКассыПоСсылке(сКасса);
	
   Возврат   сКасса.ИД;
КонецФункции // ()

&НаСервере
Функция НомерМагазинаПоСсылке(сМагазин);
	
   Возврат   сМагазин.НомерТочки;
КонецФункции // ()

&НаСервере
Процедура ПолучитьИДКамерСервер_ПредыдущаяВерсия()
#Область АК_ОтключенныйКод
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	АК_ПривязкаКамерыКОбъектуНаблюдения.IDКамеры.IDКамеры КАК IDКамеры,
//	|	АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин,
//	|	АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения
//	|ИЗ
//	|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения КАК АК_ПривязкаКамерыКОбъектуНаблюдения
//	|ГДЕ
//	|	ИСТИНА
//	|	И АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин = &Магазин
//	|	И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения
//	|	И АК_ПривязкаКамерыКОбъектуНаблюдения.АктивностьЗаписи = ИСТИНА";
//	
//	Если ЗначениеЗаполнено(Магазин) Тогда 
//		Запрос.УстановитьПараметр("Магазин", Магазин);
//	Иначе
//		Запрос.Текст  = СтрЗаменить(Запрос.Текст,"И АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин = &Магазин","");
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ОбъектНаблюдения) Тогда 
//		Запрос.УстановитьПараметр("ОбъектНаблюдения", ОбъектНаблюдения);
//	Иначе
//		Запрос.Текст  = СтрЗаменить(Запрос.Текст,"И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения","");
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("Магазин", Магазин);
//	Запрос.УстановитьПараметр("ОбъектНаблюдения", ОбъектНаблюдения);
//	
//	Результат = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = Результат.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовСтр = КамерыСписок.Добавить();
//		НовСтр.ID_Камеры  = ВыборкаДетальныеЗаписи.IDКамеры;	
//		//НовСтр.ОбъектНаблюдения = ВыборкаДетальныеЗаписи.ОбъектНаблюдения;
//		НовСтр.Выбрать  = Истина;	
//	КонецЦикла;
//	
#КонецОбласти

ЭтоВидео = (ЭтаФорма.ТипЗапроса = "Видео");

Если ОбъектНаблюдения = Справочники.МП_Ракурсы.Кассы Тогда 
	КамерыСписок.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин.НомерТочки КАК НомерТочки,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры.IDКамеры КАК IDКамерыСтр,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения,
	|   АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры.СтатусКанала КАК СтатусКанала
	|ИЗ
	|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения) = ТИП(Справочник.РабочиеМеста)";
	
	// +++ GOLV ИП-00019249
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин.НомерТочки КАК НомерТочки,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры.IDКамеры КАК IDКамерыСтр,
	|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры.СтатусКанала КАК СтатусКанала
	|ИЗ
	|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения) = ТИП(Справочник.РабочиеМеста)
	|	И АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин = &Магазин
	|	И (АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо > &ТекущаяДата)";
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	// --- GOLV ИП-00019249
	
	Запрос.УстановитьПараметр("ОбъектНаблюдения", ОбъектНаблюдения);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ОбъектНаблюдения <> Справочники.РабочиеМеста.ПустаяСсылка() Тогда 
			НовСтр = КамерыСписок.Добавить();
			НовСтр.ID_Камеры  = ВыборкаДетальныеЗаписи.IDКамерыСтр;	
			НовСтр.Магазин  = ВыборкаДетальныеЗаписи.Магазин;	
			НовСтр.НомерМагазин  = ВыборкаДетальныеЗаписи.НомерТочки;
			//+++АК sole 2018.08.27 ИП-00019249
			НовСтр.СтатусКанала = ВыборкаДетальныеЗаписи.СтатусКанала;
			
			Если ЭтаФорма.Срочно И ЭтоВидео Тогда
				Если НовСтр.СтатусКанала = Перечисления.АК_СтатусыКаналаКамеры.Плохой Тогда
					НовСтр.Выбрать = Ложь;
				Иначе
					НовСтр.Выбрать = Истина;	
				КонецЕсли;
			Иначе
				НовСтр.Выбрать = Истина;	
			КонецЕсли;
			//---АК sole 2018.08.27 ИП-00019249
			
			НовСтр.Описание = "Камеры на ККМ";
		КонецЕсли;
	КонецЦикла;
	
	
Иначе
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ДатаН КАК Дата,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних(
		|			&ДатаН,
		|			ИСТИНА
		|				И Магазин = &Магазин
		|				И ОбъектНаблюдения = &ОбъектНаблюдения) КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних
		|ГДЕ
		|	(АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо >= &ДатаК
		|			ИЛИ АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо = &ПустаяДата)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(АК_ПривязкаКамерыКОбъектуНаблюдения.Период, ДЕНЬ),
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.IDКамеры,
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин
		|ИЗ
		|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения КАК АК_ПривязкаКамерыКОбъектуНаблюдения
		|ГДЕ
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.Период МЕЖДУ &ДатаН И &ДатаК
		|	И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения
		|	И АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин = &Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаН КАК Дата,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Магазин,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры.СтатусКанала КАК СтатусКанала
		|
		|		ПОМЕСТИТЬ ВТ_Камеры
		|ИЗ
		|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних(
		|			&ДатаН,
		|			ИСТИНА
		|				И Магазин = &Магазин
		|				И ОбъектНаблюдения = &ОбъектНаблюдения1) КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних
		|ГДЕ
		|	(АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо >= &ДатаК
		|			ИЛИ АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ДатаПо = &ПустаяДата)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(АК_ПривязкаКамерыКОбъектуНаблюдения.Период, ДЕНЬ),
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.IDКамеры,
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин,
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.IDКамеры.СтатусКанала КАК СтатусКанала
		|ИЗ
		|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения КАК АК_ПривязкаКамерыКОбъектуНаблюдения
		|ГДЕ
		|	АК_ПривязкаКамерыКОбъектуНаблюдения.Период МЕЖДУ &ДатаН И &ДатаК
		|	И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения1
		|	И АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин = &Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КОНЕЦПЕРИОДА(ВТ.Дата, ДЕНЬ) КАК Дата,
		|	ВТ.IDКамеры
		|ПОМЕСТИТЬ ВТ_Камера_Дата
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.IDКамеры,
		|	ВТ.IDКамеры.IDКамеры,
		|	ВТ.Магазин,
		|	ВТ.Магазин.НомерТочки КАК НомерТочки,
		|	ВТ.СтатусКанала
		|ИЗ
		|	ВТ_Камеры КАК ВТ
		|ГДЕ
		|	ВТ.IDКамеры <> ЗНАЧЕНИЕ(Справочник.АК_ID_Камеры.ПустаяСсылка)
		|	И ВТ.Магазин <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)";



	Запрос.УстановитьПараметр("ДатаН", КонецДня(Начало));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Окончание));	
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101000000"));		
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Если  ЗначениеЗаполнено(ОбъектНаблюдения) и  ( ТипЗнч(ОбъектНаблюдения) = Тип("СправочникСсылка.МП_Ракурсы") или ТипЗнч(ОбъектНаблюдения) = Тип("СправочникСсылка.РабочиеМеста") )  Тогда 
		Запрос.УстановитьПараметр("ОбъектНаблюдения", ОбъектНаблюдения);
		Запрос.УстановитьПараметр("ОбъектНаблюдения1", ОбъектНаблюдения);
		
	Иначе
		Запрос.УстановитьПараметр("ОбъектНаблюдения", Неопределено);
		
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И ОбъектНаблюдения = &ОбъектНаблюдения1","");
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения1","");
		
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И ОбъектНаблюдения = &ОбъектНаблюдения","И ОбъектНаблюдения <> &ОбъектНаблюдения");
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения = &ОбъектНаблюдения","И АК_ПривязкаКамерыКОбъектуНаблюдения.ОбъектНаблюдения <> &ОбъектНаблюдения");
	КонецЕсли;
	Если  ЗначениеЗаполнено(Магазин) Тогда 
		Запрос.УстановитьПараметр("Магазин", Магазин);
	Иначе
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И АК_ПривязкаКамерыКОбъектуНаблюдения.Магазин = &Магазин","");
		Запрос.Текст = СтрЗаменить( Запрос.Текст,"И Магазин = &Магазин","");
	КонецЕсли;
	
	КамерыСписок.Очистить();
	
	Если ЗначениеЗаполнено(Магазин) = Ложь и ЗначениеЗаполнено(ОбъектНаблюдения) = Ложь Тогда
		
		Возврат; 	
		
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	   
	//ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	ВыборкаКамеры = Результат[3].Выбрать();
	
	Пока ВыборкаКамеры.Следующий() Цикл
		
		НовСтр = КамерыСписок.Добавить();
		НовСтр.ID_Камеры  = ВыборкаКамеры.IDКамеры;	
		НовСтр.Магазин  = ВыборкаКамеры.Магазин;	
		НовСтр.НомерМагазин  = ВыборкаКамеры.НомерТочки;			
		//+++АК sole 2018.08.27 ИП-00019249
		НовСтр.СтатусКанала = ВыборкаКамеры.СтатусКанала;
		
		Если ЭтаФорма.Срочно И ЭтоВидео Тогда
			Если НовСтр.СтатусКанала = Перечисления.АК_СтатусыКаналаКамеры.Плохой Тогда
				НовСтр.Выбрать = Ложь;
			Иначе
				НовСтр.Выбрать = Истина;	
			КонецЕсли;
		Иначе
			НовСтр.Выбрать = Истина;	
		КонецЕсли;
		//---АК sole 2018.08.27 ИП-00019249
		
		НовСтр.Описание = "";
		
		Запрос.Текст = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Камера_Дата.Дата КАК Дата
		|ИЗ
		|	ВТ_Камера_Дата КАК ВТ_Камера_Дата
		|ГДЕ
		|	ВТ_Камера_Дата.IDКамеры = &IDКамеры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		Запрос.УстановитьПараметр("IDКамеры",  ВыборкаКамеры.IDКамеры);
		Результат = Запрос.Выполнить();
		
		ВыборкаДаты = Результат.Выбрать();
		Описание = "";
		ПервыйЦиклДаты = Истина;
		Пока ВыборкаДаты.Следующий() Цикл
			
			Запрос1 = Новый Запрос;
			Запрос1.Текст = 
			"ВЫБРАТЬ
			|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения,
			|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
			|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения КАК ОбъектНаблюдения1
			|ИЗ
			|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних(&ДатаСреза, IDКамеры = &IDКамеры) КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних
			|ГДЕ
			|	ИСТИНА";
			
			Запрос1.УстановитьПараметр("IDКамеры", ВыборкаКамеры.IDКамеры);
			
			Запрос1.УстановитьПараметр("ДатаСреза", КонецДня(ВыборкаДаты.Дата));
			
			Результат = Запрос1.Выполнить();
			ОписаниеНаДату = "";
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Если ПервыйЦиклДаты =Ложь Тогда
				ОписаниеНаДату = ОписаниеНаДату +Символы.ПС;
			КонецЕсли;
			ОписаниеНаДату = ОписаниеНаДату + "с "+Формат(ВыборкаДаты.Дата,"ДФ=dd.MM.yyyy")+" ";
			ПервыйЦиклОписание = Истина;
			ЕстьОбъектыНаблюдения = Ложь;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.ОбъектНаблюдения <> Неопределено Тогда 
					ОписаниеНаДату = ОписаниеНаДату+?(ПервыйЦиклОписание," ",", ")+ВыборкаДетальныеЗаписи.ОбъектНаблюдения ;
					ПервыйЦиклОписание = Ложь  ;
					ЕстьОбъектыНаблюдения = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьОбъектыНаблюдения Тогда
				ПервыйЦиклДаты = Ложь;
				Описание = Описание + ОписаниеНаДату+";"
			КонецЕсли;
			
		КонецЦикла;
		НовСтр.Описание = Описание;
	КонецЦикла;
КонецЕсли;	
	
	Если ЗначениеЗаполнено(ID_Камеры) и КамерыСписок.Количество()>0 Тогда
		Для каждого Стр  Из КамерыСписок Цикл
			Если  Стр.ID_Камеры = ID_Камеры Тогда
				Стр.Выбрать = Истина;
			Иначе	
				Стр.Выбрать = Ложь;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьИДКамер()

//+++АК sole 2018.08.29 ИП-00019249
&НаСервере
Процедура ПолучитьИДКамерСервер()
	
	Перем ЭтотОбъект;
	Перем БПР;
	
	БПР = Новый Структура();
	БПР.Вставить("ТипЗапроса", ЭтаФорма.ТипЗапроса);
	БПР.Вставить("Магазин", ЭтаФорма.Магазин);
	БПР.Вставить("ОбъектНаблюдения", ЭтаФорма.ОбъектНаблюдения);
	БПР.Вставить("Срочно", ЭтаФорма.Срочно);
	БПР.Вставить("КамерыСписок", ЭтаФорма.КамерыСписок);
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ПолучитьИДКамер(БПР);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНаблюденияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора =	ОбъектНаблюденияСервер(Текст)

КонецПроцедуры

&НаСервере
Функция ОбъектНаблюденияСервер(Текст)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МП_Ракурсы.Ссылка
	|ИЗ
	|	Справочник.МП_Ракурсы КАК МП_Ракурсы
	|ГДЕ
	|	МП_Ракурсы.Наименование ПОДОБНО &Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМеста.Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.Наименование ПОДОБНО &Наименование
	|	И РабочиеМеста.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("Наименование", "%" + Текст + "%");
	Если ЗначениеЗаполнено(Магазин) Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Магазин);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И РабочиеМеста.СтруктурнаяЕдиница = &СтруктурнаяЕдиница","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Пока вЫборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка,Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции


&НаКлиенте
Процедура ОбъектНаблюденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПереопределитьСвязиПараметровВыбораОбъектаНаблюдения ();
КонецПроцедуры

&НаСервере
Процедура ПереопределитьСвязиПараметровВыбораОбъектаНаблюдения()
	Если ЗначениеЗаполнено(Магазин) Тогда 
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.СтруктурнаяЕдиница",	"Магазин"));
	Иначе
		НовыйМассив = Новый Массив();
	КонецЕсли;
	
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ОбъектНаблюдения.СвязиПараметровВыбора = НовыеСвязи;
	
КонецПроцедуры // ПереопределитьСвязиПараметровВыбора()

&НаКлиенте
Процедура НачалоПриИзменении(Элемент)
	
	Если ТипЗапроса = "Видео" Тогда 
		Если (Окончание - Начало <= 600 и  Окончание - Начало > 0) = Ложь Тогда
			Окончание = Начало+5;
			Предупреждение("Интервал для видео не может быть более 10 минут.");
		КонецЕсли;
	ИначеЕсли  ТипЗапроса = "Фото" Тогда 
		Если (Окончание - Начало <= 10800 и  Окончание - Начало > 0) = Ложь Тогда
			Окончание = Начало+5;
			Предупреждение("Интервал для видео не может быть более 3 часов и дата начала дожны быть меньше даты окончания.");
		КонецЕсли;
	КонецЕсли;
	Если  ЗначениеЗаполнено(Окончание) = Ложь Тогда
		Окончание = Начало+5;	
	КонецЕсли;
	Если  ЗначениеЗаполнено(Начало) = Ложь Тогда
		Начало = Окончание;	
	КонецЕсли;
	
	//
	//Если Окончание < Начало  и ЗначениеЗаполнено(Окончание) и ЗначениеЗаполнено(Начало) Тогда	
	//	Окончание = Начало+5;	
	//КонецЕсли;
	Если НачалоДня(Окончание) <> НачалоДня(Окончание1) или  НачалоДня(Начало) <> НачалоДня(Начало1) Тогда
		Если ЗначениеЗаполнено(Магазин) или ЗначениеЗаполнено(ОбъектНаблюдения) Тогда
			ПолучитьИДКамерСервер();
		КонецЕсли;
	КонецЕсли;
	Начало1 = Начало;
КонецПроцедуры


&НаКлиенте
Процедура ОкончаниеПриИзменении(Элемент)
	
	Если ТипЗапроса = "Видео" Тогда 
		Если (Окончание - Начало <= 600 и  Окончание - Начало > 0) = Ложь Тогда
			Начало = Окончание-5;
			Предупреждение("Интервал для видео не может быть более 10 минут.");
		КонецЕсли;
	ИначеЕсли ТипЗапроса = "Видео" Тогда 
		Если (Окончание - Начало <= 10800 и  Окончание - Начало > 0) = Ложь Тогда
			Начало = Окончание-5;
			Предупреждение("Интервал для видео не может быть более 3 часов и дата начала дожны быть меньше даты окончания.");
		КонецЕсли;		
	КонецЕсли;
	
	
	Если Окончание < Начало и ЗначениеЗаполнено(Окончание) и ЗначениеЗаполнено(Начало) Тогда	
		Начало = Окончание+5;	
	КонецЕсли;
	Если НачалоДня(Окончание) <> НачалоДня(Окончание1) или  НачалоДня(Начало) <> НачалоДня(Начало1) Тогда
		Если ЗначениеЗаполнено(Магазин) или ЗначениеЗаполнено(ОбъектНаблюдения) Тогда
			ПолучитьИДКамерСервер();
		КонецЕсли;
	КонецЕсли;
	Окончание1 = Окончание;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТипЗапроса) Тогда 
		ТипЗапросаПриИзменении("");
		ИнтервалФото = 1;
		Окончание = Начало;
	Иначе
		ТипЗапроса = "Видео";
	КонецЕсли;
	ОбъектНаблюдения =  РабочееМестоНаСервере(НомерКассы);	
	Если  НомерМагазина<> 0 Тогда 
		Магазин =  МагазинНаСервере(НомерМагазина);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектНаблюдения) или  ЗначениеЗаполнено(Магазин) Тогда 
		ПолучитьИДКамерСервер();
	КонецЕсли;
	ID_Камеры = СокрЛП(ID_Камеры);
	Если ЗначениеЗаполнено(ID_Камеры) и КамерыСписок.Количество()>0 Тогда
		Для каждого Стр  Из КамерыСписок Цикл
		   Если  Стр.ID_Камеры = ID_Камеры Тогда
		       Стр.Выбрать = Истина;
		   Иначе	
		       Стр.Выбрать = Ложь;
		   КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектНаблюдения) = Ложь Тогда
	  ОбъектНаблюдения  = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

Функция РабочееМестоНаСервере(НомерКассы)	
	Возврат   Справочники.РабочиеМеста.НайтиПоРеквизиту("ИД",НомерКассы);		
КонецФункции

Функция МагазинНаСервере(НомерМагазина)	
	Возврат   Справочники.СтруктурныеЕдиницы.НайтиПоРеквизиту("НомерТочки",НомерМагазина);		
КонецФункции

&НаКлиенте
Процедура ТипЗапросаПриИзменении(Элемент)
	Если ТипЗапроса = "Фото" Тогда
		Элементы.ИнтервалФото.Видимость = Истина;
	Иначе 	
		Элементы.ИнтервалФото.Видимость = Ложь;
		Если (Окончание - Начало < 600 и  Окончание - Начало > 0) = Ложь Тогда
			Окончание = Начало+5;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	//+++АК sole 2018.08.27 ИП-00019249
	ЭтоВидео = (ЭтаФорма.ТипЗапроса = "Видео");
	
	Для каждого Стр Из КамерыСписок  Цикл
	
		Если ЭтаФорма.Срочно И ЭтоВидео Тогда
			Если Стр.СтатусКанала = ПредопределенноеЗначение("Перечисление.АК_СтатусыКаналаКамеры.Плохой") Тогда
				Стр.Выбрать = Ложь;
			Иначе
				Стр.Выбрать = Истина;	
			КонецЕсли;
		Иначе
			Стр.Выбрать = Истина;	
		КонецЕсли;

	КонецЦикла;
	//---АК sole 2018.08.27 ИП-00019249	 

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
		Для каждого Стр Из КамерыСписок  Цикл
	
		 Стр.Выбрать = Ложь;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура МагазинОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(ОбъектНаблюдения) = Тип("СправочникСсылка.РабочиеМеста") Тогда 
		ОбъектНаблюдения = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;
	ПолучитьИДКамерСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНаблюденияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбъектНаблюдения = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	ПолучитьИДКамерСервер();
КонецПроцедуры

//+++АК sole 2018.08.27 ИП-00019249
&НаКлиенте
Процедура СрочноПриИзменении(Элемент)
	
	ЭтоВидео = (ЭтаФорма.ТипЗапроса = "Видео");
	
	Для каждого Стр Из ЭтаФорма.КамерыСписок Цикл
	
		Если ЭтаФорма.Срочно И ЭтоВидео Тогда
			Если Стр.СтатусКанала = ПредопределенноеЗначение("Перечисление.АК_СтатусыКаналаКамеры.Плохой") Тогда
				Стр.Выбрать = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
