
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СхемаКомпоновкиДанных = Обработки.УправлениеАссортиментомЗЛ.ПолучитьМакет("СКД");
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());   	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));      
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	ДанныеРасшифровкиКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = Обработки.УправлениеАссортиментомЗЛ.ПолучитьМакет("СКД");
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	 
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровкиКД);
    
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(Результат);
    
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКД, Новый УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресРасшифровки,
    Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
 
	ДоступныеДействия = Новый Массив();
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);	
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	
	ДополнительныеДействия = Новый СписокЗначений;
	ДополнительныеДействия.Добавить("Ввести");
	ДополнительныеДействия.Добавить("Вывести");
	ДополнительныеДействия.Добавить("Запретить");

	ТекущееЗначение = ПолучитьРезултатРасшифровки(Расшифровка);
	
	
	//Если ВыбранноеДействие = "Прикрепить файл"  Тогда
	//	
	//КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьРезултатРасшифровки(Расшифровка)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	
	ЗначенияРасшифровки = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	
	Если ЗначенияРасшифровки.Количество() Тогда
	
		Возврат ЗначенияРасшифровки[0].Значение;

	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Сообщить("1");
КонецПроцедуры
