
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредМаршрут = Неопределено;
	Для Каждого СтрокаТаб Из Параметры.ТаблицаКонфликтов Цикл
		Если ПредМаршрут <> СтрокаТаб.Маршрут Тогда
			СтрокаРодитель = ДеревоКонфликтов.ПолучитьЭлементы().Добавить();
			СтрокаРодитель.Представление = СтрокаТаб.МаршрутПредставление;
			СтрокаРодитель.Маршрут = СтрокаТаб.Маршрут;
		КонецЕсли;
		СтрокаДерево = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерево.Представление 		= СтрокаТаб.СтруктурнаяЕдиницаПредставление;
		СтрокаДерево.Маршрут 			= СтрокаТаб.Маршрут;
		СтрокаДерево.СтруктурнаяЕдиница = СтрокаТаб.СтруктурнаяЕдиница;
		ПредМаршрут = СтрокаТаб.Маршрут;
	КонецЦикла;
	   
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонфликтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(ДеревоКонфликтов.НайтиПоИдентификатору(ВыбраннаяСтрока).Маршрут);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтруктурныеЕдиницыИзМаршрутовСервер()
	
	Для Каждого СтрокаМаршут Из ДеревоКонфликтов.ПолучитьЭлементы() Цикл
		МаршрутОбъект = СтрокаМаршут.Маршрут.ПолучитьОбъект();
		Для Каждого СтрокаСтрукЕдиница Из СтрокаМаршут.ПолучитьЭлементы() Цикл
			КолвоСтрок = МаршрутОбъект.ТорговыеТочки.Количество();
			Для н = 1 По КолвоСтрок Цикл
				Если МаршрутОбъект.ТорговыеТочки[КолвоСтрок - н].СтруктурнаяЕдиница = СтрокаСтрукЕдиница.СтруктурнаяЕдиница Тогда
					МаршрутОбъект.ТорговыеТочки.Удалить(КолвоСтрок - н);
					//+++ AK suvv 2018.11.15 ИП-00020358
					НовСтрока = ТаблицаСЕИзДругихМаршрутов.Добавить();
					НовСтрока.Маршрут            = МаршрутОбъект.Ссылка;
					НовСтрока.СтруктурнаяЕдиница = СтрокаСтрукЕдиница.СтруктурнаяЕдиница;
					//--- AK suvv
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
		МаршрутОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

//+++ AK suvv 2018.11.15 ИП-00020358
&НаСервере 
Функция ТарифыСЕПоСтарымМаршрутам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_МаршрутыИСЕ.Маршрут,
	|	ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_МаршрутыИСЕ
	|ИЗ
	|	&ВТ_МаршрутыИСЕ КАК ВТ_МаршрутыИСЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.Ставка,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.НаличиеДопТарифа,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.СтавкаДопТарифа
	|ИЗ
	|	ВТ_МаршрутыИСЕ КАК ВТ_МаршрутыИСЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьУслугПоДоставкеТовараНаТТ.СрезПоследних КАК СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних
	|		ПО ВТ_МаршрутыИСЕ.Маршрут = СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.Маршрут
	|			И ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница = СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.ТТ
	|ГДЕ
	|	ЕСТЬNULL(СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.ТТ, """") <> """"";
	Запрос.УстановитьПараметр("ВТ_МаршрутыИСЕ", ТаблицаСЕИзДругихМаршрутов.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
		
КонецФункции //--- AK suvv

&НаКлиенте
Процедура УдалитьСтруктурныеЕдиницыИзМаршрутов(Команда)
	
	УдалитьСтруктурныеЕдиницыИзМаршрутовСервер();
	//+++ AK suvv 2018.11.15 ИП-00020358
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("СтатусОтказа",              Ложь);
	ПараметрыВозврата.Вставить("ТарифыСЕПоСтарымМаршрутам", ТарифыСЕПоСтарымМаршрутам());
	Закрыть(ПараметрыВозврата);
	//--- AK suvv
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьРедактированиеТекущего(Команда)
	
	//+++ AK suvv 2018.11.15 ИП-00020358 
	Закрыть(Новый Структура("СтатусОтказа", Истина));
	//--- AK suvv
	
КонецПроцедуры
