
Функция ПолучитьАналогДляНоменклатуры(Номенклатура) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АналогиНоменклатурыТовары.Ссылка
		|ИЗ
		|	Справочник.АналогиНоменклатуры.Товары КАК АналогиНоменклатурыТовары
		|ГДЕ
		|	АналогиНоменклатурыТовары.Номенклатура = &Номенклатура
		|	И НЕ АналогиНоменклатурыТовары.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПредопределенноеЗначение("Справочник.АналогиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	Возврат ВыборкаЗапроса.Ссылка;
	
КонецФункции
