
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеВыполнятьДинамическоеЧтениеКоличествПолученныхТТ = ПараметрыСеанса.НеВыполнятьДинамическоеЧтениеКоличествПолученныхТТ;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ПараметрыСеанса.НеВыполнятьДинамическоеЧтениеКоличествПолученныхТТ = НеВыполнятьДинамическоеЧтениеКоличествПолученныхТТ;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	Закрыть();
	
КонецПроцедуры
