
&НаКлиенте
Процедура ИмпортИзExcel(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Открыть файл с данными";
	ДиалогВыбораФайла.Фильтр    = "Файл Excel (*.xlsx)|*.xlsx";
	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	xl = Новый COMОбъект("Excel.Application");
	xl_документ = xl.Workbooks.Open(ДиалогВыбораФайла.ПолноеИмяФайла);
	xl_лист  = xl_документ.Sheets(1);

	й=1;
	КоличествоПустых = 10;
	Пока КоличествоПустых>0 Цикл	
		й = й + 1;
		ТекстВопроса = СокрЛП(xl_лист.cells(й,2).value);
		ТекстОтвета = СокрЛП(xl_лист.cells(й,3).value);
		Папка = СокрЛП(xl_лист.cells(й,4).value);
		Если НЕ ЗначениеЗаполнено(ТекстВопроса) Тогда
			КоличествоПустых = КоличествоПустых - 1;
			Продолжить;
		КонецЕсли;
		СтруктураВопроса=Новый Структура;
		СтруктураВопроса.Вставить("ТекстВопроса",ТекстВопроса);
		СтруктураВопроса.Вставить("ТекстОтвета",ТекстОтвета);
		СтруктураВопроса.Вставить("Папка",Папка);
		ЗаписатьЭлементНаСервере(СтруктураВопроса);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьЭлементНаСервере(СтруктураВопроса)
	Папка=Справочники.ОпросникДляЭкзаменацииПродавца.НайтиПоНаименованию(СтруктураВопроса.Папка);
	Если Папка.Пустая() Тогда
		Папка=Справочники.ОпросникДляЭкзаменацииПродавца.СоздатьГруппу();
		Папка.Наименование=СтруктураВопроса.Папка;
		Папка.Записать();
		Папка=Папка.Ссылка;
	КонецЕсли;
	Вопрос=Справочники.ОпросникДляЭкзаменацииПродавца.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Вопрос,СтруктураВопроса);
	Вопрос.Родитель=Папка;
	Вопрос.Наименование=Вопрос.ТекстВопроса;
	Вопрос.Записать();
	
КонецПроцедуры	
