
//+++АК sole 2018.07.31 ИП-00018320.06
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьФильтрациюСпискаДляПеревозчика();
КонецПроцедуры

//+++АК sole 2018.07.31 ИП-00018320.06
&НаСервере
Процедура УстановитьФильтрациюСпискаДляПеревозчика()
	
	Если 
			НЕ РольДоступна("ПолныеПрава") 
		И	РольДоступна("Перевозчик") 
	Тогда
		СписокДоступныхПеревозчиков = РегистрыСведений.АК_ПеревозчикиПоКонтрагентам.ПолучитьСписокКонтрагентовДляФильтрации(ПараметрыСеанса.ТекущийПользователь);
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Перевозчик");
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокДоступныхПеревозчиков;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	КонецЕсли;
	
КонецПроцедуры

//