
Процедура СоздатьПриходныеОрдераПоПредзаказу(Предзаказ, ЗапускИзЗаказа = Неопределено) Экспорт
	
	//Не используется
	
	//++АК Lobv 30.10.2016 обрабатываем создание и редактирование приходных ордеров на виртуальный склад
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	, (Предзаказ.Дата - 30*24*3600));
	Запрос.УстановитьПараметр("Документ", Предзаказ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщикуПредзаказы.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПоставщику.Предзаказы КАК ЗаказПоставщикуПредзаказы
	|ГДЕ
	|	ЗаказПоставщикуПредзаказы.Документ = &Документ
	|	И ЗаказПоставщикуПредзаказы.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПоставщикуПредзаказы.Ссылка.Дата >= &Дата";
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	Если МассивЗаказов.Количество() > 0
			И ЗапускИзЗаказа = Неопределено Тогда //значит должен быть приходник
		ДанныеЗаполнения = МассивЗаказов[0];
		//1. надо привести в соответствие дату и пометку удаления
		//2. табличную часть товаров
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Комментарий"	, "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер));
		Запрос.УстановитьПараметр("Дата"		, (Предзаказ.Дата - 30*24*3600));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерСклад.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
		|ГДЕ
		|	ПриходныйОрдерСклад.Дата >= &Дата
		|	И ПриходныйОрдерСклад.Комментарий = &Комментарий";
		МассивОрдеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		НужноПерепровестиОрдер = Ложь;
		Если МассивОрдеров.Количество()=0 тогда
			Если Предзаказ.ФормироватьПоступлениеНаВиртуальныйСклад тогда
				ПриходныйОрдер = Документы.ПриходныйОрдерСклад.СоздатьДокумент();
				ПриходныйОрдер.ВидОперации 	= Перечисления.ВидыОперацийПриходСкладскойУчет.ОтПоставщика;
				ПриходныйОрдер.Поставщик	= Предзаказ.Поставщик;
				ПриходныйОрдер.Склад		= Справочники.Склады.НайтиПоКоду("000001835");
				ПриходныйОрдер.Основание	= ДанныеЗаполнения;
				ПриходныйОрдер.НомерДокументаПоставщика = "б/н";
				ПриходныйОрдер.Комментарий	= "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер);
				СтрокаДоб = ПриходныйОрдер.ЗаказыПоставщику.Добавить();
				СтрокаДоб.Документ = ДанныеЗаполнения;
				НужноПерепровестиОрдер = Истина;
			КонецЕсли;
		Иначе
			ПриходныйОрдер=МассивОрдеров[0].ПолучитьОбъект();
			//ПриходныйОрдер=Документы.ПриходныйОрдерСклад.СоздатьДокумент();
			Если ПриходныйОрдер.Дата<>Предзаказ.Дата
					ИЛИ ПриходныйОрдер.ПометкаУдаления<>Предзаказ.ПометкаУдаления
					ИЛИ ПриходныйОрдер.Товары.Итог("Количество")<>Предзаказ.Товары.Итог("Количество") тогда
				НужноПерепровестиОрдер = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НужноПерепровестиОрдер тогда
			ПриходныйОрдер.Дата=Предзаказ.Дата;
			ПриходныйОрдер.ДатаВремяЗаездаМашины=Предзаказ.Дата;
			ПриходныйОрдер.ВремяЗаездаМашины=Предзаказ.Дата+1;
			ПриходныйОрдер.ВремяОтпускаТовараПроизводителем=Предзаказ.Дата+1;
			ПриходныйОрдер.ДатаДокументаПоставщика=Предзаказ.Дата;
			//ПриходныйОрдер.ПометкаУдаления=Предзаказ.ПометкаУдаления;
			ПриходныйОрдер.Товары.Очистить();
			Если не Предзаказ.ПометкаУдаления тогда
			ТаблицаТоваров=Предзаказ.Товары.Выгрузить();
			ТаблицаТоваров.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения","Количество");
			Для каждого СтрТоваровПредзаказа Из ТаблицаТоваров Цикл
				СтрТоваровОрдера=ПриходныйОрдер.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТоваровОрдера,СтрТоваровПредзаказа);
				СтрТоваровОрдера.ЗаказПоставщику=ДанныеЗаполнения;
				СтрТоваровОрдера.ДатаПроизводства=Предзаказ.Дата;
			КонецЦикла; 
			КонецЕсли;
			ПриходныйОрдер.Записать(?(ПриходныйОрдер.ПометкаУдаления, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение));
		КонецЕсли;
	ИначеЕсли ЗапускИзЗаказа <> Неопределено тогда //заказ помечается на удаление, иначе шло бы по первому варианту
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"		, (Предзаказ.Дата - 30*24*3600));
		Запрос.УстановитьПараметр("Комментарий"	, "Создан автоматически по Предзаказу " + Строка(Предзаказ.Номер));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерСклад.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерСклад КАК ПриходныйОрдерСклад
		|ГДЕ
		|	ПриходныйОрдерСклад.Дата >= &Дата
		|	И ПриходныйОрдерСклад.Комментарий = &Комментарий";
		МассивОрдеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Для каждого СтрОрдеров Из МассивОрдеров Цикл
			ПриходныйОрдер = СтрОрдеров.ПолучитьОбъект();
			ПриходныйОрдер.Товары.Очистить();
			ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры