
//+++АК VERN 2016.08.19 ИП-00013332.001.00000001 

Функция _20170613_ПолучитьТаблицуДанных(Дата, Организация, Контрагент, РежимРаботы = "ПоставщикиТовара") Экспорт
	//Запрос = Новый Запрос;	
	//Запрос.УстановитьПараметр("Период", Дата);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Период"		, КонецДня(Дата));
	СтруктураПараметров.Вставить("Организация"	, Организация);
	
	//+++АК susk
	СтруктураПараметров.Вставить("Контрагент"	, Контрагент);
	
	//ЗапросКонтр = Новый Запрос;
	//ЗапросКонтр.Текст = "ВЫБРАТЬ
	//					|	Контрагенты.Ссылка
	//					|ИЗ
	//					|	Справочник.Контрагенты КАК Контрагенты
	//					|ГДЕ
	//					|	Контрагенты.СтатьяДвиженияДенежныхСредств.Код = ""120110""";
	//					
	//Выборка = ЗапросКонтр.Выполнить().Выбрать();
	//
	//МассивКонтр = Новый Массив;
	//
	//Если НЕ Контрагент.Пустая() Тогда
	//	Если Контрагент.СтатьяДвиженияДенежныхСредств.Код = "120110" Тогда
	//		МассивКонтр.Добавить(Контрагент);
	//	КонецЕсли;
	//Иначе	
	//	Пока Выборка.Следующий() Цикл
	//		МассивКонтр.Добавить(Выборка.Ссылка);
	//	КонецЦикла;
	//КонецЕсли;
	
	//	СтруктураПараметров.Вставить("СписокКонтр", МассивКонтр);
	
	СтруктураПараметров.Вставить("КонтрагентНеУказан"	, НЕ ЗначениеЗаполнено(Контрагент));
	СтруктураПараметров.Вставить("ОрганизацияНеУказана"	, НЕ ЗначениеЗаполнено(Организация));
	
	СтруктураПараметров.Вставить("СтатьяДДСВРасход"		, Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("120110"));
	//---АК susk
	
	Если РежимРаботы = "ПоставщикиТовара" Тогда
		//СтруктураПараметров.Вставить("СчетРасчетовСПоставщиками"			, ПланыСчетов.Финансовый.РасчетыСПоставщиками);
		//+++АК пмм 10.06.2017
		Счета = Новый Массив;
		Счета.Добавить(ПланыСчетов.Финансовый.РасчетыСПоставщиками);
		Счета.Добавить(ПланыСчетов.Финансовый.РасчетыСПрочимиПоставщикамиИПодрядчикамиФакторинг);
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщиками"	, Счета);
				
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиДляОплаты"	, ПланыСчетов.Финансовый.РасчетыСПоставщикамиИПодрядчиками);
		//СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиДляОплаты"	, ПланыСчетов.Финансовый.РасчетыСПрочимиПоставщикамиИПодрядчикамиФакторинг);
		
		//---АК пмм 10.06.2017
		
	Иначе
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщиками"			, ПланыСчетов.Финансовый.РасчетыСПоставщикамиУпаковки);
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиДляОплаты"	, ПланыСчетов.Финансовый.РасчетыСПоставщикамиУпаковки);
	КонецЕсли; 
	
	
	СтруктураПараметров.Вставить("Текст",
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ФинансовыйОстаткиИОбороты.Субконто1 КАК Справочник.Организации) КАК Организация,
	|	ВЫРАЗИТЬ(ФинансовыйОстаткиИОбороты.Субконто2 КАК Справочник.Контрагенты) КАК Контрагент,
	|	СУММА(ФинансовыйОстаткиИОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	РегистрБухгалтерии.Финансовый.Обороты(
	|			,
	|			&Период,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщиками),
	|			,
	|			ВЫБОР
	|					КОГДА &ОрганизацияНеУказана
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Субконто1 В (&Организация)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &КонтрагентНеУказан
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Субконто2 В (&Контрагент)
	|				КОНЕЦ,
	|			,
	|			) КАК ФинансовыйОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ФинансовыйОстаткиИОбороты.Субконто1 КАК Справочник.Организации),
	|	ВЫРАЗИТЬ(ФинансовыйОстаткиИОбороты.Субконто2 КАК Справочник.Контрагенты)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ФинансовыйОстаткиИОбороты.СуммаОборот) <> 0
	|		ИЛИ СУММА(ФинансовыйОстаткиИОбороты.СуммаОборот) = 0
	|			И СУММА(ВЫБОР
	|					КОГДА ФинансовыйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	МАКСИМУМ(ЕСТЬNULL(ОтсрочкапоОсновнымДоговорам.ДоговорКонтрагентаКоличествоДнейОтсрочки, ДоговорыКонтрагентов.КоличествоДнейОтсрочки)) КАК КоличествоДнейОтсрочки
	|ПОМЕСТИТЬ ВТ_Отсрочки
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОсновныеДоговораКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	|			ОсновныеДоговораКонтрагентовСрезПоследних.Организация КАК Организация,
	|			МАКСИМУМ(ОсновныеДоговораКонтрагентовСрезПоследних.ДоговорКонтрагента.КоличествоДнейОтсрочки) КАК ДоговорКонтрагентаКоличествоДнейОтсрочки
	|		ИЗ
	|			РегистрСведений.ОсновныеДоговораКонтрагентов.СрезПоследних(, ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ОсновныеДоговораКонтрагентовСрезПоследних
	|		ГДЕ
	|			ОсновныеДоговораКонтрагентовСрезПоследних.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеДоговораКонтрагентовСрезПоследних.Контрагент,
	|			ОсновныеДоговораКонтрагентовСрезПоследних.Организация) КАК ОтсрочкапоОсновнымДоговорам
	|		ПО ДоговорыКонтрагентов.Владелец = ОтсрочкапоОсновнымДоговорам.Контрагент
	|			И ДоговорыКонтрагентов.Организация = ОтсрочкапоОсновнымДоговорам.Организация
	|ГДЕ
	|	(ДоговорыКонтрагентов.Организация, ДоговорыКонтрагентов.Владелец) В
	|			(ВЫБРАТЬ
	|				ВТ_Контрагенты.Организация,
	|				ВТ_Контрагенты.Контрагент
	|			ИЗ
	|				ВТ_Контрагенты)
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И (ДоговорыКонтрагентов.СрокДействия > &Период
	|			ИЛИ ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасходИзБанка.Ссылка, ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)
	|				И ВложенныйЗапрос.СуммаКОплате = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Использование,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.СуммаОтгрузокЗаНеделю,
	|	ВложенныйЗапрос.СуммаОплатЗаНеделю,
	|	ВложенныйЗапрос.СуммаДолга,
	|	ВложенныйЗапрос.СуммаОтгрузокЗаПериодОтсрочки,
	|	ВложенныйЗапрос.СуммаКОплате,
	|	ЕСТЬNULL(ВТ_Отсрочки.КоличествоДнейОтсрочки, 0) КАК КоличествоДнейОтсрочки,
	|	РасходИзБанка.Ссылка КАК Документ,
	|	ЕСТЬNULL(РасходИзБанка.СуммаДокумента, 0) КАК ОплаченоФакт,
	|	ВложенныйЗапрос.СуммаОплатыПоставщика
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Организация КАК Организация,
	|		Контрагенты.Контрагент КАК Контрагент,
	|		СУММА(Отгрузка.СуммаОтгрузокЗаНеделю) КАК СуммаОтгрузокЗаНеделю,
	|		СУММА(Оплата.СуммаОплатЗаНеделю) КАК СуммаОплатЗаНеделю,
	|		СУММА(Долги.СуммаДолга) КАК СуммаДолга,
	|		СУММА(ОтгрузкаЗаПериодОтсрочки.СуммаОтгрузокЗаПериодОтсрочки) КАК СуммаОтгрузокЗаПериодОтсрочки,
	|		СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Долги.СуммаДолга, 0) - ЕСТЬNULL(ОтгрузкаЗаПериодОтсрочки.СуммаОтгрузокЗаПериодОтсрочки, 0) > 0
	|					ТОГДА ЕСТЬNULL(Долги.СуммаДолга, 0) - ЕСТЬNULL(ОтгрузкаЗаПериодОтсрочки.СуммаОтгрузокЗаПериодОтсрочки, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК СуммаКОплате,
	|		СУММА(ЕСТЬNULL(ВложенныйЗапрос.СуммаОплатыПоставщика, 0)) КАК СуммаОплатыПоставщика
	|	ИЗ
	|		ВТ_Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто1 КАК Справочник.Организации) КАК Организация,
	|				ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто2 КАК Справочник.Контрагенты) КАК Контрагент,
	|				-СУММА(ЕСТЬNULL(ФинансовыйОстатки.СуммаОстаток, 0)) КАК СуммаДолга
	|			ИЗ
	|				РегистрБухгалтерии.Финансовый.Остатки(&Период, Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщиками), , ) КАК ФинансовыйОстатки
	|			ГДЕ
	|				(ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто1 КАК Справочник.Организации) В (&Организация)
	|						ИЛИ &ОрганизацияНеУказана)
	|				И (ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто2 КАК Справочник.Контрагенты) В (&Контрагент)
	|						ИЛИ &КонтрагентНеУказан)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто1 КАК Справочник.Организации),
	|				ВЫРАЗИТЬ(ФинансовыйОстатки.Субконто2 КАК Справочник.Контрагенты)) КАК Долги
	|			ПО Контрагенты.Организация = Долги.Организация
	|				И Контрагенты.Контрагент = Долги.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации) КАК Организация,
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты) КАК Контрагент,
	|				СУММА(ЕСТЬNULL(ФинансовыйОборотыДтКт.СуммаОборот, 0)) КАК СуммаОтгрузокЗаПериодОтсрочки
	|			ИЗ
	|				РегистрБухгалтерии.Финансовый.ОборотыДтКт(, &Период, Регистратор, СчетДт.Код <> ""00"", , СчетКт В ИЕРАРХИИ (&СчетРасчетовСПоставщиками), , ) КАК ФинансовыйОборотыДтКт
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отсрочки КАК Отсрочки
	|					ПО ФинансовыйОборотыДтКт.СубконтоКт1 = Отсрочки.Организация
	|						И ФинансовыйОборотыДтКт.СубконтоКт2 = Отсрочки.Контрагент
	|			ГДЕ
	|				НАЧАЛОПЕРИОДА(ФинансовыйОборотыДтКт.Регистратор.Дата, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Отсрочки.КоличествоДнейОтсрочки, 0))
	|				И (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации) В (&Организация)
	|						ИЛИ &ОрганизацияНеУказана)
	|				И (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты) В (&Контрагент)
	|						ИЛИ &КонтрагентНеУказан)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации),
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты)) КАК ОтгрузкаЗаПериодОтсрочки
	|			ПО Контрагенты.Организация = ОтгрузкаЗаПериодОтсрочки.Организация
	|				И Контрагенты.Контрагент = ОтгрузкаЗаПериодОтсрочки.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации) КАК Организация,
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто2 КАК Справочник.Контрагенты) КАК Контрагент,
	|				СУММА(ЕСТЬNULL(ФинансовыйОбороты.СуммаОборотКт, 0)) КАК СуммаОтгрузокЗаНеделю
	|			ИЗ
	|				РегистрБухгалтерии.Финансовый.Обороты(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7), &Период, , Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщиками), , , , ) КАК ФинансовыйОбороты
	|			ГДЕ
	|				(ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации) В (&Организация)
	|						ИЛИ &ОрганизацияНеУказана)
	|				И (ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто2 КАК Справочник.Контрагенты) В (&Контрагент)
	|						ИЛИ &КонтрагентНеУказан)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации),
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто2 КАК Справочник.Контрагенты)) КАК Отгрузка
	|			ПО Контрагенты.Организация = Отгрузка.Организация
	|				И Контрагенты.Контрагент = Отгрузка.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации) КАК Организация,
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.КорСубконто2 КАК Справочник.Контрагенты) КАК Контрагент,
	|				СУММА(ЕСТЬNULL(ФинансовыйОбороты.СуммаОборотКт, 0)) КАК СуммаОплатЗаНеделю
	|			ИЗ
	|				РегистрБухгалтерии.Финансовый.Обороты(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7), &Период, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса)), , , КорСчет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты), ) КАК ФинансовыйОбороты
	|			ГДЕ
	|				(ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации) В (&Организация)
	|						ИЛИ &ОрганизацияНеУказана)
	|				И (ВЫРАЗИТЬ(ФинансовыйОбороты.КорСубконто2 КАК Справочник.Контрагенты) В (&Контрагент)
	|						ИЛИ &КонтрагентНеУказан)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.Организации),
	|				ВЫРАЗИТЬ(ФинансовыйОбороты.КорСубконто2 КАК Справочник.Контрагенты)) КАК Оплата
	|			ПО Контрагенты.Организация = Оплата.Организация
	|				И Контрагенты.Контрагент = Оплата.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации) КАК Организация,
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты) КАК Контрагент,
	|				СУММА(ЕСТЬNULL(ФинансовыйОборотыДтКт.СуммаОборот, 0)) КАК СуммаОплатыПоставщика
	|			ИЗ
	|				РегистрБухгалтерии.Финансовый.ОборотыДтКт(, &Период, , СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк)), , СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)), , ) КАК ФинансовыйОборотыДтКт
	|			ГДЕ
	|				(ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации) В (&Организация)
	|						ИЛИ &ОрганизацияНеУказана)
	|				И (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты) В (&Контрагент)
	|						ИЛИ &КонтрагентНеУказан)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт1 КАК Справочник.Организации),
	|				ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт2 КАК Справочник.Контрагенты)) КАК ВложенныйЗапрос
	|			ПО Контрагенты.Контрагент = ВложенныйЗапрос.Контрагент
	|				И Контрагенты.Организация = ВложенныйЗапрос.Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Контрагенты.Организация,
	|		Контрагенты.Контрагент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отсрочки КАК ВТ_Отсрочки
	|		ПО ВложенныйЗапрос.Организация = ВТ_Отсрочки.Организация
	|			И ВложенныйЗапрос.Контрагент = ВТ_Отсрочки.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзБанка КАК РасходИзБанка
	|		ПО ВложенныйЗапрос.Организация = РасходИзБанка.Организация
	|			И ВложенныйЗапрос.Контрагент = РасходИзБанка.Контрагент
	|			И (НЕ РасходИзБанка.ПометкаУдаления)
	|			И (НАЧАЛОПЕРИОДА(РасходИзБанка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
	|			И (РасходИзБанка.СтатьяДвиженияДенежныхСредств = &СтатьяДДСВРасход)
	//|			И (&СчетРасчетовСПоставщиками = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
	//|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
	//|				ИЛИ &СчетРасчетовСПоставщиками = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщиками)
	//|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки))
	|			И ( ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки) В (&СчетРасчетовСПоставщиками)
	|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
	|				ИЛИ  ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщиками) В (&СчетРасчетовСПоставщиками)
	|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Контрагент");
	
	Возврат ПолныеПрава.ВыполнитьЗапрос(СтруктураПараметров).Выгрузить();
	
КонецФункции

//---АК VERN 2016.08.19 ИП-00013332.001.00000001 

//+++АК ZEZA 20170613

Функция ПолучитьТаблицуДанных(Дата, Организация, Контрагент, РежимРаботы = "ПоставщикиТовара") Экспорт
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Период"		, КонецДня(Дата));
	СтруктураПараметров.Вставить("Организация"	, Организация);
	
	СтруктураПараметров.Вставить("Контрагент"	, Контрагент);
		
	МассивВидыСубконто = Новый Массив;
	МассивВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Организации);
	МассивВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	//+++АК POZM 2018.03.16 ИП-00018101 
	МассивВидыСубконтоФК = Новый Массив;
	МассивВидыСубконтоФК.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Организации);
	МассивВидыСубконтоФК.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивВидыСубконтоФК.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	//---АК POZM 
	
	//
	СтруктураПараметров.Вставить("ВидыСубконто", МассивВидыСубконто);
	СтруктураПараметров.Вставить("ВидыСубконтоФК", МассивВидыСубконтоФК);
	
	//
	СтруктураПараметров.Вставить("КонтрагентНеУказан"	, НЕ ЗначениеЗаполнено(Контрагент));
	СтруктураПараметров.Вставить("ОрганизацияНеУказана"	, НЕ ЗначениеЗаполнено(Организация));
	
	//+++АК POZM 2018.03.21 ИП-00018101 
	СтруктураПараметров.Вставить("СтатьяДДСВРасходФакторинг"		, Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("120111"));
	//---АК POZM 
	
	//---АК susk
	
	Если РежимРаботы = "ПоставщикиТовара" Тогда
		
		СтруктураПараметров.Вставить("СтатьяДДСВРасход"		, Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("120110"));
		//+++АК пмм 10.06.2017
		
		//
		Счета = Новый Массив;
		Счета.Добавить(ПланыСчетов.Финансовый.РасчетыСПоставщиками);
		Счета.Добавить(ПланыСчетов.Финансовый.РасчетыСПрочимиПоставщикамиИПодрядчикамиФакторинг);
		
		//
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщиками"			, ПланыСчетов.Финансовый.РасчетыСПоставщиками);
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиФК"			, ПланыСчетов.Финансовый.РасчетыСПрочимиПоставщикамиИПодрядчикамиФакторинг);
		
		//
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиДляОплаты"	, ПланыСчетов.Финансовый.РасчетыСПоставщикамиИПодрядчиками);
		
		//---АК пмм 10.06.2017
		//+++АК POZM 2018.03.22 ИП-00018101 
		СтруктураПараметров.Вставить("Текст",
		"ВЫБРАТЬ
		|	Таблица.Субконто1 КАК Организация,
		|	Таблица.Субконто2 КАК Контрагент,
		|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0) КАК СуммаДолга,
		|	МАКСИМУМ(ЕСТЬNULL(ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.КоличествоДнейОтсрочки, ДоговорыКонтрагентов.КоличествоДнейОтсрочки)) КАК КоличествоДнейОтсрочки,
		|	NULL КАК ДоговорФК
		|ПОМЕСТИТЬ ВТ_КонтрагентыИОтсрочки
		|ИЗ
		|	РегистрБухгалтерии.Финансовый.Остатки(
		|			&Период,
		|			Счет = &СчетРасчетовСПоставщиками,
		|			&ВидыСубконто,
		|			ВЫБОР
		|					КОГДА &ОрганизацияНеУказана
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто1 В (&Организация)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &КонтрагентНеУказан
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто2 В (&Контрагент)
		|				КОНЕЦ) КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговораКонтрагентов.СрезПоследних(&Период, ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ОтсрочкаПоОсновнымДоговорам
		|		ПО Таблица.Субконто1 = ОтсрочкаПоОсновнымДоговорам.Организация
		|			И Таблица.Субконто2 = ОтсрочкаПоОсновнымДоговорам.Контрагент
		|			И (ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров))
		|			И (ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.СрокДействия > &Период
		|				ИЛИ ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
		|			И (НЕ ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО Таблица.Субконто1 = ДоговорыКонтрагентов.Организация
		|			И Таблица.Субконто2 = ДоговорыКонтрагентов.Владелец
		|			И (ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров))
		|			И (ДоговорыКонтрагентов.СрокДействия > &Период
		|				ИЛИ ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
		|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Субконто1,
		|	Таблица.Субконто2,
		|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Субконто1,
		|	Таблица.Субконто2,
		|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0),
		|	МАКСИМУМ(ДоговорыКонтрагентов.КоличествоДнейОтсрочки),
		|	Таблица.Субконто3
		|ИЗ
		|	РегистрБухгалтерии.Финансовый.Остатки(
		|			&Период,
		|			Счет = &СчетРасчетовСПоставщикамиФК,
		|			&ВидыСубконтоФК,
		|			ВЫБОР
		|					КОГДА &ОрганизацияНеУказана
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто1 В (&Организация)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &КонтрагентНеУказан
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто2 В (&Контрагент)
		|				КОНЕЦ) КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО (Таблица.Субконто3 = ДоговорыКонтрагентов.ФакторинговаяКомпанияДоговор
		|					И Таблица.Субконто3 <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|				ИЛИ Таблица.Субконто3 = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|					И Таблица.Субконто1 = ДоговорыКонтрагентов.Организация
		|					И Таблица.Субконто2 = ДоговорыКонтрагентов.Владелец)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Субконто1,
		|	Таблица.Субконто2,
		|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0),
		|	Таблица.Субконто3
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.Субконто1 КАК Справочник.Организации) КАК Организация,
		|	ВЫРАЗИТЬ(Таблица.Субконто2 КАК Справочник.Контрагенты) КАК Контрагент,
		|	Таблица.Период КАК ПериодДень,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщиками
		|			ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОборот,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщиками
		|				И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
		//+++АК POZM 2018.08.09 ИП-00019333
		|				И НЕ Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		//---АК POZM 
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОборотКт_Отгрузка,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщиками
		|				И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		//+++АК POZM 2018.08.09 ИП-00019333
		|				И НЕ Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		//---АК POZM 
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОборотКт_ЗаНеделю,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|				И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотДт
		|		ИНАЧЕ 0
		|	КОНЕЦ 
		|КАК СуммаОборотДт_ОплатаЗаНеделю,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОборот_ОплатаПоставщика,
		|	NULL КАК ДоговорФК,
		//+++АК POZM 2018.08.09 ИП-00019432 
		|ВЫБОР
		|	КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|			И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|			И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|		ТОГДА Таблица.СуммаОборотКт
		|	ИНАЧЕ 0
		|КОНЕЦ КАК СуммаОборотКт_ВозвратОплатыЗаНеделю,
		|ВЫБОР
		|	КОГДА Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|			И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|		ТОГДА Таблица.СуммаОборотКт
		|	ИНАЧЕ 0
		|КОНЕЦ КАК СуммаОборотКт_ВозвратОплаты,
		|	ВЫБОР КОГДА Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотДт
		|		ИНАЧЕ 0
		|	КОНЕЦ 
		|КАК СуммаОборотДт_Оплата
		//---АК POZM 
		|ПОМЕСТИТЬ ТЗ_Обороты
		|ИЗ
		|	РегистрБухгалтерии.Финансовый.Обороты(
		|			ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -150),
		|			&Период,
		|			ДЕНЬ,
		|			Счет = &СчетРасчетовСПоставщиками
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
		|				ИЛИ Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты),
		|			&ВидыСубконто,
		|			(Субконто1, Субконто2) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Контрагент
		|				ИЗ
		|					ВТ_КонтрагентыИОтсрочки КАК Таблица),
		|			,
		|			) КАК Таблица
		|ГДЕ
		|	(ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
		|					ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
		|						И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
		|						И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|						И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|					ТОГДА Таблица.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
		|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.Субконто1 КАК Справочник.Организации),
		|	ВЫРАЗИТЬ(Таблица.Субконто2 КАК Справочник.Контрагенты),
		|	Таблица.Период,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщикамиФК
		|			ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщикамиФК
		|				И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
		//+++АК POZM 2018.08.09 ИП-00019333
		|				И НЕ Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		//---АК POZM 		
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = &СчетРасчетовСПоставщикамиФК
		|				И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		//+++АК POZM 2018.08.09 ИП-00019333
		|				И НЕ Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		//---АК POZM 
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|				И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотДт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотКт
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	Таблица.Субконто3,
		//+++АК POZM 2018.08.09 ИП-00019432 
		|ВЫБОР
		|	КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|			И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|			И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|		ТОГДА Таблица.СуммаОборотКт
		|	ИНАЧЕ 0
		|КОНЕЦ КАК СуммаОборотКт_ВозвратОплатыЗаНеделю,
		|ВЫБОР
		|	КОГДА Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|			И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|		ТОГДА Таблица.СуммаОборотКт
		|	ИНАЧЕ 0
		|КОНЕЦ КАК СуммаОборотКт_ВозвратОплаты,
		|	ВЫБОР КОГДА Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|			ТОГДА Таблица.СуммаОборотДт
		|		ИНАЧЕ 0
		|	КОНЕЦ 
		|КАК СуммаОборотДт_Оплата
		//---АК POZM 

		|ИЗ
		|	РегистрБухгалтерии.Финансовый.Обороты(
		|			ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -150),
		|			&Период,
		|			ДЕНЬ,
		|			Счет = &СчетРасчетовСПоставщикамиФК,
		|			&ВидыСубконтоФК,
		|			(Субконто1, Субконто2, Субконто3) В
		|				(ВЫБРАТЬ
		|					Таблица.Организация,
		|					Таблица.Контрагент,
		|					Таблица.ДоговорФК
		|				ИЗ
		|					ВТ_КонтрагентыИОтсрочки КАК Таблица),
		|			,
		|			) КАК Таблица
		|ГДЕ
		|	(ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщикамиФК)
		|					ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщикамиФК)
		|						И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщикамиФК)
		|						И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
		|						И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
		|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|					ТОГДА Таблица.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0
		|			ИЛИ ВЫБОР
		|				КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
		|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
		|					ТОГДА Таблица.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РасходИзБанка.Ссылка, ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)
		|				И Таблица.СуммаКОплате = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Использование,
		|	Таблица.Организация КАК Организация,
		|	Таблица.Контрагент КАК Контрагент,
		|	Таблица.СуммаОтгрузокЗаНеделю,
		|	Таблица.СуммаОплатЗаНеделю,
		|	Таблица.СуммаДолга,
		|	Таблица.СуммаОтгрузокЗаПериодОтсрочки,
		|	Таблица.СуммаКОплате,
		|	Таблица.СуммаОплатыПоставщика,
		|	ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0) КАК КоличествоДнейОтсрочки,
		|	ЕСТЬNULL(РасходИзБанка.Ссылка, ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)) КАК Документ,
		|	ЕСТЬNULL(РасходИзБанка.СуммаДокумента, 0) КАК ОплаченоФакт,
		|	Таблица.ДоговорФК КАК ДоговорПоРасчетамФакторинг,
		//+++АК POZM 2018.08.09 ИП-00019432 
		|	Таблица.СуммаОплатЗаПериодОтсрочки,
		|	Таблица.СуммаВозвратовОплатЗаПериодОтсрочки,
		|	Таблица.СуммаОборотКт_ВозвратОплатыЗаНеделю
		//---АК POZM 
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.Организация КАК Организация,
		|		Таблица.Контрагент КАК Контрагент,
		|		Таблица.КоличествоДнейОтсрочки КАК КоличествоДнейОтсрочки,
		|		Таблица.СуммаДолга КАК СуммаДолга,
		|		СУММА(ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
		|					ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК СуммаОтгрузокЗаПериодОтсрочки,
		|		ВЫБОР
		|			КОГДА Таблица.СуммаДолга - СУММА(ВЫБОР
		|						КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
		|							ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
		|						ИНАЧЕ 0
		|					КОНЕЦ) > 0
		
		|				ТОГДА Таблица.СуммаДолга - СУММА(ВЫБОР
		|							КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
		|								ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
		|							ИНАЧЕ 0
		|						КОНЕЦ)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаКОплате,
		|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_ЗаНеделю, 0)) КАК СуммаОтгрузокЗаНеделю,
		|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборотДт_ОплатаЗаНеделю, 0)) КАК СуммаОплатЗаНеделю,
		|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборот_ОплатаПоставщика, 0)) КАК СуммаОплатыПоставщика,
		|		Таблица.ДоговорФК КАК ДоговорФК,
		//+++АК POZM 2018.08.09 ИП-00019432 
		|		СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
		|				ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотДт_Оплата, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОплатЗаПериодОтсрочки,
		|		СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
		|				ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_ВозвратОплаты, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВозвратовОплатЗаПериодОтсрочки,
		|		СУММА(ТЗ_Обороты.СуммаОборотКт_ВозвратОплатыЗаНеделю) КАК СуммаОборотКт_ВозвратОплатыЗаНеделю
		//---АК POZM 
		|	ИЗ
		|		ВТ_КонтрагентыИОтсрочки КАК Таблица
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_Обороты КАК ТЗ_Обороты
		|			ПО Таблица.Организация = ТЗ_Обороты.Организация
		|				И Таблица.Контрагент = ТЗ_Обороты.Контрагент
		|				И (Таблица.ДоговорФК = ТЗ_Обороты.ДоговорФК
		|					ИЛИ Таблица.ДоговорФК ЕСТЬ NULL
		|						И ТЗ_Обороты.ДоговорФК ЕСТЬ NULL)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Таблица.Организация,
		|		Таблица.Контрагент,
		|		Таблица.КоличествоДнейОтсрочки,
		|		Таблица.СуммаДолга,
		|		Таблица.ДоговорФК) КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзБанка КАК РасходИзБанка
		|		ПО Таблица.Организация = РасходИзБанка.Организация
		|			И Таблица.Контрагент = РасходИзБанка.Контрагент
		|			И (НЕ РасходИзБанка.ПометкаУдаления)
		|			И (НАЧАЛОПЕРИОДА(РасходИзБанка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
		|			И (РасходИзБанка.СтатьяДвиженияДенежныхСредств = &СтатьяДДСВРасход
		|					И ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки) В (&СчетРасчетовСПоставщиками)
		|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
		|				ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщиками) В (&СчетРасчетовСПоставщиками)
		|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
		|				ИЛИ (РасходИзБанка.СтатьяДвиженияДенежныхСредств = &СтатьяДДСВРасходФакторинг
		|						И ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки) В (&СчетРасчетовСПоставщикамиФК)
		|						И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
		|					ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщиками) В (&СчетРасчетовСПоставщикамиФК)
		|						И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)))
		|			И (Таблица.ДоговорФК = РасходИзБанка.ДоговорКонтрагента
		|				ИЛИ Таблица.ДоговорФК ЕСТЬ NULL
		|				ИЛИ Таблица.ДоговорФК = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
		|			И (НЕ(РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
		|					ИЛИ РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю)))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Контрагент");
		//---АК POZM 
	Иначе
		СтруктураПараметров.Вставить("СтатьяДДСВРасход"						, Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("120210"));
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщиками"			, ПланыСчетов.Финансовый.РасчетыСПоставщикамиУпаковки);
		СтруктураПараметров.Вставить("СчетРасчетовСПоставщикамиДляОплаты"	, ПланыСчетов.Финансовый.РасчетыСПоставщикамиУпаковки);
		СтруктураПараметров.Вставить("Текст",
	//+++АК POZM 2018.03.21 ИП-00018101 
			"ВЫБРАТЬ
			|	Таблица.Субконто1 КАК Организация,
			|	Таблица.Субконто2 КАК Контрагент,
			|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0) КАК СуммаДолга,
			|	МАКСИМУМ(ЕСТЬNULL(ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.КоличествоДнейОтсрочки, ДоговорыКонтрагентов.КоличествоДнейОтсрочки)) КАК КоличествоДнейОтсрочки
			|ПОМЕСТИТЬ ВТ_КонтрагентыИОтсрочки
			|ИЗ
			|	РегистрБухгалтерии.Финансовый.Остатки(
			|			&Период,
			|			Счет В (&СчетРасчетовСПоставщиками),
			|			&ВидыСубконто,
			|			ВЫБОР
			|					КОГДА &ОрганизацияНеУказана
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Субконто1 В (&Организация)
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА &КонтрагентНеУказан
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Субконто2 В (&Контрагент)
			|				КОНЕЦ) КАК Таблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговораКонтрагентов.СрезПоследних(&Период, ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ОтсрочкаПоОсновнымДоговорам
			|		ПО Таблица.Субконто1 = ОтсрочкаПоОсновнымДоговорам.Организация
			|			И Таблица.Субконто2 = ОтсрочкаПоОсновнымДоговорам.Контрагент
			|			И (ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров))
			|			И (ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.СрокДействия > &Период
			|				ИЛИ ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
			|			И (НЕ ОтсрочкаПоОсновнымДоговорам.ДоговорКонтрагента.ПометкаУдаления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО Таблица.Субконто1 = ДоговорыКонтрагентов.Организация
			|			И Таблица.Субконто2 = ДоговорыКонтрагентов.Владелец
			|			И (ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровСПоставщиком.ПоставкаТоваров))
			|			И (ДоговорыКонтрагентов.СрокДействия > &Период
			|				ИЛИ ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
			|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Субконто1,
			|	Таблица.Субконто2,
			|	-ЕСТЬNULL(Таблица.СуммаОстаток, 0)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация,
			|	Контрагент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Таблица.Субконто1 КАК Справочник.Организации) КАК Организация,
			|	ВЫРАЗИТЬ(Таблица.Субконто2 КАК Справочник.Контрагенты) КАК Контрагент,
			|	Таблица.Период КАК ПериодДень,
			|	ВЫБОР
			|		КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|			ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаОборот,
			|	ВЫБОР
			|		КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|				И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
			|			ТОГДА Таблица.СуммаОборотКт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаОборотКт_Отгрузка,
			|	ВЫБОР
			|		КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|				И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
			|			ТОГДА Таблица.СуммаОборотКт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаОборотКт_ЗаНеделю,
			|	ВЫБОР
			|		КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
			|				И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
			|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
			|			ТОГДА Таблица.СуммаОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаОборотДт_ОплатаЗаНеделю,
			|	ВЫБОР
			|		КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
			|				И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
			|			ТОГДА Таблица.СуммаОборотКт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаОборот_ОплатаПоставщика
			|ПОМЕСТИТЬ ТЗ_Обороты
			|ИЗ
			|	РегистрБухгалтерии.Финансовый.Обороты(
			|			ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -150),
			|			&Период,
			|			ДЕНЬ,
			|			Счет В (&СчетРасчетовСПоставщиками)
			|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
			|				ИЛИ Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты),
			|			&ВидыСубконто,
			|			(Субконто1, Субконто2) В
			|				(ВЫБРАТЬ
			|					Таблица.Организация,
			|					Таблица.Контрагент
			|				ИЗ
			|					ВТ_КонтрагентыИОтсрочки КАК Таблица),
			|			,
			|			) КАК Таблица
			|ГДЕ
			|	(ВЫБОР
			|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|					ТОГДА Таблица.СуммаОборотДт + Таблица.СуммаОборотКт
			|				ИНАЧЕ 0
			|			КОНЕЦ <> 0
			|			ИЛИ ВЫБОР
			|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|						И НЕ Таблица.КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Вспомогательный)
			|					ТОГДА Таблица.СуммаОборотКт
			|				ИНАЧЕ 0
			|			КОНЕЦ <> 0
			|			ИЛИ ВЫБОР
			|				КОГДА Таблица.Счет В (&СчетРасчетовСПоставщиками)
			|						И НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
			|					ТОГДА Таблица.СуммаОборотКт
			|				ИНАЧЕ 0
			|			КОНЕЦ <> 0
			|			ИЛИ ВЫБОР
			|				КОГДА НАЧАЛОПЕРИОДА(Таблица.Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -7)
			|						И Таблица.Счет В ИЕРАРХИИ (&СчетРасчетовСПоставщикамиДляОплаты)
			|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
			|					ТОГДА Таблица.СуммаОборотДт
			|				ИНАЧЕ 0
			|			КОНЕЦ <> 0
			|			ИЛИ ВЫБОР
			|				КОГДА Таблица.Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПокупателямиПрочие)
			|						И Таблица.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк), ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Касса))
			|					ТОГДА Таблица.СуммаОборотКт
			|				ИНАЧЕ 0
			|			КОНЕЦ <> 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РасходИзБанка.Ссылка, ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)
			|				И Таблица.СуммаКОплате = 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Использование,
			|	Таблица.Организация КАК Организация,
			|	Таблица.Контрагент КАК Контрагент,
			|	Таблица.СуммаОтгрузокЗаНеделю,
			|	Таблица.СуммаОплатЗаНеделю,
			|	Таблица.СуммаДолга,
			|	Таблица.СуммаОтгрузокЗаПериодОтсрочки,
			|	Таблица.СуммаКОплате,
			|	Таблица.СуммаОплатыПоставщика,
			|	ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0) КАК КоличествоДнейОтсрочки,
			|	ЕСТЬNULL(РасходИзБанка.Ссылка, ЗНАЧЕНИЕ(Документ.РасходИзБанка.ПустаяСсылка)) КАК Документ,
			|	ЕСТЬNULL(РасходИзБанка.СуммаДокумента, 0) КАК ОплаченоФакт
			|ИЗ
			|	(ВЫБРАТЬ
			|		Таблица.Организация КАК Организация,
			|		Таблица.Контрагент КАК Контрагент,
			|		Таблица.КоличествоДнейОтсрочки КАК КоличествоДнейОтсрочки,
			|		Таблица.СуммаДолга КАК СуммаДолга,
			|		СУММА(ВЫБОР
			|				КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
			|					ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ) КАК СуммаОтгрузокЗаПериодОтсрочки,
			|		ВЫБОР
			|			КОГДА Таблица.СуммаДолга - СУММА(ВЫБОР
			|						КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
			|							ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
			|						ИНАЧЕ 0
			|					КОНЕЦ) > 0
			|				ТОГДА Таблица.СуммаДолга - СУММА(ВЫБОР
			|							КОГДА НАЧАЛОПЕРИОДА(ТЗ_Обороты.ПериодДень, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -ЕСТЬNULL(Таблица.КоличествоДнейОтсрочки, 0))
			|								ТОГДА ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_Отгрузка, 0)
			|							ИНАЧЕ 0
			|						КОНЕЦ)
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК СуммаКОплате,
			|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборотКт_ЗаНеделю, 0)) КАК СуммаОтгрузокЗаНеделю,
			|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборотДт_ОплатаЗаНеделю, 0)) КАК СуммаОплатЗаНеделю,
			|		СУММА(ЕСТЬNULL(ТЗ_Обороты.СуммаОборот_ОплатаПоставщика, 0)) КАК СуммаОплатыПоставщика
			|	ИЗ
			|		ВТ_КонтрагентыИОтсрочки КАК Таблица
			|			ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_Обороты КАК ТЗ_Обороты
			|			ПО Таблица.Организация = ТЗ_Обороты.Организация
			|				И Таблица.Контрагент = ТЗ_Обороты.Контрагент
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Таблица.Организация,
			|		Таблица.Контрагент,
			|		Таблица.КоличествоДнейОтсрочки,
			|		Таблица.СуммаДолга) КАК Таблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзБанка КАК РасходИзБанка
			|		ПО Таблица.Организация = РасходИзБанка.Организация
			|			И Таблица.Контрагент = РасходИзБанка.Контрагент
			|			И (НЕ РасходИзБанка.ПометкаУдаления)
			|			И (НАЧАЛОПЕРИОДА(РасходИзБанка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
			|			И (РасходИзБанка.СтатьяДвиженияДенежныхСредств = &СтатьяДДСВРасход)
			|			И (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки) В (&СчетРасчетовСПоставщиками)
			|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки)
			|				ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщиками) В (&СчетРасчетовСПоставщиками)
			|					И РасходИзБанка.СчетУчетаРасчетовСКонтрагентом <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыСПоставщикамиУпаковки))
			|			И (НЕ(РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
			|					ИЛИ РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю)))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	Контрагент");
	КонецЕсли; 
				
	//---АК POZM 
	Возврат ПолныеПрава.ВыполнитьЗапрос(СтруктураПараметров).Выгрузить();
	
КонецФункции

//---АК ZEZA 20170613