
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	настройкиСКД = КомпоновщикНастроек.Настройки;
	настройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ТЗ", ТЗ);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Получение самой СКД из макета
	СхемаКомпоновкиДанных = Отчеты.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Связь между таблицей значений и именами в СКД
	ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("ТЗ_ФактическаяМаржа", ТЗ_ФактическаяМаржа);
	
	//Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД, ДанныеРасшифровкиОтчета );
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровкиОтчета);
	
	//Вывод результата
	//ДокументРезультат = ЭлементыФормы.Результат;
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.Очистить(); 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	
	//Построить_Отчет();
КонецПроцедуры


//&НаСервере
//Функция Построить_Отчет() 
//	
//	//Получение настроек СКД из компоновщика
//	
//		
//	Возврат ДокументРезультат;
//	
//КонецФункции
