
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр БлокированныеТоварыДляПриемки
	Движения.БлокированныеТоварыДляПриемки.Записывать = Истина;
	Движения.БлокированныеТоварыДляПриемки.Очистить();
	
	Склад1=Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000231"); 	
	Склад2=Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000243"); 	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ЗначениеЗаполнено(ТекСтрокаТовары.Склад) Тогда
		
			Движение = Движения.БлокированныеТоварыДляПриемки.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.ДатаПроизводства = ТекСтрокаТовары.ДатаПроизводства;
			Движение.Заблокирован = ТекСтрокаТовары.Заблокирован;
			Движение.Склад = ТекСтрокаТовары.Склад;
			Движение.Причина = ТекСтрокаТовары.Причина;
		Иначе	
			Движение = Движения.БлокированныеТоварыДляПриемки.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.ДатаПроизводства = ТекСтрокаТовары.ДатаПроизводства;
			Движение.Заблокирован = ТекСтрокаТовары.Заблокирован;
			Движение.Склад = Склад1;
			Движение.Причина = ТекСтрокаТовары.Причина;
			
			Движение = Движения.БлокированныеТоварыДляПриемки.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.ДатаПроизводства = ТекСтрокаТовары.ДатаПроизводства;
			Движение.Заблокирован = ТекСтрокаТовары.Заблокирован;
			Движение.Склад = Склад2;
			Движение.Причина = ТекСтрокаТовары.Причина;
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры
