////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//+++АК mika 2018.07.31 ИП-00019374
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ВодительскоеНомер) И ЗначениеЗаполнено(Владелец) 
				И ПроверитьНаличиеВодительскогоУдостоверения(Ссылка, ВодительскоеНомер, Владелец) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет наличие контантного лица по указанному номеру водительского удостоверения и контрагенту //+++АК mika 2018.07.31 ИП-00019374
//
// Параметры:
//  КонтактноеЛицо - <Тип.СпарвочникСсылка.КонтактныеЛицаКонтрагентов> - Контактное лицо (водитель)
//  ВодительскоеНомер  - <Тип.Число> - Номер удостоверения
//  Контаргент  - <Тип.СправочникСсылка.Контрагенты> - Контрагент
//
// Возвращаемое значение:
//   <Тип.Булево>   - Истина, Ложь
//
Функция ПроверитьНаличиеВодительскогоУдостоверения(КонтактноеЛицо, ВодительскоеНомер, Контаргент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаКонтрагентов.Код КАК КодЛица,
	|	КонтактныеЛицаКонтрагентов.Наименование,
	|   КонтактныеЛицаКонтрагентов.ВодительскоеНомер КАК ВодительскоеНомер,
	|	КонтактныеЛицаКонтрагентов.Должность КАК ТекущаяДолжность,
    |	КонтактныеЛицаКонтрагентов.Владелец	
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|ГДЕ
	|	КонтактныеЛицаКонтрагентов.Владелец = &Владелец
	|	И КонтактныеЛицаКонтрагентов.ВодительскоеНомер = &ВодительскоеНомер
	|	И КонтактныеЛицаКонтрагентов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Контаргент);
	Запрос.УстановитьПараметр("ВодительскоеНомер", ВодительскоеНомер);
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекстУведомления = "В базе уже есть контактное лицо с номером удостоверения ВодительскоеНомер!
		                    |Код: КодЛица, ФИО: Наименование, Должность: ТекущаяДолжность 
							|Запись невозможна!";
							
		Выборка = Результат.Выбрать();
		
		Выборка.Следующий();
		
		Для каждого Колонка Из Результат.Колонки Цикл
			ТекстУведомления = СтрЗаменить(ТекстУведомления,Колонка.Имя, Выборка[Колонка.Имя]);      
		КонецЦикла;
		
		Сообщить(ТекстУведомления);
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ПроверитьНаличиеВодительскогоУдостоверения()
