
&НаСервере
Процедура ИспользоватьПоУмолчаниюНаСервере(ТС)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЙ_НастройкиAPI.Ссылка,
	|	МЙ_НастройкиAPI.ИспользоватьПоУмолчанию
	|ИЗ
	|	Справочник.МЙ_НастройкиAPI КАК МЙ_НастройкиAPI";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		тд=ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
		Если тд.ссылка=тс.ССылка Тогда
			тд.ИспользоватьПоУмолчанию=Истина;
		Иначе
			тд.ИспользоватьПоУмолчанию=Ложь;
		КонецЕсли;
		
		тд.Записать();
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПоУмолчанию(Команда)
	тс=Элементы.Список.ТекущаяСтрока;
	Если тс.ссылка.Пустая() Тогда
		Сообщить("Выберите строку настройки");
	Иначе
		ИспользоватьПоУмолчаниюНаСервере(ТС);
		
	КонецЕсли;
	ЭтаФорма.ОтобразитьИзменениеДанных(тс.ссылка,ВидИзмененияДанных.Изменение);
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
