
Функция ВГО(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО (Контрагенты.ИНН = Организации.ИНН)
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка
	               |	И Организации.ИНН <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции
