
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаВыполнения=ТекущаяДата();
	Обработки.МП_ЗаполнениеПроцентыТайногоПокупателя.ЗаполнитьСписокМагазинов(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере() Экспорт

	Обработки.МП_ЗаполнениеПроцентыТайногоПокупателя.СформироватьНаСервере(Объект);

КонецПроцедуры // СформироватьНаСервере()


