
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.ДниНедели.Количество() = 0 Тогда
			Для н = 0 По 6 Цикл
				СтрокаТаб = Объект.ДниНедели.Добавить();
				СтрокаТаб.ДеньНедели = н;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	//Объект.ДниНедели.Сортировать("ДеньНедели");
	//Объект.ПредставлениеГрафика = "";
	//ЧастьТекста = "";
	//ПредНач = Неопределено;
	//ПредКон = Неопределено;
	//Для Каждого СтрокаТаб Из Объект.ДниНедели Цикл
	//	Если СтрокаТаб.ВремяНачала <> ПредНач
	//		И СтрокаТаб.ВремяОкончания <> ПредКон Тогда
	//		Объект.ПредставлениеГрафика = Объект.ПредставлениеГрафика + ?(Значение) + ЧастьТекста
	//	КонецЕсли;
	//	ПредНач = СтрокаТаб.ВремяНачала;
	//	ПредКон = СтрокаТаб.ВремяОкончания02;
	//КонецЦикла;	
	
КонецПроцедуры
