
&НаКлиенте
Процедура РедактироватьПериод(Команда)
	
	СтандартныйПериод = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = СтандартныйПериод;
	Если ДиалогРедактирования.Редактировать() Тогда
		СтандартныйПериод = ДиалогРедактирования.Период;
		Объект.ДатаНачала = СтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеПоГрафикам()
	
	Набор = РегистрыСведений.ТабельРаботыПродавцов.СоздатьНаборЗаписей();
	Набор.Записать();
	
	МассивФайлов = НайтиФайлы(ИмяФайла, "*.mxl");
	
	Для Каждого ЭлементФайла Из МассивФайлов Цикл
		ТабДок = Новый ТабличныйДокумент();
		ТабДок.Прочитать(ЭлементФайла.ПолноеИмя);
		
		КоличествоПустых = 0; 
		СтрокаФайла = 2;
		СтолбецДата = 1;
		СтолбецНомерПродавца = 3;
		СтолбецНаименованиеТТ = 4;
		СтолбецГруппа = 5;
		
		//Иксель.DisplayAlerts = False; 
		//Иксель.EnableAutoComplete = False; 
		//Иксель.WorkBooks.Open(ИмяФайла);
		//
		//Книга = Иксель.WorkBooks.Item(1);
		//Лист = Книга.Sheets.Item(1);
		//
		//ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		
		ТаблицаКОбработке.Очистить();
		
		Для СтрокаФайла = 2 По ТабДок.ВысотаТаблицы Цикл
			Если ТабДок.Область(СтрокаФайла, СтолбецНомерПродавца, СтрокаФайла, СтолбецНомерПродавца).Текст <> "" Тогда 
				
				Дата = ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст;
				Попытка
					Дата = Дата("20" + Прав(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 2), Сред(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 4, 2), Лев(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 2));
				Исключение
					Дата = '00010101';
				КонецПопытки;	
				Если ТипЗнч(Дата) <> Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;	
				Если Дата < НачалоДня(Объект.ДатаНачала)
					ИЛИ Дата > КонецДня(Объект.ДатаОкончания) Тогда
					СтрокаФайла = СтрокаФайла + 1;
					КоличествоПустых = 0;
					Продолжить;
				КонецЕсли;
				СтрокаТаб = ТаблицаКОбработке.Добавить();
				СтрокаТаб.Дата = Дата;
				Попытка
					СтрокаТаб.НомерПродавца = Число(СокрЛП(ТабДок.Область(СтрокаФайла, СтолбецНомерПродавца, СтрокаФайла, СтолбецНомерПродавца).Текст));
				Исключение
					СтрокаТаб.НомерПродавца = 0;
				КонецПопытки;	
				СтрокаТаб.НаименованиеТТ = СокрЛП(ТабДок.Область(СтрокаФайла, СтолбецНаименованиеТТ, СтрокаФайла, СтолбецНаименованиеТТ).Текст);
				СтрокаТаб.Группа = СокрЛП(ТабДок.Область(СтрокаФайла, СтолбецГруппа, СтрокаФайла, СтолбецГруппа).Текст);
				
			КонецЕсли;
			//Если СтрокаФайла % 1000 = 0 Тогда
			//	Состояние("Обработано " + СтрокаФайла + " из " + ВсегоСтрок);
			//КонецЕсли;	
		КонецЦикла;
		
		КодыПродавцов = ЗначениеИзФайла("\\10.0.0.40\Shared2\test\Prodavci.dat");
		
		//здесь по идее надо бы за загружаемое число вычищать записи
		//но регистр может заполняться не только загрузкой, поэтому не очищаю
		
		Для Каждого СтрокаТаб Из ТаблицаКОбработке Цикл
			Если СтрокаТаб.Дата < НачалоДня(Объект.ДатаНачала)
				ИЛИ СтрокаТаб.Дата > КонецДня(Объект.ДатаОкончания) Тогда
				Продолжить;
			КонецЕсли;	
			Если ПустаяСтрока(СтрокаТаб.НаименованиеТТ) Тогда
				Продолжить;
			КонецЕсли;	
			ТоргТочка = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию(СтрокаТаб.НаименованиеТТ);
			Если ТоргТочка.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТаб.НомерПродавца) Тогда
				Продолжить;
			КонецЕсли;	
			СтрокаПродавецАйди = КодыПродавцов.Найти(СтрокаТаб.НомерПродавца, "id_prod");
			Если СтрокаПродавецАйди = Неопределено
				ИЛИ Не ЗначениеЗаполнено(СтрокаПродавецАйди._C8_code) Тогда
				Продолжить;
			КонецЕсли;	
			Продавец = Справочники.ФизическиеЛица.НайтиПоКоду(Прав("0000000000" + Формат(СтрокаПродавецАйди._C8_code, "ЧГ=0"), 10));
			Если Продавец.Пустая() Тогда
				Продолжить;
			КонецЕсли;	
			
			Запись = РегистрыСведений.ТабельРаботыПродавцов.СоздатьМенеджерЗаписи();
			Запись.ТорговаяТочка = ТоргТочка;
			Запись.Сотрудник = Продавец;
			Запись.Период = СтрокаТаб.Дата;
			Если ЗначениеЗаполнено(СтрокаТаб.Группа) Тогда
				Запись.Группа = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию(СтрокаТаб.Группа, Истина);
			КонецЕсли;	
			Запись.Записать();
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Состояние("Идет обработка данных графиков работы");
	
	////Иксель = Новый COMОбъект("Excel.Application");
	////Файл   = Новый Файл(ИмяФайла);
	//
	//ТабДок = Новый ТабличныйДокумент();
	//ТабДок.Прочитать(ИмяФайла);
	//
	//КоличествоПустых = 0; 
	//СтрокаФайла = 2;
	//СтолбецДата = 1;
	//СтолбецНомерПродавца = 3;
	//СтолбецНаименованиеТТ = 4;
	//
	////Иксель.DisplayAlerts = False; 
	////Иксель.EnableAutoComplete = False; 
	////Иксель.WorkBooks.Open(ИмяФайла);
	////
	////Книга = Иксель.WorkBooks.Item(1);
	////Лист = Книга.Sheets.Item(1);
	////
	////ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	//
	//ТаблицаКОбработке.Очистить();
	//
	//Для СтрокаФайла = 2 По ТабДок.ВысотаТаблицы Цикл
	//	Если ТабДок.Область(СтрокаФайла, СтолбецНомерПродавца, СтрокаФайла, СтолбецНомерПродавца).Текст <> "" Тогда 
	//		
	//		Дата = ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст;
	//		Попытка
	//			Дата = Дата(Прав(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 2), Сред(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 4, 2), Лев(ТабДок.Область(СтрокаФайла, СтолбецДата, СтрокаФайла, СтолбецДата).Текст, 2));
	//		Исключение
	//			Дата = '00010101';
	//		КонецПопытки;	
	//		Если ТипЗнч(Дата) <> Тип("Дата") Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		Если Дата < НачалоДня(Объект.ДатаНачала)
	//			ИЛИ Дата > КонецДня(Объект.ДатаОкончания) Тогда
	//			СтрокаФайла = СтрокаФайла + 1;
	//			КоличествоПустых = 0;
	//			Продолжить;
	//		КонецЕсли;
	//		СтрокаТаб = ТаблицаКОбработке.Добавить();
	//		СтрокаТаб.Дата = Дата;
	//		Попытка
	//			СтрокаТаб.НомерПродавца = Число(СокрЛП(ТабДок.Область(СтрокаФайла, СтолбецНомерПродавца, СтрокаФайла, СтолбецНомерПродавца).Текст));
	//		Исключение
	//			СтрокаТаб.НомерПродавца = 0;
	//		КонецПопытки;	
	//		СтрокаТаб.НаименованиеТТ = СокрЛП(ТабДок.Область(СтрокаФайла, СтолбецНаименованиеТТ, СтрокаФайла, СтолбецНаименованиеТТ).Текст);
	//		
	//	КонецЕсли;
	//	//Если СтрокаФайла % 1000 = 0 Тогда
	//	//	Состояние("Обработано " + СтрокаФайла + " из " + ВсегоСтрок);
	//	//КонецЕсли;	
	//КонецЦикла;
	//
	//////Исключение
	////Иксель.quit();
	////
	////Иксель = Неопределено;
	////Книга  = Неопределено;
	////Лист   = Неопределено;
	
	ЗагрузитьДанныеПоГрафикам();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаНачала = ТекущаяДата();
	Объект.ДатаОкончания = ТекущаяДата();
	
КонецПроцедуры

Процедура ВыгрузитьДанныеСервер()
	
	СтрСоединенияДанныеТовародвижение = ОбменСAccess.ПолучитьСтрокуСоединения("ДанныеТовародвижение");
	
	пСоед = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	пСоед.СтрокаСоединения= СтрСоединенияДанныеТовародвижение;
	ВнешниеИсточникиДанных.ДанныеТовародвижение.УстановитьОбщиеПараметрыСоединения(пСоед);
	ВнешниеИсточникиДанных.ДанныеТовародвижение.УстановитьСоединение();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Prodavci._C8_code,
	|	Prodavci.id_prod,
	|	Prodavci.first_day_work
	|ИЗ
	|	ВнешнийИсточникДанных.ДанныеТовародвижение.Таблица.Prodavci КАК Prodavci";
	
	КодыПродавцов = Запрос.Выполнить().Выгрузить();
	
	ВнешниеИсточникиДанных.ДанныеТовародвижение.РазорватьСоединение();
	
	ЗначениеВФайл("\\10.0.0.40\Shared2\test\Prodavci.dat", КодыПродавцов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	ВыгрузитьДанныеСервер();
	
КонецПроцедуры
