
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК mika 2018.01.23 ИП-00017263.02 Назначение ограничения уже никто не помнит (Попросили снять) 
	//ЭтаФорма.ТолькоПросмотр = НЕ (ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Скворцов Павел")
	//								ИЛИ РольДоступна("ПолныеПрава"));
	//---АК mika
	
	//+++АК mika 2018.01.26 ИП-00017263.02 Только корректно заполненные контрагенты	
	ЗаполнитьСписокВыбораКонтрагентСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) //+++АК mika 2018.01.23 ИП-00017263.02
	
	//+++АК mika 2018.01.26 ИП-00017263.02 Только корректно заполненные контрагенты
	//СтандартнаяОбработка = Ложь;
	//
	//ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУправляемая", Новый Структура("Аутсорс"),Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораКонтрагентСервер()//+++АК mika 2018.01.26 ИП-00017263.02
	
	МассивКонтрагентов = Справочники.СотрудникиАутсорсинг.ПолучитьКонтрагентовПредоставляющихАутсорсУслуги(Неопределено);
	
	Для каждого ЭлементМассива Из МассивКонтрагентов Цикл
		Элементы.Контрагент.СписокВыбора.Добавить(ЭлементМассива,ЭлементМассива);
	КонецЦикла;
	
КонецФункции