//+++АК VERN 2016.08.10 ИП-00013306.001.00000001
&НаКлиенте
Процедура УведомлятьТехнологаПриРассылкеПриИзменении(Элемент)
	Объект.УведомлятьПоставщикаПриРассылке=?(Объект.УведомлятьТехнологаПриРассылке,Истина,Объект.УведомлятьПоставщикаПриРассылке);
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьПоставщикаПриРассылкеПриИзменении(Элемент)
	Объект.УведомлятьТехнологаПриРассылке=?(Объект.УведомлятьПоставщикаПриРассылке,Истина,Объект.УведомлятьТехнологаПриРассылке);
КонецПроцедуры
//---АК VERN 2016.08.10 ИП-00013306.001.00000001