
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Финансовый.Записывать = Истина;
	
	Для Каждого Строка Из Услуги Цикл
		Проводка 									= Движения.Финансовый.Добавить();
		Проводка.Период 							= Дата;
		Проводка.СчетДт 							= ПланыСчетов.Финансовый.ЗатратыОбщиеДляРаспределения; //44.2
		Проводка.СубконтоДт.ТорговыеТочки 			= Строка.СтруктурнаяЕдиница;
		Проводка.СубконтоДт.СтатьиДоходовРасходов 	= Строка.СтатьяДР;
		Проводка.СубконтоДт.ЦФО 					= Строка.ЦФО;
		Проводка.СчетКт 							= Строка.СчетКт;
		Проводка.СубконтоКт.Организации 			= Организация;
		Проводка.СубконтоКт.Контрагенты 			= Строка.Контрагент;
		Проводка.Сумма 								= Строка.Сумма;
		Проводка.Содержание 						= Строка.Описание;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация");
		Отказ = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Для Каждого Строка Из Услуги Цикл
		Если Строка.Документ.ЦФО <> Строка.ЦФО Тогда
			обДок = Строка.Документ.ПолучитьОбъект();
			обДок.ЦФО = Строка.ЦФО;
			Попытка
				обДок.Записать(?(обДок.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		Если Строка.Документ.СтатьяДвиженияДенежныхСредств <> Строка.СтатьяДДС Тогда
			обДок = Строка.Документ.ПолучитьОбъект();
			обДок.СтатьяДвиженияДенежныхСредств = Строка.СтатьяДДС;
			Попытка
				обДок.Записать(?(обДок.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

