Функция КоличествоВМешке(Ссылка,Номинал) Экспорт 

	КоличествоВМешке = Номинал.КоличествоВМешке;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.БанкВносительИнкассация КАК БанкВноситель,
	|	СтруктурныеЕдиницы.БанкВносительИнкассация.Город КАК ГородБанка,
	|	СтруктурныеЕдиницы.ИнкассируемыйБанк  КАК ИнкассируемыйБанк
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Отбор = Новый Структура();
		Отбор.Вставить("ИнкассируемыйБанк",Выборка.ИнкассируемыйБанк);
		
		Если ЗначениеЗаполнено(Выборка.БанкВноситель) и Выборка.ГородБанка <> "Г. МОСКВА" Тогда 
			Отбор.Вставить("ВариантШаблона","Регион");
		Иначе 
			Отбор.Вставить("ВариантШаблона","");
		КонецЕсли;
		
		
		РезПоискаКаталога = Номинал.КоличествоВМешкеПоИнкассаторам.НайтиСтроки(Отбор);
		Если РезПоискаКаталога.Количество() <> 0 Тогда
			КоличествоВМешке = РезПоискаКаталога[0].КоличествоВМешке;
		КонецЕсли; 	
	Конецесли;
	
	
	
Возврат КоличествоВМешке;
КонецФункции // ()
