
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ПараметрКоманды.ОтчетСформирован Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет не сформирован!";
		Сообщение.Сообщить();	
		
		Возврат;
	
	КонецЕсли;
	
	ТабДок = Печать(ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция Печать(ПараметрКоманды)
	Возврат Документы.ПриказОПроведениеМероприятия.ОтчетМероприятий(ПараметрКоманды,Новый ТабличныйДокумент);
КонецФункции
