
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РекламныеМатериалыВМагазинах.Записывать = Истина;
	Движения.РекламныеМатериалыВМагазинах.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ВидДвижения = 0 Тогда
			Движение = Движения.РекламныеМатериалыВМагазинах.ДобавитьПриход();
		Иначе
			Движение = Движения.РекламныеМатериалыВМагазинах.ДобавитьРасход();
		КонецЕсли;	
		Движение.Период = Дата;
		Движение.Магазин = ТорговаяТочка;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
