
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Запись.КтоЗвонил) И Запись.КтоЗвонил <> ПолучитьТекпользователя()  Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.КтоЗвонил)  Тогда
		Запись.КтоЗвонил = ПолучитьТекпользователя();
		Запись.ДатаЗвонка = ТекущаяДата();
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекпользователя()
	
	Возврат СокрЛП(ПараметрыСеанса.ТекущийПользователь);	
	
КонецФункции	

&НаСервере
Функция лкПередЗаписьюНаСервере()
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.КтоЗвонил) Тогда
		
		Запись.КтоЗвонил = СокрЛП(ПараметрыСеанса.ТекущийПользователь); 	
		Запись.ДатаЗвонка = ТекущаяДата();
		
	Иначе
		
		Если СокрЛП(ПараметрыСеанса.ТекущийПользователь) <> СокрЛП(Запись.КтоЗвонил) Тогда
			
			Сообщить("Этот покупатель уже обрабатывается другим оператором. Запись невозможна.");
			
			Отказ = Истина;
			
		Иначе	
			
						
		КонецЕсли;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.id_3p) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ОбращенияКПокупателям.id_3p КАК id_3p
				|ИЗ
				|	РегистрСведений.ОбращенияКПокупателям КАК ОбращенияКПокупателям
				|
				|УПОРЯДОЧИТЬ ПО
				|	id_3p УБЫВ";
				
				Результат = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				ТекЗапись = 0;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ТекЗапись = ВыборкаДетальныеЗаписи.id_3p;
				КонецЦикла;
				
				Запись.id_3p = ТекЗапись+1;
				
	КонецЕсли;

	// +++ АК CHUM 20.09.2017 0-00017062
	Если Не ЗначениеЗаполнено(Запись.АК_ВзялЛиТрубкуПокупатель) Тогда
		Сообщить("Поле ""Взял ли трубку покупатель"" должно быть заполнено!");
		
		Отказ = Истина;
	КонецЕсли;
	// --- АК
	
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = лкПередЗаписьюНаСервере();
КонецПроцедуры
