
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент=ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Контрагент;
    Если ЗначениеЗаполнено(Контрагент) Тогда
		Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подрядчик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.ПравоеЗначение = Контрагент;
		Элемент.Использование = Истина;
	КонецЕсли; 
КонецПроцедуры
