
&НаСервереБезКонтекста
Функция ПолучитьПеревозчикаМаршрута(мМаршрут)
	
	Возврат мМаршрут.Перевозчик;
	
КонецФункции

Процедура ЗаполнитьВодителяПоАвтомобилю()
	
	Если Запись.Водитель.Пустая() Тогда
		Запись.Водитель = Запись.Автомобиль.ОсновнойВодитель;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Маршрут) Тогда
		Запись.Контрагент = ПолучитьПеревозчикаМаршрута(Запись.Маршрут);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	ЗаполнитьВодителяПоАвтомобилю();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//
	ФормаВыбора = ПолучитьФорму("Справочник.Автомобили.Форма.ФормаВыбора",, Элемент);
	
	Если НЕ Запись.Автомобиль.Пустая() Тогда
		ФормаВыбора.Элементы.Список.ТекущаяСтрока = Запись.Автомобиль;
	КонецЕсли;

	Если НЕ Запись.Контрагент.Пустая() Тогда
		мСписок = ФормаВыбора.Список;
		ЭлементОтбора = мСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Перевозчик");   
	    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование  = Истина;
	    ЭлементОтбора.ПравоеЗначение = Запись.Контрагент;
	    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    //
	ФормаВыбора = ПолучитьФорму("Справочник.КонтактныеЛицаКонтрагентов.ФормаВыбора",, Элемент);
	
	Если ТипЗнч(ФормаВыбора) = Тип("УправляемаяФорма") Тогда
		Если НЕ Запись.Водитель.Пустая() Тогда
			ФормаВыбора.Элементы.Список.ТекущаяСтрока = Запись.Водитель;
		КонецЕсли;

		Если НЕ Запись.Контрагент.Пустая() Тогда
			мСписок = ФормаВыбора.Список;
			ЭлементОтбора = мСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");   
		    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		    ЭлементОтбора.Использование  = Истина;
		    ЭлементОтбора.ПравоеЗначение = Запись.Контрагент;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	Иначе
		ФормаВыбора.НачальноеЗначениеВыбора = Запись.Водитель;
	
		Если НЕ Запись.Контрагент.Пустая() Тогда
			ФормаВыбора.Отбор.Владелец.Установить(Запись.Контрагент);
			ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры
