
&НаКлиенте
Процедура ОтправитьАкт(Команда)
	ОтправитьДокумент("АКТ");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСФ(Команда)
	ОтправитьДокумент("СФ");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьТОРГ12(Команда)
	ОтправитьДокумент("ТОРГ-12");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУПД(Команда)
	ОтправитьДокумент("УПД");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДокумент(ТипДокумента)
	МассивСтрок = Элементы.ДС_РТУ.ВыделенныеСтроки;
	
	МассивПакетов = Новый Массив;
	Для каждого Зн Из МассивСтрок Цикл
		МассивПакетов.Добавить(Элементы.ДС_РТУ.ДанныеСтроки(Зн).Ссылка);
	КонецЦикла;	

	Для каждого Стр Из МассивПакетов Цикл
		Результат = ЭДО_ОбщегоНазначения.ОтправитьДокументЭДО(Стр.Ссылка, ТипДокумента);
		
		Если Результат.ДокументОтправлен = Ложь Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(Стр.Ссылка) + " не был отправлен");				
			ОбщегоНазначения.СообщитьОбОшибке(Результат.ТекстОшибки);				
		КонецЕсли;	
	КонецЦикла;

	Элементы.ДС_РТУ.Обновить();
	
КонецПроцедуры

Процедура ОтправитьДокументСервер(ТипДокумента, МассивПакетов)
	
		
КонецПроцедуры