
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	////
	//СтандартнаяОбработка = Ложь;
	//
	////
	//ОповеститьОВыборе(Элемент.ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Для каждого ПараметрОтбора Из Параметры.Отбор Цикл
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрОтбора.Ключ);
			ЭлементОтбора.ПравоеЗначение = ПараметрОтбора.Значение;
			
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры
