
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Получатель КАК СтруктурнаяЕдиница,
		|	МаршрутныйЛистТорговыеТочки.ПоставкаВСетках КАК КолвоСетокВПоставке,
		|	ВЫБОР
		|		КОГДА НомераМаршрутовСрезПоследних.ПланируемоеВремяВыездаПоМаршруту ЕСТЬ NULL
		|				ИЛИ НомераМаршрутовСрезПоследних.ПланируемоеВремяВыездаПоМаршруту = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.ПланируемоеВремяВыездаПоМаршруту ССЫЛКА Справочник.ВремяВыездаПоМаршруту
		|						ТОГДА МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.ПланируемоеВремяВыездаПоМаршруту.ВремяВыезда
		|					ИНАЧЕ МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.ПланируемоеВремяВыездаПоМаршруту
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НомераМаршрутовСрезПоследних.ПланируемоеВремяВыездаПоМаршруту ССЫЛКА Справочник.ВремяВыездаПоМаршруту
		|					ТОГДА НомераМаршрутовСрезПоследних.ПланируемоеВремяВыездаПоМаршруту.ВремяВыезда
		|				ИНАЧЕ НомераМаршрутовСрезПоследних.ПланируемоеВремяВыездаПоМаршруту
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяВыходаВРейс,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Комментарий КАК Примечание,
		|	МаршрутныйЛистРасходныеОрдера.Документ,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Сборщик КАК Сборщик,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Склад.Владелец,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Склад,
		|	МаршрутныйЛистРасходныеОрдера.Документ.КоличествоПаллет КАК КоличествоПаллет,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Статус КАК Статус,
		|	МаршрутныйЛистРасходныеОрдера.Документ.СборкаТерминаломЗакончена КАК СборкаТерминаломЗакончена,
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.Водитель КАК Водитель,
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.ПогрузкаНачата,
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.ДатаЗавершенияПогрузки,
		|	ЕСТЬNULL(НомераМаршрутовСрезПоследних.Номер, МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.Наименование) КАК МаршрутНаименование,
		|	ЕСТЬNULL(НомераМаршрутовСрезПоследних.НомерПоВремениВыезда, МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.НомерПоВремениВыезда) КАК МаршрутНомерПоВремениВыезда,
		|	МаршрутныйЛистРасходныеОрдера.Документ.Склад.ДляШтучногоТовара КАК ДляШтучногоТовара,
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.ДатаПодачиМашины
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.МаршрутныйЛист.РасходныеОрдера КАК МаршрутныйЛистРасходныеОрдера
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршруты.ТорговыеТочки КАК МаршрутныйЛистТорговыеТочки
		|		ПО МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут = МаршрутныйЛистТорговыеТочки.Ссылка
		|			И МаршрутныйЛистРасходныеОрдера.Документ.Получатель = МаршрутныйЛистТорговыеТочки.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераМаршрутов.СрезПоследних(ДОБАВИТЬКДАТЕ(&Дата2, ДЕНЬ, -1), ) КАК НомераМаршрутовСрезПоследних
		|		ПО МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут = НомераМаршрутовСрезПоследних.Маршрут
		|ГДЕ
		|	МаршрутныйЛистРасходныеОрдера.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И МаршрутныйЛистРасходныеОрдера.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут.Организация = &Организация
		|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И МаршрутныйЛистРасходныеОрдера.Ссылка.Проведен
		|	И МаршрутныйЛистРасходныеОрдера.Документ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отменен)
		|	И МаршрутныйЛистРасходныеОрдера.Документ.Склад.Владелец = &Владелец
		|	И МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут <> ЗНАЧЕНИЕ(Справочник.Маршруты.ПустаяСсылка)
		|	И (МаршрутныйЛистРасходныеОрдера.Документ.Склад = &Склад
		|			ИЛИ &Склад = НЕОПРЕДЕЛЕНО
		|			ИЛИ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|	И (МаршрутныйЛистРасходныеОрдера.Документ.Получатель = &Получатель
		|			ИЛИ &Получатель = НЕОПРЕДЕЛЕНО)
		|	И (МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут = &Маршрут
		|			ИЛИ &Маршрут = НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Маршрут,
		|	вт.СтруктурнаяЕдиница,
		|	вт.КолвоСетокВПоставке,
		|	вт.ВремяВыходаВРейс,
		|	вт.Примечание,
		|	вт.Документ,
		|	вт.Сборщик,
		|	вт.ДокументСкладВладелец,
		|	вт.ДокументСклад,
		|	вт.КоличествоПаллет,
		|	вт.Статус,
		|	вт.СборкаТерминаломЗакончена,
		|	вт.Водитель,
		|	вт.ПогрузкаНачата,
		|	вт.ДатаЗавершенияПогрузки,
		|	вт.МаршрутНаименование,
		|	вт.МаршрутНомерПоВремениВыезда,
		|	вт.ДляШтучногоТовара,
		|	вт.ДатаПодачиМашины
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт КАК вт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер,
		|	СУММА(СканированныеПаллетыСрезПоследних.Количество) КАК Паллет,
		|	МАКСИМУМ(СканированныеПаллетыСрезПоследних.ФизЛицо) КАК ФизЛицо
		|ПОМЕСТИТЬ втВодительПринял
		|ИЗ
		|	РегистрСведений.СканированныеПаллеты.СрезПоследних(
		|			&Дата2,
		|			Паллет.РасходныйОрдер В
		|				(ВЫБРАТЬ
		|					вт.Документ
		|				ИЗ
		|					вт)) КАК СканированныеПаллетыСрезПоследних
		|ГДЕ
		|	СканированныеПаллетыСрезПоследних.Статус = &ВодительПринял
		|
		|СГРУППИРОВАТЬ ПО
		|	СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер,
		|	СУММА(СканированныеПаллетыСрезПоследних.Количество) КАК Паллет,
		|	МАКСИМУМ(СканированныеПаллетыСрезПоследних.ФизЛицо) КАК ФизЛицо
		|ПОМЕСТИТЬ втНаДебаркадереВодительПринял
		|ИЗ
		|	РегистрСведений.СканированныеПаллеты КАК СканированныеПаллетыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер КАК ПаллетРасходныйОрдер,
		|			СканированныеПаллетыСрезПоследних.Паллет КАК Паллет,
		|			МАКСИМУМ(СканированныеПаллетыСрезПоследних.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.СканированныеПаллеты КАК СканированныеПаллетыСрезПоследних
		|		ГДЕ
		|			СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер В
		|					(ВЫБРАТЬ
		|						вт.Документ
		|					ИЗ
		|						вт)
		|			И СканированныеПаллетыСрезПоследних.Статус = &НаДебаркадере
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер,
		|			СканированныеПаллетыСрезПоследних.Паллет) КАК СканированныеПаллетыСрезПоследнихПосл
		|		ПО СканированныеПаллетыСрезПоследних.Паллет = СканированныеПаллетыСрезПоследнихПосл.Паллет
		|			И СканированныеПаллетыСрезПоследних.Период = СканированныеПаллетыСрезПоследнихПосл.Период
		|ГДЕ
		|	СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер В
		|			(ВЫБРАТЬ
		|				вт.Документ
		|			ИЗ
		|				вт)
		|	И СканированныеПаллетыСрезПоследних.Статус = &НаДебаркадере
		|
		|СГРУППИРОВАТЬ ПО
		|	СканированныеПаллетыСрезПоследних.Паллет.РасходныйОрдер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Маршрут,
		|	МАКСИМУМ(втНаДебаркадереВодительПринял.ФизЛицо) КАК ФизЛицо
		|ПОМЕСТИТЬ втКладовщикиМаршрутов
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНаДебаркадереВодительПринял КАК втНаДебаркадереВодительПринял
		|		ПО вт.Документ = втНаДебаркадереВодительПринял.ПаллетРасходныйОрдер
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Маршрут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Маршрут КАК Маршрут,
		|	вт.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СУММА(ЕСТЬNULL(втВодительПринял.Паллет, 0)) КАК ВодительПринял,
		|	СУММА(ЕСТЬNULL(вт.КоличествоПаллет, 0)) КАК НаДебаркадереВодительПринял,
		|	вт.ВремяВыходаВРейс,
		|	ВЫБОР
		|		КОГДА вт.Маршрут.Наименование = ""0""
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
		|		ИНАЧЕ вт.ВремяВыходаВРейс
		|	КОНЕЦ КАК ВремяВыходаВРейс1,
		|	МАКСИМУМ(вт.ПогрузкаНачата) КАК ПогрузкаНачата,
		|	МИНИМУМ(вт.ДатаЗавершенияПогрузки) КАК ДатаЗавершенияПогрузки,
		|	вт.МаршрутНаименование КАК МаршрутНаименование,
		|	вт.МаршрутНомерПоВремениВыезда КАК МаршрутНомерПоВремениВыезда,
		|	ЕСТЬNULL(ЕСТЬNULL(втВодительПринял.ФизЛицо, втНаДебаркадереВодительПринял.ФизЛицо), втКладовщикиМаршрутов.ФизЛицо) КАК Кладовщик,
		|	вт.ДокументСклад,
		|	вт.Документ
		|ПОМЕСТИТЬ втИтог
		|ИЗ
		|	вт2 КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВодительПринял КАК втВодительПринял
		|		ПО вт.Документ = втВодительПринял.ПаллетРасходныйОрдер
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНаДебаркадереВодительПринял КАК втНаДебаркадереВодительПринял
		|		ПО вт.Документ = втНаДебаркадереВодительПринял.ПаллетРасходныйОрдер
		|		ЛЕВОЕ СОЕДИНЕНИЕ втКладовщикиМаршрутов КАК втКладовщикиМаршрутов
		|		ПО вт.Маршрут = втКладовщикиМаршрутов.Маршрут
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Маршрут,
		|	вт.СтруктурнаяЕдиница,
		|	вт.ВремяВыходаВРейс,
		|	ВЫБОР
		|		КОГДА вт.Маршрут.Наименование = ""0""
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
		|		ИНАЧЕ вт.ВремяВыходаВРейс
		|	КОНЕЦ,
		|	вт.МаршрутНаименование,
		|	вт.МаршрутНомерПоВремениВыезда,
		|	вт.ДокументСклад,
		|	вт.Документ,
		|	ЕСТЬNULL(ЕСТЬNULL(втВодительПринял.ФизЛицо, втНаДебаркадереВодительПринял.ФизЛицо), втКладовщикиМаршрутов.ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Маршрут,
		|	втИтог.СтруктурнаяЕдиница,
		|	втИтог.ВодительПринял КАК ВсегоПаллетОтгружено,
		|	втИтог.НаДебаркадереВодительПринял - втИтог.ВодительПринял КАК ПаллетНеПереданоВодителю,
		|	втИтог.ВремяВыходаВРейс,
		|	втИтог.ВремяВыходаВРейс1,
		|	втИтог.ПогрузкаНачата,
		|	втИтог.ДатаЗавершенияПогрузки,
		|	втИтог.МаршрутНаименование,
		|	втИтог.МаршрутНомерПоВремениВыезда,
		|	втИтог.Кладовщик,
		|	втИтог.ДокументСклад,
		|	втИтог.Документ
		|ИЗ
		|	втИтог КАК втИтог
		|ГДЕ
		|	(втИтог.НаДебаркадереВодительПринял > втИтог.ВодительПринял ИЛИ &ВсеПаллеты=Истина)
		|	И (втИтог.Кладовщик = &Кладовщик
		|			ИЛИ &Кладовщик = НЕОПРЕДЕЛЕНО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	втИтог.ВремяВыходаВРейс1,
		|	втИтог.ВремяВыходаВРейс,
		|	втИтог.МаршрутНомерПоВремениВыезда,
		|	втИтог.МаршрутНаименование,
		|	втИтог.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("Владелец", Параметры.СкладВл);
	Запрос.УстановитьПараметр("ВодительПринял", Перечисления.СтатусПаллета.ВодительПринял);
	Запрос.УстановитьПараметр("Дата1", Параметры.Д1);
	Запрос.УстановитьПараметр("Дата2", КонецДня(Параметры.Д2));
	Запрос.УстановитьПараметр("НаДебаркадере", Перечисления.СтатусПаллета.НаДебаркадере);
	Запрос.УстановитьПараметр("Организация", Параметры.Орг);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("ВсеПаллеты", Параметры.ВсеПаллеты);
	
	СтруктурнаяЕдиница=Неопределено;	
	Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		СтруктурнаяЕдиница=Параметры.СтруктурнаяЕдиница;	
	КонецЕсли; 
	СтруктурнаяЕдиница=Неопределено;	
	Если Параметры.Свойство("СтруктурнаяЕдиница") И ЗначениеЗаполнено(Параметры.СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница=Параметры.СтруктурнаяЕдиница;	
	КонецЕсли; 
	Маршрут=Неопределено;	
	Если Параметры.Свойство("Маршрут") И ЗначениеЗаполнено(Параметры.Маршрут) Тогда
		Маршрут=Параметры.Маршрут;	
	КонецЕсли; 
	Кладовщик=Неопределено;	
	Если Параметры.Свойство("Кладовщик") И ЗначениеЗаполнено(Параметры.Кладовщик) Тогда
		Кладовщик=Параметры.Кладовщик;	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Получатель", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	Запрос.УстановитьПараметр("Кладовщик", Кладовщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Макет=Отчеты.ОтчетПоНеотгруженнымПаллетам.ПолучитьМакет("Расшифровка");
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	Обл=Макет.ПолучитьОбласть("Строка");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Обл.Параметры,ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Обл);
	КонецЦикла;
	
КонецПроцедуры
