
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	ПередЗаписьюНаСервере(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	
	Если  ЗначениеЗаполнено(Запись.ВидОперации) = Ложь Тогда 
		Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.СтруктурнаяЕдиница) = Ложь и (Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача ИЛИ Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Возврат) Тогда
		Отказ = Истина;	
		Сообщить("Структурная единица не может быть бустой.");
	КонецЕсли;
	
	Если Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача  Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_Сертификаты.Сертификат КАК Сертификат,
		|	ВЫБОР
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Выдача)
		|			ТОГДА АК_Сертификаты.Количество * -1
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Создание)
		|			ТОГДА АК_Сертификаты.Количество
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Возврат)
		|			ТОГДА АК_Сертификаты.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	РегистрСведений.АК_Сертификаты КАК АК_Сертификаты
		|ГДЕ
		|	АК_Сертификаты.Сертификат = &Сертификат
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Сертификат";
		
		Запрос.УстановитьПараметр("Сертификат", Запись.Сертификат);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если мСертификат = Запись.Сертификат  Тогда
			КоличествоДобавить =  МКоличество - Запись.Количество ;
		Иначе
			КоличествоДобавить =  -1 *  Запись.Количество;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 			
			Если ВыборкаДетальныеЗаписи.Количество + КоличествоДобавить < 0 Тогда 
				Сообщить("Количество выданных сертификатов превышает количество созданных на "+ Число(ВыборкаДетальныеЗаписи.Количество + КоличествоДобавить));	
				Отказ = Истина;
			КонецЕсли;			
		КонецЕсли;
	ИначеЕсли Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Возврат Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_Сертификаты.Сертификат КАК Сертификат,
		|	СУММА(ВЫБОР
		|			КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Выдача)
		|				ТОГДА АК_Сертификаты.Количество
		|			КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Возврат)
		|				ТОГДА АК_Сертификаты.Количество * -1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество
		|ИЗ
		|	РегистрСведений.АК_Сертификаты КАК АК_Сертификаты
		|ГДЕ
		|	АК_Сертификаты.Сертификат = &Сертификат
		|	И (АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Выдача)
		|			ИЛИ АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Возврат))
		|
		|СГРУППИРОВАТЬ ПО
		|	АК_Сертификаты.Сертификат
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Сертификат";
		
		Запрос.УстановитьПараметр("Сертификат", Запись.Сертификат);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		    //
		Если мСертификат = Запись.Сертификат  Тогда
			КоличествоДобавить =  МКоличество - Запись.Количество ;
		Иначе
			КоличествоДобавить =  -1 *  Запись.Количество;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 			
			Если ВыборкаДетальныеЗаписи.Количество  + КоличествоДобавить < 0 Тогда 
				Сообщить("Количество возврата сертификатов превышает количество выданных на "+ Число(ВыборкаДетальныеЗаписи.Количество + КоличествоДобавить));	
				Отказ = Истина;
			КонецЕсли;			
		КонецЕсли;

	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Создание Тогда 
	//	 ЭтаФорма.ТолькоПросмотр = Истина;
	// Иначе
	//	 Элементы.МаксНомер.Видимость = Ложь;
	//	 Элементы.МинНомер.Видимость = Ложь;
	//	 Если ЗначениеЗаполнено(Запись.ВидОперации) = Ложь Тогда
	//		 Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача;
	//	 КонецЕсли;
	// КонецЕсли;
	//   МКоличество = Запись.Количество;
	//   мСертификат = Запись.Сертификат;
	   ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()

	Если Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Создание Тогда 
		 ЭтаФорма.ТолькоПросмотр = Истина;
	 Иначе
		 Элементы.МаксНомер.Видимость = Ложь;
		 Элементы.МинНомер.Видимость = Ложь;
		 Если ЗначениеЗаполнено(Запись.ВидОперации) = Ложь Тогда
			 Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача;
		 КонецЕсли;
	 КонецЕсли;
	   МКоличество = Запись.Количество;
	   мСертификат = Запись.Сертификат;	

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	
	ПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()

	Если Запись.ВидОперации = Перечисления.АК_ВидыОперацийСертификат.Выдача Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_Сертификаты.Сертификат КАК Сертификат,
		|	ВЫБОР
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Выдача)
		|			ТОГДА АК_Сертификаты.Количество * -1
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Создание)
		|			ТОГДА АК_Сертификаты.Количество
		|		КОГДА АК_Сертификаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АК_ВидыОперацийСертификат.Возврат)
		|			ТОГДА АК_Сертификаты.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	РегистрСведений.АК_Сертификаты КАК АК_Сертификаты
		|ГДЕ
		|	АК_Сертификаты.Сертификат = &Сертификат
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Сертификат";
		
		Запрос.УстановитьПараметр("Сертификат", Запись.Сертификат);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 			
			Если ВыборкаДетальныеЗаписи.Количество < 0 Тогда 
				Сообщить("Количество выданных сертификатов превышает количество созданных на "+ВыборкаДетальныеЗаписи.Количество * -1);			
			КонецЕсли;			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	МКоличество = Запись.Количество;
	мСертификат = Запись.Сертификат;	

КонецПроцедуры
