
&НаКлиенте
Процедура ЗапретНаСборАналоговПриИзменении(Элемент)
	ЗапретНаСборАналоговПриИзмененииСервер();
КонецПроцедуры

Процедура ЗапретНаСборАналоговПриИзмененииСервер()
	УстановитьПривилегированныйРежим(Истина);
	Константы.ЗапретНаСборАналогов.Установить(ЗапретНаСборАналогов);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	ЗапретНаСборАналогов=Константы.ЗапретНаСборАналогов.Получить();
КонецПроцедуры
