
&НаКлиенте
Процедура НачислитьБонус(Команда)
	
	НачислитьБонусНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НачислитьБонусНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда Возврат; КонецЕсли;
	
	Обработки.ОтчетыПоКартам.НачислитьБонусыПоЧеку(CheckUID, ЦельНачисления, Сумма, СтрокаРезультат);
	
	Элементы.ФормаНачислитьБонус.Видимость = Ложь;
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("CheckUID", CheckUID);
	Параметры.Свойство("НомерЧека", НомерЧека);
	Параметры.Свойство("НомерКарты", НомерКарты);
	Параметры.Свойство("ЦельНачисления", ЦельНачисления);
	Элементы.CheckUID.ТолькоПросмотр = ЗначениеЗаполнено(CheckUID);
	
КонецПроцедуры
