
Функция РазложитьСтроку(Знач Стр, Разделитель = ";") Экспорт
    
    Список = Новый СписокЗначений;
    Длина  = СтрДлина(Разделитель);
    
    Стр = СокрЛП(Стр);
    Поз = Найти(Стр, Разделитель);
    
    Пока 0 < Поз Цикл
        Список.Добавить(СокрП(Лев(Стр, Поз - 1)));
        
        Стр = СокрЛ(Сред(Стр, Поз + Длина));
        Поз = Найти(Стр, Разделитель);
    КонецЦикла;

    Список.Добавить(Стр);
    
    Возврат Список;
    
КонецФункции

Процедура СформироватьТекстПисьма()
	
	ЗаголовокПисьма = "Добрый день!" + Символы.ПС +	"По накладной " + НомерДок + " от " + Формат(ДатаДок, "ДФ=dd.MM.yyyy") +
						" выявлены расхождения. Складом было оприходовано количество, отличающееся от указанного в документах по следующим позициям:" +
						Символы.ПС;

	ТекстПисьма = "<HTML><HEAD></HEAD><BODY>" + Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "<META HTTP-EQUIV=""Content-Type"" CONTENT=""text/html; charset=windows-1251"">" + Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "<h3>" + ЗаголовокПисьма + "</h3><br />" + Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "<table border='1px'><th>№ п/п</th><th>Номенклатура</th><th>По приходным ордерам</th><th>Ед.изм.</th>" + Символы.ПС; 

	НомПП = 0; 
	Для Каждого ТекСтр Из Расхождения Цикл 
		НомПП = НомПП + 1; 
		Если ТекСтр.Отправлять = Ложь Тогда
			продолжить;
		КонецЕсли;	
		ТекстПисьма = ТекстПисьма + "<tr>"; 
		ТекстПисьма = ТекстПисьма + "<td>" + СокрЛП(НомПП) + "</td>"; 
		ТекстПисьма = ТекстПисьма + "<td>" + СокрЛП(ТекСтр.Номенклатура) + "</td>"; 
		ТекстПисьма = ТекстПисьма + "<td>" + СокрЛП(ТекСтр.ПоПриходнымОрдерам) + "</td>"; 
		ТекстПисьма = ТекстПисьма + "<td>" + СокрЛП(ТекСтр.ЕдиницаИзмерения) + "</td>"; 
		ТекстПисьма = ТекстПисьма + "</tr>" + Символы.ПС; 
	КонецЦикла; 

	ТекстПисьма = ТекстПисьма + Символы.ПС + "</table>" + Символы.ПС;

	ТекстПисьма = ТекстПисьма + "<h3>С уважением, " + ПараметрыСеанса.ТекущийПользователь + "</h3><br />" + Символы.ПС; 

	ТекстПисьма = ТекстПисьма + Символы.ПС + "</table>" + Символы.ПС;

	ТекстПисьма = ТекстПисьма + "</BODY></HTML>"; 

	//Таблица с колонками: Номенклатура, Количество из колонки по накладной, Ед. измерения.
	//[Подпись отправляющегося]

КонецПроцедуры	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Контрагент	= Параметры.Контрагент;
	ЭтаФорма.ДатаДок	= Параметры.ДатаДок;
	ЭтаФорма.НомерДок	= Параметры.НомерДок;
	ЭтаФорма.Расхождения.Загрузить(Параметры.Расхождения);
	Для Каждого СтрокаТаб Из ЭтаФорма.Расхождения Цикл
		СтрокаТаб.Отправлять = Истина;
	КонецЦикла;
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект"		, ЭтаФорма.Контрагент);
	Запрос.УстановитьПараметр("Вид"			, ?(ЗначениеЗаполнено(ЭтаФорма.Контрагент.ВидКИ_ДляИнформирования),
												ЭтаФорма.Контрагент.ВидКИ_ДляИнформирования,
												Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами));
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресКонтрагента
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК Учетка
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяУчетнаяЗапись)";
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Кому = Выборка.АдресКонтрагента;
	КонецЕсли;	
	
	Выборка = Результаты[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.ОтКого = Выборка.Учетка;
	Иначе
		ЭтаФорма.ОтКого = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ОтКого) Тогда
		ЭтаФорма.ОтКого = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
	КонецЕсли;	
	
	ЭтаФорма.Тема = "Расхождения в поступлении";
	
КонецПроцедуры


Процедура ОтправитьПисьмоСервер()
	СписокКому=Новый СписокЗначений;
	
	СписокАдресов = РазложитьСтроку(Кому);
	Для й = 0 По СписокАдресов.Количество() - 1 Цикл
		Адрес = СписокАдресов.Получить(й).Значение;
		Если СокрЛП(Адрес) = "" Тогда
			Продолжить;
		КонецЕсли;	
		СписокКому.Добавить(Адрес,Адрес);
	КонецЦикла;	
	
	//СписокКому.Добавить(Кому, Кому);
	УчетнаяЗапись = ОтКого;
	
	Почта = Новый ИнтернетПочта;
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	Почта.Подключиться(Профиль);
	Письмо.Тема = Тема;
	Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
	Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
	Для Каждого ПолучательЭлемент Из СписокКому Цикл
		Получатель = Письмо.Получатели.Добавить();
		Получатель.Адрес           = ПолучательЭлемент.Значение;
	КонецЦикла;	
	
	ТекстСообщения = Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
	 
	//Если НЕ ОбщегоНазначения.ЭтоКопияБазы() Тогда
		Почта.Послать(Письмо);
	//КонецЕсли;	
	Почта.Отключиться();

КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	СформироватьТекстПисьма();
	
	ОтправитьПисьмоСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ЭтаФорма.Расхождения Цикл
		СтрокаТаб.Отправлять = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ЭтаФорма.Расхождения Цикл
		СтрокаТаб.Отправлять = Ложь;
	КонецЦикла;
	
КонецПроцедуры
