
Процедура ПередЗаписью(Отказ)
	
	//2014-07-30 mind по просьбе Веры Умаровой убрал
	//Если ЭтотОбъект.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000220") ТОгда // "ККМ Меркурий 150"
	//	
	//	Если НЕ СтрДлина(СокрЛП(ЭтотОбъект.ИнвентарныйНомер)) = 6 Тогда
	//		Сообщить("Инвентарный номер должен иметь 6 знаков в длину!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	Если НЕ СтрДлина(СокрЛП(ЭтотОбъект.ЗаводскойНомер)) = 6 Тогда
	//		Сообщить("Заводской номер должен иметь 6 знаков в длину!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
	Если НЕ ЭтоГруппа Тогда
		Fisc_no = СокрЛП(Fisc_no);
	КонецЕсли;
	
	Если СокрЛП(ЭтотОбъект.Наименование) = ""
			И НЕ ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Сообщить("Не указано наименование основного средства");
		Отказ = Истина;
	КонецЕсли;
	
	ВыполнитьКонтрольНомера(Отказ);
	ЗаполнитьРеквизитыПоСтатистике();
	
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоСтатистике()

	Если  ЭтоНовый() Тогда
		
		АК_ОсновныеСредства.ЗаполнитьРеквизитыОСПоСтатистике(ЭтотОбъект);
		
		Если НеЗаполненИнвНомер = Ложь Тогда
			ИнвентарныйНомер = Справочники.ОсновныеСредства.ПолучитьНовыйИнвентарныйНомер();
		КонецЕсли;
		
	КонецЕсли;		
			
КонецПроцедуры

Процедура ВыполнитьКонтрольНомера(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ИнвентарныйНомер) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСредства.Ссылка
		|ИЗ
		|	Справочник.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка <> &ТекущаяСсылка
		|	И ОсновныеСредства.ИнвентарныйНомер = &ИнвентарныйНомер";

	Запрос.УстановитьПараметр("ИнвентарныйНомер", ЭтотОбъект.ИнвентарныйНомер);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Уже существует основное средство с таким номером");
		Отказ = Истина;
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры	