
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Реквизит1.Отбор.Элементы.Очистить();
	//ЭлОтбора = Реквизит1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлОтбора.ЛевоеЗначение = новый ПолеКомпоновкиДанных("Магазин");
	//ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлОтбора.Использование = истина;
	//ЭлОтбора.ПравоеЗначение = Магазин;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Магазин = Параметры.Магазин;
КонецПроцедуры

