Функция КодДляВыполненияВПериодическихЗаданиях(ТекущаяОбработка) Экспорт

	ЗапросПолучателей = Новый Запрос();
	ЗапросПолучателей.Текст =
		"ВЫБРАТЬ
		|	ПериодическиеЗаданияПолучателиРассылки.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	Справочник.ПериодическиеЗадания.ПолучателиРассылки КАК ПериодическиеЗаданияПолучателиРассылки
		|ГДЕ
		|	ПериодическиеЗаданияПолучателиРассылки.Ссылка = &Задание";
	
	ЗапросПолучателей.УстановитьПараметр("Задание", ТекущаяОбработка);
	Получатели = ЗапросПолучателей.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	
	// Выполнение отчета
	ВыполняемыйОтчет = Отчеты.ОтчетПоВесуИСтоимостиДоставкиГрузаВТТ.Создать();
	
	//ВариантДляРассылки = ВыполняемыйОтчет.СхемаКомпоновкиДанных.ВариантыНастроек.Найти("ДляРассылки");
	//ВыполняемыйОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(ВариантДляРассылки.Настройки);
	
	ВыполняемыйОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(ВыполняемыйОтчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);	
	ВыполняемыйОтчет.КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Вставить("РежимРассылки");
	ВыполняемыйОтчет.КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Вставить("Получатели", Получатели);
	
	ВыполняемыйОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач", НачалоНедели(ТекущаяДата()-7*86400));
	ВыполняемыйОтчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон", КонецНедели(ТекущаяДата()-7*86400));

	ВыполняемыйОтчет.СкомпоноватьРезультат(Новый ТабличныйДокумент, Неопределено);

КонецФункции
