
Процедура ЗаполнитьПредставлениеТоваров()
	
	Перем н, ТекПредставление;
	
	// запись значения реквизита "Представление товаров"
	н = 0;
	ТекПредставление = "";
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Товары Цикл
		
		Если н = 1 Тогда
			ТекПредставление = ТекПредставление + ", "; 
		КонецЕсли;
		ТекПредставление = ТекПредставление + СокрЛП(СтрокаТЧ.Номенклатура.НаименованиеДляСМС);
		
		н = 1;
		
	КонецЦикла;
	
	ЭтотОбъект.ПредставлениеТоваров = ТекПредставление;
	
КонецПроцедуры

Процедура ПроверитьЗаполнить_id_tov_vz()
	
	Если ЭтотОбъект.Товары.Количество() = 0 Тогда
		Если НЕ ЭтотОбъект.id_tov_vz = 0 Тогда
			ЭтотОбъект.id_tov_vz = 0;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	//
	Тек_id_tov_vz = 99999;
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Товары Цикл
		Если СтрокаТЧ.Номенклатура.id_tov < Тек_id_tov_vz Тогда // поиск минимального из id_tov товаров аналога
			Тек_id_tov_vz = СтрокаТЧ.Номенклатура.id_tov;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтотОбъект.id_tov_vz = Тек_id_tov_vz Тогда
		ЭтотОбъект.id_tov_vz = Тек_id_tov_vz;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДублиТоваров()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийЭлемент"			, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПолностьюЗаменяемыйТовар", ЭтотОбъект.ПолностьюЗаменяемыйТовар);
	Запрос.УстановитьПараметр("МассивТоваров"			, ЭтотОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧТовары.Ссылка,
	|	ТЧТовары.Номенклатура
	|ИЗ
	|	Справочник.АналогиНоменклатуры.Товары КАК ТЧТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АналогиНоменклатуры КАК АналогиНоменклатуры
	|		ПО (АналогиНоменклатуры.Ссылка = ТЧТовары.Ссылка)
	|			И (АналогиНоменклатуры.ПолностьюЗаменяемыйТовар = &ПолностьюЗаменяемыйТовар)
	|			И (НЕ АналогиНоменклатуры.Ссылка = &ТекущийЭлемент)
	|			И (НЕ АналогиНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	ТЧТовары.Номенклатура В(&МассивТоваров)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьДублиХарактеристикПолностьюЗаменяемые()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТоваров", ЭтотОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Значение КАК Производитель
	|ПОМЕСТИТЬ ВТОсновная
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО (ЗначенияСвойствОбъектов.Объект = ХарактеристикиНоменклатуры.Ссылка)
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец В(&МассивТоваров)
	|	И НЕ ХарактеристикиНоменклатуры.СтатусАктивностиХарактеристики = ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.НеАктивная)
	|	И НЕ ХарактеристикиНоменклатуры.СтатусАктивностиХарактеристики = ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Выведена)
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И НЕ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОсновная.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТОсновная КАК ВТОсновная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновная КАК Дубли
	|		ПО (Дубли.Производитель = ВТОсновная.Производитель)
	|			И (НЕ Дубли.Номенклатура = ВТОсновная.Номенклатура)
	|ГДЕ
	|	НЕ Дубли.Номенклатура ЕСТЬ NULL ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции


Процедура ПередЗаписью(Отказ)
	
	//Если ЭтотОбъект.Товары.Количество() < 2 Тогда
	//	Сообщить("Должно быть не меньше 2 (двух) позиций товара! Запись невозможна.");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	ТаблицаДублей = ПолучитьДублиТоваров();
	Если НЕ ТаблицаДублей = Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаДублей Цикл
			Сообщить("Для товара """ + СтрокаТаблицы.Номенклатура + """ уже имеется аналог (""" + СтрокаТаблицы.Ссылка + """)");
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;
	//+++АК KIRN 2018.08.31 ИП-00019498.000.00000002  
	//Если ЭтотОбъект.ПолностьюЗаменяемыйТовар Тогда
	//	МассивДублей = ПолучитьДублиХарактеристикПолностьюЗаменяемые();
	//	Если МассивДублей.Количество() > 0 Тогда
	//		Сообщить("Имеются товары с одинаковыми производителями в активных характеристиках:");
	//		Для Каждого ТекНоменклатура Из МассивДублей Цикл
	//			Сообщить(ТекНоменклатура);
	//		КонецЦикла;
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнить_id_tov_vz();
	
	ЗаполнитьПредставлениеТоваров();
	
КонецПроцедуры
