
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТорговаяТочкаПоАйпи = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	Если ЗначениеЗаполнено(ТорговаяТочкаПоАйпи) Тогда
		
		_Настройки = Отчёт.КомпоновщикНастроек.Настройки;
		
		ПолеМагазин = Новый ПолеКомпоновкиДанных("Магазин");
		ЭлементыОтбора = _Настройки.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеМагазин Тогда
				ИДНастройки_Магазин = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТорговаяТочкаПоАйпи) И НЕ ПустаяСтрока(ИДНастройки_Магазин) ИЛИ Параметры.СформироватьПриОткрытии Тогда
		
		ЭлементыНастроек = Отчёт.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		Для Каждого ЭлементНастройки Из ЭлементыНастроек Цикл
			
			Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ИДНастройки_Магазин Тогда
				ЭлементНастройки.Использование = Истина;
				ЭлементНастройки.ПравоеЗначение = ТорговаяТочкаПоАйпи;
				ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Если НЕ Параметры.СформироватьПриОткрытии Тогда Прервать; КонецЕсли;
				
			ИначеЕсли Параметры.СформироватьПриОткрытии И ЭлементНастройки.ПравоеЗначение = "Активное" Тогда
				ЭлементНастройки.Использование = Параметры.Активные;
				
			ИначеЕсли Параметры.СформироватьПриОткрытии И ЭлементНастройки.ПравоеЗначение = "Закрыто" Тогда
				ЭлементНастройки.Использование = Параметры.Закрытые;
				
			ИначеЕсли Параметры.СформироватьПриОткрытии И ЭлементНастройки.ПравоеЗначение = "Выполнено" Тогда
				ЭлементНастройки.Использование = ?(ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно, Параметры.Отработанные, Параметры.Неотработанные);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.СформироватьПриОткрытии Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ПриОткрытии(Ложь);
	
КонецПроцедуры
