
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос(	"ВЫБРАТЬ
	                      	|	МобильноеПриложение.Ссылка
	                      	|ИЗ
	                      	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	                      	|ГДЕ
	                      	|	МобильноеПриложение.Магазин.Ссылка ЕСТЬ NULL ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ПланыОбмена.МобильноеПриложение.ЭтотУзел() Тогда
			ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;  

КонецПроцедуры
