
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Сп=РасшифроватьОтчет(Расшифровка,СтандартнаяОбработка);
	Если НЕ Сп=Неопределено Тогда
		Если  Сп.Количество()Тогда
			Эл=Сп.ВыбратьЭлемент("Выберите задание");
			Если НЕ Эл=Неопределено Тогда
				Парам=Новый Структура("Ключ",Эл.Значение);	
			    ОткрытьФорму("Документ.ЗаданиеНаРазборку.Форма.ФормаДокумента",Парам);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры


Процедура ПолучитьСтруктуруВозврата(ПолеИлиГруппировка,СтруктураПолей)
	МассивРодителей = ПолеИлиГруппировка.ПолучитьРодителей();
	Для Каждого Стр из МассивРодителей Цикл
		Если ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда 
			ПолучитьСтруктуруВозврата(Стр,СтруктураПолей);
		ИначеЕсли ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ПоляГруппировки = Стр.ПолучитьПоля();
			Для Каждого гСтр из ПоляГруппировки Цикл
				Если СтруктураПолей.Свойство(гСтр.Поле) Тогда
					Если Не ЗначениеЗаполнено(СтруктураПолей[гСтр.Поле]) Тогда
						СтруктураПолей[гСтр.Поле] = гСтр.Значение;
					КонецЕсли;
				КонецЕсли;
				ПолучитьСтруктуруВозврата(Стр,СтруктураПолей);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция РасшифроватьОтчет(Расшифровка,СтандартнаяОбработка)
	СтруктураВозврата = Новый Структура("Номенклатура, Характеристика,ДатаПроизводства,Склад");
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	ПолучитьСтруктуруВозврата(Данные.Элементы[Расшифровка],СтруктураВозврата);
	
	ПоляГруппировки = Данные.Элементы[Расшифровка].ПолучитьПоля();
	фл=Ложь;
	Для Каждого гСтр из ПоляГруппировки Цикл
		Если гСтр.Поле="КоличествоРазобрано" Тогда
			фл=Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	ДатаОтчета = ТекущаяДата();

	Номенклатура = СтруктураВозврата.Номенклатура;
	Характеристика = СтруктураВозврата.Характеристика;
	ДатаПроизводства = СтруктураВозврата.ДатаПроизводства;
	Склад = СтруктураВозврата.Склад;
	
	
	
	Если  ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(Характеристика) И ЗначениеЗаполнено(ДатаПроизводства) И ЗначениеЗаполнено(Склад) и фл Тогда
		СтандартнаяОбработка=Ложь;
		Д1=Дата(1,1,1);
		
		Для каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Попытка
				Если Строка(Эл.Параметр)="НачалоПериода" Тогда
					Д1=Эл.Значение;
				КонецЕсли; 
			Исключение
			
			КонецПопытки;
		КонецЦикла; 
		

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаданиеНаРазборкуТовары.Ссылка
			|ИЗ
			|	Документ.ЗаданиеНаРазборку.Товары КАК ЗаданиеНаРазборкуТовары
			|ГДЕ
			|	ЗаданиеНаРазборкуТовары.Ссылка.Склад = &Склад
			|И ЗаданиеНаРазборкуТовары.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1) И ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
			|	И ЗаданиеНаРазборкуТовары.Ссылка.Номенклатура = &Номенклатура
			|	И ЗаданиеНаРазборкуТовары.Ссылка.Характеристика = &Характеристика
			|	И ЗаданиеНаРазборкуТовары.Ссылка.Склад = &Склад
			|	И ЗаданиеНаРазборкуТовары.ДатаПроизводства = &ДатаПроизводства
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаданиеНаРазборкуТовары.Ссылка";
		
		Запрос.УстановитьПараметр("НачалоПериода", Д1.Дата);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Д1.Дата));
		Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Сп=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сп.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
		КонецЦикла;
		
	    Возврат Сп;
	КонецЕсли; 
	
	Возврат Неопределено;

	
КонецФункции
