

Функция ПереместитьФайлыВКаталогХранения(ВладелецСсылка, СписокФайлов) Экспорт
	
	//
	КаталогХраненияФайлов = Константы.КаталогХраненияФайлов.Получить();
	ВидДокумента = ВладелецСсылка.Метаданные().ПолноеИмя();
	УИД = Строка(ВладелецСсылка.УникальныйИдентификатор());
	
	//
	Дата = ТекущаяДата();
	Попытка
		Дата = ВладелецСсылка.Дата;
	Исключение
	КонецПопытки;
	
	//
	КаталогМесяц = Формат(Дата, "ДФ=yyyyMM");
	
	//
	Каталог = КаталогХраненияФайлов + "\" + ВидДокумента + "\" + КаталогМесяц;
	СоздатьКаталог(Каталог);
	
	//
	ИмяАрхива = Каталог + "\" + УИД + ".zip"; 
	ИмяАрхиваOLD = "";
	
	//
	Файл = Новый Файл(ИмяАрхива);
	Если Файл.Существует() Тогда
		
		//
		ИмяАрхиваOLD = Файл.Путь + "\" + УИД + "_old.zip";
		
		//
		КопироватьФайл(Файл.ПолноеИмя, ИмяАрхиваOLD);
		УдалитьФайлы(Файл.ПолноеИмя);
		
	КонецЕсли; 
	
	//
	ВсеОК = Истина;
	
	//
	ЗаписьZIPфайла = Новый ЗаписьZipФайла(ИмяАрхива);
	Для каждого СтрокаТЗ Из СписокФайлов Цикл
		
		//
		ИмяФайла = КаталогВременныхФайлов() + "\" + СтрокаТЗ.ИмяФайла;
		
		//
		Попытка
			
			//
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтрокаТЗ.АдресВоВременномХранилище);
			ДвоичныеДанные.Записать(ИмяФайла);
		
			//
			ЗаписьZIPфайла.Добавить(ИмяФайла, РежимСохраненияПутейZIP.НеСохранятьПути);
			
		Исключение
		КонецПопытки;	
		
	КонецЦикла; 
	
	//
	Попытка
		ЗаписьZIPфайла.Записать();
	Исключение
		ВсеОК = Ложь;
	КонецПопытки;	
	
	//
	Если ВсеОК Тогда
		
		//
		Если ЗначениеЗаполнено(ИмяАрхиваOLD)  Тогда
			УдалитьФайлы(ИмяАрхиваOLD);
		КонецЕсли; 
		
	КонецЕсли; 

	//
	Возврат ВсеОК;
	
	
КонецФункции
 

