
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	CMS1C_ПроцедурыОбменаССайтомКлиентУправляемоеПриложение.УстановитьФормуДляНужнойCMS(ЭтаФорма,ОБъект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	CMS1C_ПроцедурыОбменаССайтомКлиентУправляемоеПриложение.УстановитьФормуДляНужнойCMS(ЭтаФорма,ОБъект.Владелец,Истина);
КонецПроцедуры

&НаСервере
Процедура ПолучитьЦветНаСервере()
	Об = ДанныеФормыВЗначение(ОБъект,Тип("СправочникОбъект.СтатусыЗаказа"));
	ТекЦвет = Об.ОсновнойЦвет.Получить();
	Если ТекЦвет <> Неопределено Тогда
		ОсновнойЦвет = ТекЦвет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьЦветНаСервере();
КонецПроцедуры

&НаСервере
ПРоцедура ЗаписатьЦветНаСервере()
	Об = ДанныеФормыВЗначение(ОБъект,Тип("СправочникОбъект.CMS1C_СтатусыЗаказов"));
	Хран = Новый ХранилищеЗначения(ОсновнойЦвет);
	Об.ОсновнойЦвет = Хран;
	ОБ.Записать();
	ЗначениеВДанныеФормы(Об,Объект);
КонецПроцедуры