
&НаСервере
Процедура ПерезаполнитьТаблицуСМС()
	
	ТаблицаСМС.Очистить();
	
	ADOСоединение = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionTimeOut = 0;
	ADOСоединение.CommandTimeOut    = 0;
	ADOСоединение.ConnectionString  = ОбменСAccess.ПолучитьСтрокуСоединения("SMS_UNION");
	ADOСоединение.Open();
	
	ТекстЗапроса =
	"SELECT CONVERT(CHAR(1000), inc.text) as text, inc.Date
	  |FROM [SMSGate].[dbo].[Incoming] (nolock) inc
	  |inner join M2.dbo.tt (nolock) tt on inc.nomer=tt.nomer_tel
	  |where inc.Date >= '" + Формат(ДатаЗагрузкиСМС, "ДФ='yyyy-MM-ddTHH:mm:ss'") + "' and inc.Date <= '" + Формат(КонецДня(ДатаЗагрузкиСМС), "ДФ='yyyy-MM-ddTHH:mm:ss'") + "'
	  |and tt.id_TT = " + Формат(ТорговаяТочка.id_TT, "ЧГ=0") + "
	  |and IES.dbo.manage_code (text) = 0";
  
	Выборка = ADOСоединение.Execute(ТекстЗапроса);
	
	//
	Если НЕ Выборка.EOF Тогда
		Выборка.MoveFirst();
		Пока НЕ Выборка.EOF Цикл
			
			СтрокаДоб = ТаблицаСМС.Добавить();
			СтрокаДоб.ДатаСМС 	= Выборка.Fields("Date").Value;
			СтрокаДоб.ТекстСМС 	= СокрЛП(Выборка.Fields("text").Value);
			Выборка.MoveNext();
			
		КонецЦикла;
	КонецЕсли;	
		
	ADOСоединение.Close();
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТорговаяТочка = Параметры.ТорговаяТочка;
	ДатаЗагрузкиСМС = ТекущаяДата();
	ПерезаполнитьТаблицуСМС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьСМС(Команда)
	
	ПерезаполнитьТаблицуСМС();
	
КонецПроцедуры

Процедура ПрочитатьТоварыИзСМССервер(ТекСтрока)
	
	ТаблицаТоваров.Очистить();
	ТекДанные = ТаблицаСМС.НайтиПоИдентификатору(ТекСтрока);
	ТекстСМС = ТекДанные.ТекстСМС;
	МассивЗначений = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ТекстСМС, " ");
	КолвоЭлементов = МассивЗначений.Количество();
	Для н = 1 По КолвоЭлементов Цикл
		Если Не ЗначениеЗаполнено(МассивЗначений[КолвоЭлементов - н]) Тогда
			МассивЗначений.Удалить(КолвоЭлементов - н);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивЗначений.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.id_tov В (646, 647)";
				   
	ТабИсключитьДеление = Запрос.Выполнить().Выгрузить();
	
	ADOСоединение = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionTimeOut = 0;
	ADOСоединение.CommandTimeOut    = 0;
	ADOСоединение.ConnectionString  = ОбменСAccess.ПолучитьСтрокуСоединения("SMS_UNION");
	ADOСоединение.Open();
	
	ТекстЗапроса =
	"SELECT ArticleBin2UID.UID as TovarUID
	  |FROM [SMS_IZBENKA].[dbo].[Text_print_KKM] tk  (nolock)
	  |LEFT OUTER JOIN IzbenkaFin.dbo.ArticleBin2UID as ArticleBin2UID (nolock)
	  |ON tk.id_tov = ArticleBin2UID.id_tov
	  |where tk.id=" + МассивЗначений[0] + " and tk.id_tov is not null
	  |order by tk.rn";
  
	Выборка = ADOСоединение.Execute(ТекстЗапроса);
	
	//
	Счетчик = 1;
	Если НЕ Выборка.EOF Тогда
		Выборка.MoveFirst();
		Пока НЕ Выборка.EOF Цикл
			
			СтрокаДоб = ТаблицаТоваров.Добавить();
			Если НЕ Выборка.Fields("TovarUID").Value = NULL Тогда
				СтрокаДоб.Номенклатура 	= Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Сред(Выборка.Fields("TovarUID").Value, 2, 36)));
			КонецЕсли;
			Попытка
				СтрокаДоб.Количество = Число(?(Счетчик <= МассивЗначений.Количество() - 1, СтрЗаменить(МассивЗначений[Счетчик],",", ".") , 0));
			Исключение
			КонецПопытки;
			СтрокаИсключить = ТабИсключитьДеление.Найти(СтрокаДоб.Номенклатура, "Ссылка");
			Если СтрокаДоб.Количество >= 100
				И СтрокаИсключить = Неопределено Тогда
				СтрокаДоб.Количество = СтрокаДоб.Количество / 1000;
			КонецЕсли;	
			Выборка.MoveNext();
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
	КонецЕсли;	
		
	ADOСоединение.Close();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрочитатьТоварыИзСМС(Команда)
	
	ТекСтрока = Элементы.ТаблицаСМС.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана строка с СМС");
		Возврат;
	КонецЕсли;	
	
	ПрочитатьТоварыИзСМССервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОстатки(Команда)
	
	МассивСтрок = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Дата"			, ТекущаяДата());
		СтруктураСтроки.Вставить("ТорговаяТочка", ТорговаяТочка);
		СтруктураСтроки.Вставить("Номенклатура"	, СтрокаТаблицы.Номенклатура);
		СтруктураСтроки.Вставить("Количество"	, СтрокаТаблицы.Количество);
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	
	ЭтаФорма.Закрыть(МассивСтрок);
	
КонецПроцедуры
