
Процедура ПриЗаписи(Отказ, Замещение)
	//Если ЭтотОбъект.Номер = Неопределено Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	МАКСИМУМ(Форум.Номер) КАК Номер
	//				   |ИЗ
	//				   |	РегистрСведений.Форум КАК Форум
	//				   |ГДЕ
	//				   |	Форум.Тема = &Тема
	//				   |
	//				   |ДЛЯ ИЗМЕНЕНИЯ";
	//	ТЗ = Запрос.Выполнить().Выгрузить();
	//	Если ТЗ.Количество() Тогда
	//		ЭтотОбъект.Номер = ТЗ[0].Номер+1;
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры
