
//+++АК SHEP 2018.01.26 ИП-00017365.02
Функция ДокументИспользуетсяВТранспортныхДокументах(ДокСсылка, ВыводитьСообщения = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов.ТранспортныеДокументы КАК ПоступлениеДопРасходовТранспортныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|		ПО ПоступлениеДопРасходовТранспортныеДокументы.Ссылка = ПоступлениеДопРасходов.Ссылка
		|ГДЕ
		|	ПоступлениеДопРасходов.Проведен
		|	И ПоступлениеДопРасходовТранспортныеДокументы.Документ = &ДокСсылка");
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДокументИспользуется = НЕ РезультатЗапроса.Пустой();
	
	Если НЕ ДокументИспользуется ИЛИ НЕ ВыводитьСообщения Тогда Возврат ДокументИспользуется; КонецЕсли;
	
	Сообщить("Для редактирования документа " + Строка(ДокСсылка) + ", нужно сделать непроведёнными следующие документы:", СтатусСообщения.Важное);
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Сообщить("" + Символы.Таб + Строка(ВыборкаЗапроса.Ссылка));
	КонецЦикла;
	
	Возврат ДокументИспользуется;
	
КонецФункции
