&НаСервере
Функция ОткрытьОбработкуНаСервере(КодОбработки)
	ВнешняяФорма = Справочники.ВнешниеОбработки.НайтиПоКоду(КодОбработки); 
	ИмяФайла = ПолучитьИмяВременногоФайла(); 
	ДвоичныеДанные = ВнешняяФорма.ХранилищеВнешнейОбработки.Получить(); 
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
	Возврат ИмяОбработки 
КонецФункции

&НаКлиенте
Процедура ОткрытьОбработку(Команда)
	КодОбработки = Элементы.Список.ТекущиеДанные.Код;	
	ИмяОбработки = ОткрытьОбработкуНаСервере(КодОбработки);
	ОткрытьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КодОбработки = Элементы.Список.ТекущиеДанные.Код;	
	ИмяОбработки = ОткрытьОбработкуНаСервере(КодОбработки);
	ОткрытьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма");
КонецПроцедуры
