
&НаКлиенте
Процедура КомандаВыполнить(Команда)
	сп = Новый СписокЗначений;
	Для Каждого элементСписка из СписокСайтов Цикл
		Если элементСписка.Пометка Тогда
			Сп.Добавить(элементСписка.Значение)
		КонецЕсли;
	КонецЦИкла;
	
	ЭтаФорма.Закрыть(сп);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	CMS1C_НастройкиСайтов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CMS1C_НастройкиСайтов КАК CMS1C_НастройкиСайтов
	|ГДЕ
	|	НЕ CMS1C_НастройкиСайтов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выб = Запрос.Выполнить().Выбрать();
	Пока ВЫб.Следующий() Цикл
		СписокСайтов.Добавить(Выб.Ссылка,,Истина);
	КонецЦикла;
КонецПроцедуры
