
&НаСервере
Функция УстановитьКартинкуПодписи()	
	
	ПолеКартинкиПодписи = ПоместитьВоВременноеХранилище(КартинкаПодписи);
	
КонецФункции

&НаКлиенте
Процедура ПолеКартинкиПодписиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураВозврат = ОткрытьФормуМодально("Справочник.Номенклатура.Форма.ФормаВыбораФайлаКартинки");
	Если СтруктураВозврат <> Неопределено
		И СтруктураВозврат.БылВыборФайла Тогда
		КартинкаПодписи = Новый Картинка(СтруктураВозврат.ИмяФайла);
	КонецЕсли;
    УстановитьКартинкуПодписи();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(КартинкаПодписи) Тогда
		Сообщить("Выберите изображение!", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		ТекущийОбъект.Подпись = Новый ХранилищеЗначения(КартинкаПодписи, Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Об = РеквизитФормыВЗначение("Объект");
	ЗначениеПодписи = Об.Подпись.Получить();
	Если ТипЗнч(ЗначениеПодписи) = Тип("Картинка") Тогда
		КартинкаПодписи = ЗначениеПодписи;
	Иначе
		КартинкаПодписи = Новый Картинка();
	КонецЕсли;
	
	УстановитьКартинкуПодписи();

КонецПроцедуры
