
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") Тогда
		ОповещениеТТ=Истина;
		УстановитьОтбор(Параметры.Пользователь);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(Пользователь=Неопределено)  Экспорт
	Если Не ОповещениеТТ Тогда
		Возврат;
	КонецЕсли; 
	Если Пользователь=Неопределено Тогда
		Пользователь=глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли; 
	Элементы.Список.Обновить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_ГруппыРассылки.Ссылка
		|ИЗ
		|	Справочник.АК_ГруппыРассылки КАК АК_ГруппыРассылки
		|ГДЕ
		|	АК_ГруппыРассылки.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Сп=Новый СписокЗначений;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сп.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
    Сп.Добавить(Справочники.АК_ГруппыРассылки.УЕК);
    Кол=Список.Отбор.Элементы.Количество();
	Для Сч=0 По Кол-1 Цикл
		Список.Отбор.Элементы.Удалить(Кол-1-Сч);		
	КонецЦикла; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Сп;
КонецПроцедуры
 
