
&НаКлиенте
Процедура УстановитьСвойстваЭлементовФормы()
	
	//
	Элементы.ТипСтруктурнойЕдиницы.Видимость = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктурныеЕдиницы"));
	
	//
	ПризнакЭтоРольПризнакРазвоз = (Объект.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыРолейПользователя.ТранспортРазвоз"));
	
	//
	Элементы.ТипЗначения.Видимость = НЕ ПризнакЭтоРольПризнакРазвоз;
	Элементы.ТипСтруктурнойЕдиницы.Видимость = НЕ ПризнакЭтоРольПризнакРазвоз;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСтруктурнойЕдиницыПриИзменении(Элемент)
	
	//
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//
	Если Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктурныеЕдиницы")) Тогда
		
	Иначе	
		
		//
		Объект.ТипСтруктурнойЕдиницы = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//
	Если ЗначениеЗаполнено(ТекущийОбъект.РольПоУмолчанию) Тогда
		
		//
		РольОбъект = ТекущийОбъект.РольПоУмолчанию.ПолучитьОбъект();
		
		//
		СП = Новый Структура;
		СП.Вставить("ТипРоли", ТекущийОбъект.Ссылка);
		
		//
		НайденныеСтроки = РольОбъект.ТипыРолей.НайтиСтроки(СП);
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			//
			НоваяСтрока = РольОбъект.ТипыРолей.Добавить();
			Новаястрока.ТипРоли = ТекущийОбъект.Ссылка;	
			
			//
			Попытка
				РольОбъект.Записать();
			Исключение
				Отказ = Истина;
			КонецПопытки;
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры


