//+++АК POZM 2017.12.26 ИП-00017352 
Процедура ПриЗаписи(Отказ, Замещение)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ТЗ= ЭтотОбъект.Выгрузить();
	ТЗ.Свернуть("Магазин,МестоВыкладки");
	ТекстЗапроса="
				|ВЫБРАТЬ
	             |	ВЫРАЗИТЬ(ТЗ.Магазин КАК Справочник.СтруктурныеЕдиницы) КАК Магазин,
	             |	ВЫРАЗИТЬ(ТЗ.МестоВыкладки КАК Справочник.МестаВыкладки) КАК МестоВыкладки
	             |ПОМЕСТИТЬ Набор
	             |ИЗ
	             |	&ТЗ КАК ТЗ
	             |;
	             |
				 |////////////////////////////////////////////////////////////////////////////////
				 //+++АК KIRN 2018.03.13  ИП-00018083      
	               |ВЫБРАТЬ
	               |	вт.Магазин,
	               |	вт.Магазин.ТипРозничнойТочки КАК типТТ,
				   |	вт.МестоВыкладки КАК МестоВыкладки,
				   |	вт.МестоВыкладки.ТорговаяМарка КАК ТорговаяМаркаМВ,
	               |	рс.ТорговаяМарка КАК ТорговаяМаркаС
	               |ИЗ
	               |	Набор КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК рс
	               |		ПО 
				   |			вт.МестоВыкладки.ТорговаяМарка = рс.ТорговаяМарка
	               |			И вт.Магазин.ТипРозничнойТочки = рс.ТипРозничнойТочки
	               |ГДЕ
	               |	(рс.ТорговаяМарка ЕСТЬ NULL)
				   |;
				  //---АК KIRN  
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Набор.Магазин,
	             |	Набор.МестоВыкладки
	             |ИЗ
	             |	Набор КАК Набор
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяКомплектацияТТ КАК ПлановаяКомплектацияТТ
	             |		ПО Набор.Магазин = ПлановаяКомплектацияТТ.Магазин
	             |			И Набор.МестоВыкладки = ПлановаяКомплектацияТТ.МестоВыкладки
	             |ГДЕ
	             |	ПлановаяКомплектацияТТ.Магазин ЕСТЬ NULL";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	//+++АК KIRN 2018.03.13  ИП-00018083       
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	//Выборка = Запрос.Выполнить().Выбрать();
	ВыборкаОшибки = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выбрать();
	ТекстОшибки = "";
	Пока ВыборкаОшибки.Следующий() Цикл
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки + "
		|Неверная запись! Торговая марка <"+ВыборкаОшибки.ТорговаяМаркаМВ+"> места выкладки <"+ВыборкаОшибки.МестоВыкладки+"> не соответствует торговой марке типу торговой точки";
	КонецЦикла;
		
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
	КонецЕСли;
	//---АК KIRN 
	//+++АК POZM 2018.05.08 ИП-00018375  переделываю плановую комплектацию, будет подчинение регистратору
	#Область АК_ОтключенныйКод
	//Выборка = РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выбрать();
	//
	//Набор = РегистрыСведений.ПлановаяКомплектацияТТ.СоздатьНаборЗаписей();
	//Пока Выборка.Следующий() Цикл
	//	
	//	НоваяЗапись = Набор.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	//	
	//КонецЦикла;	
	//Если Набор.Количество() > 0 Тогда
	//	Набор.Записать(ложь);
	//КонецЕсли;	
	#КонецОбласти
	//---АК POZM 
КонецПроцедуры
//---АК POZM 