
//+++АК ILIK 2018.07.06 ИП-00018897
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПротоколаПроверки(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

//+++АК ILIK 2018.07.06 ИП-00018897
&НаСервере
Процедура ПечатьПротоколаПроверки(ТабДок, ПараметрКоманды)
	Документы.ПроверкаКачестваТоваров.ПечатьПротоколаПроверки(ТабДок, ПараметрКоманды);
КонецПроцедуры
