
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СпрОб = РеквизитФормыВЗначение("Объект");
		КартинкаВСсылке = СпрОб.Пиктограмма.Получить();
		Если ТипЗнч(КартинкаВСсылке) = Тип("Картинка") Тогда
			Картинка = ПоместитьВоВременноеХранилище(КартинкаВСсылке);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураВозврат = ОткрытьФормуМодально("Справочник.Номенклатура.Форма.ФормаВыбораФайлаКартинки");
	Если СтруктураВозврат <> Неопределено
			И СтруктураВозврат.БылВыборФайла Тогда
		Файл = Новый Файл(СтруктураВозврат.ИмяФайла);
		Если Файл.Размер() > 10 * 1024 Тогда
			Предупреждение("Размер выбранного файла не должен превышать 10 Кб. Ужмите изображение");
			Возврат;
		КонецЕсли;	
		ИмяФайлаПиктограммы = СтруктураВозврат.ИмяФайла;
		КартинкаКЗаписи = Новый Картинка(СтруктураВозврат.ИмяФайла);
		Картинка = ПоместитьВоВременноеХранилище(КартинкаКЗаписи);
		Объект.РасширениеФайлаПиктограммы = Файл.Расширение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ИмяФайлаПиктограммы) Тогда
		ТекущийОбъект.Пиктограмма = Новый ХранилищеЗначения(КартинкаКЗаписи, Новый СжатиеДанных(9));
	КонецЕсли;	
	
КонецПроцедуры
