
&НаКлиенте
Процедура ЖалобыПокупателей(Команда)
	
	//+++АК mika 2018.08.09 ИП-00019475 "Статистика использования(Удалить)"↓
	ОбщегоНазначенияСервер.СтатистикаИспользованияПодсистемДобавитьЗапись(Новый Структура("Подсистема, ИмяОбъекта, ИмяФормы, ИмяЭлемента, ДопИнформация", 
			"Магазины", Лев(Этаформа.ИмяФормы,Найти(Этаформа.ИмяФормы,".Форма")-1) , Этаформа.ИмяФормы, СокрЛП(Этаформа.ТекущийЭлемент) +"."+?(Этаформа.ТекущийЭлемент <> Неопределено, Этаформа.ТекущийЭлемент.Имя, "Неопределено"), 
					"ОткрытьФорму(Отчет.ОтчетПоСервису_Магазины.Форма.ФормаОтчета)")); 
	//---АК mika
	
	ОткрытьФорму("Отчет.ОтчетПоСервису_Магазины.Форма.ФормаОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура Обещания(Команда)
	
	//+++АК mika 2018.08.09 ИП-00019475 "Статистика использования(Удалить)"↓
	ОбщегоНазначенияСервер.СтатистикаИспользованияПодсистемДобавитьЗапись(Новый Структура("Подсистема, ИмяОбъекта, ИмяФормы, ИмяЭлемента, ДопИнформация", 
			"Магазины", Лев(Этаформа.ИмяФормы,Найти(Этаформа.ИмяФормы,".Форма")-1), Этаформа.ИмяФормы, СокрЛП(Этаформа.ТекущийЭлемент) +"."+?(Этаформа.ТекущийЭлемент <> Неопределено, Этаформа.ТекущийЭлемент.Имя, "Неопределено"), 
					"ОткрытьФорму(Документ.Обещание.ФормаСписка)")); 
    //---АК mika
	
	ОткрытьФорму("Документ.Обещание.ФормаСписка");
КонецПроцедуры


&НаКлиенте
Процедура ПравилаРаботы(Команда)
	
	//+++АК mika 2018.08.09 ИП-00019475 "Статистика использования(Удалить)"↓
	ОбщегоНазначенияСервер.СтатистикаИспользованияПодсистемДобавитьЗапись(Новый Структура("Подсистема, ИмяОбъекта, ИмяФормы, ИмяЭлемента, ДопИнформация", 
			"Магазины", Лев(Этаформа.ИмяФормы,Найти(Этаформа.ИмяФормы,".Форма")-1), Этаформа.ИмяФормы, СокрЛП(Этаформа.ТекущийЭлемент) +"."+?(Этаформа.ТекущийЭлемент <> Неопределено, Этаформа.ТекущийЭлемент.Имя, "Неопределено"), 
					"ОткрытьФорму(Справочник.ПравилаРаботыСотрудников.ФормаСписка)"));
	//---АК mika 
	
	ОткрытьФорму("Справочник.ПравилаРаботыСотрудников.ФормаСписка");
КонецПроцедуры

