
Процедура ПроверитьНаПересечениеИнтерваловВеса(ТекЗапись, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"	, ТекЗапись.Период);
	Запрос.УстановитьПараметр("Маршрут"	, ТекЗапись.Маршрут);
	Запрос.УстановитьПараметр("ВесНач"	, ТекЗапись.ВесОт);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТарифыНаДоставкуПоМаршруту.ВесОт КАК ВесОт
	|ИЗ
	|	РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	|ГДЕ
	|	ТарифыНаДоставкуПоМаршруту.Период = &Период
	|	И ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут
	|	И НЕ ТарифыНаДоставкуПоМаршруту.ВесОт > &ВесНач";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сообщить("Существует пересекающийся интервал тоннажа (" +
					?(Выборка.ВесОт > 0, "от " + Формат(Выборка.ВесОт, "ЧГ="), "") +
					?(Выборка.ВесДо > 0, " до " + Формат(Выборка.ВесДо, "ЧГ="), "") + ")");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаПересечениеПоТипуТарифа(ТекЗапись, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"		, ТекЗапись.Период);
	Запрос.УстановитьПараметр("Маршрут"		, ТекЗапись.Маршрут);
	Запрос.УстановитьПараметр("ЕдиныйТариф"	, ТекЗапись.ЕдиныйТариф);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф КАК ЕдиныйТариф
	|ИЗ
	|	РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту
	|ГДЕ
	|	ТарифыНаДоставкуПоМаршруту.Период = &Период
	|	И ТарифыНаДоставкуПоМаршруту.Маршрут = &Маршрут
	|	И НЕ ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф = &ЕдиныйТариф";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сообщить("Существует запись для данного маршрута на данную дату с признаком ""Единый тариф"" = " +
					Выборка.ЕдиныйТариф);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	//+++АК sole 2018.07.24 ИП-00019199
	ЛимитСуммыДоставкиНаСкладЗаКг = Константы.ЛимитСуммыДоставкиНаСкладЗаКг.Получить();
	//---АК sole 2018.07.24 ИП-00019199
	
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		ТекЗапись.ДатаЗаписи = ТекущаяДата();
		
		Если ТекЗапись.ЕдиныйТариф
				И ТекЗапись.ВесОт > 0 Тогда
			ТекЗапись.ВесОт = 0;             // на всякий случай
		КонецЕсли;
	
	   	ПроверитьНаПересечениеПоТипуТарифа(ТекЗапись, Отказ);
		
		//+++АК sole 2018.07.24 ИП-00019199
		Если ЗначениеЗаполнено(ЛимитСуммыДоставкиНаСкладЗаКг) И ТекЗапись.ЦенаЗаКг Тогда
			Если ТекЗапись.Сумма > ЛимитСуммыДоставкиНаСкладЗаКг И ЛимитСуммыДоставкиНаСкладЗаКг <> 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Указанная сумма превышает установленный лимит суммы доставки за кг, равный " + Формат(ЛимитСуммыДоставкиНаСкладЗаКг, "ЧГ = 0") + " руб. !", Отказ);
			КонецЕсли;
		КонецЕсли;
		//+++АК sole 2018.07.24 ИП-00019199
		
	КонецЦикла;
	
КонецПроцедуры
