
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Финансовый.Записывать = Истина;
	Движения.Финансовый.Очистить();
	
	Счет443 = ПланыСчетов.Финансовый.ЗатратыТочекДляРаспределения;
	Счет682 = ПланыСчетов.Финансовый.НалогиУН;
	СтатьяНалог = Справочники.СтатьиДоходовРасходов.НайтиПоКоду("20742");
	ЦФОУпрИнформации = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ЦФО_15");
	ВидНалога = Справочники.ВидыНалогов.НайтиПоНаименованию("Торговый сбор");
	Для Каждого СтрокаТаб Из ТорговыеТочки Цикл
		Движение = Движения.Финансовый.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетДт = Счет443;
		БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 1, СтрокаТаб.ТорговаяТочка);
		БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 2, СтатьяНалог);
		БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 3, ЦФОУпрИнформации);
		
		Движение.СчетКт = Счет682;
		БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Организация);
		БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 2, ВидНалога);
		
		Движение.Сумма = СтрокаТаб.Сумма;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВыгруженВБухгалтерию = Ложь;
	ПослеВыгрузкиВносилисьИзменения = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ВыгруженВБухгалтерию Тогда
			ПослеВыгрузкиВносилисьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
