
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	АкцептантыТЧ = ПараметрКоманды.Услуги.Выгрузить().ВыгрузитьКолонку("Акцептант");
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(ПараметрКоманды.Акцептант);
	Для Каждого Стр ИЗ АкцептантыТЧ Цикл
		Если ЗначениеЗаполнено(Стр) Тогда
			МассивОтбора.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии",Истина );
	ПараметрыФормы.Вставить("КлючВарианта","ПоЗаявкам");
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Акцептант",МассивОтбора));
	ОткрытьФорму("Отчет.ЛимитыАвансовАкцептантов.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
