
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НоваяГруппа	= Справочники.Номенклатура.СоздатьГруппу();
	//ЗначениеВРеквизитФормы(НоваяГруппа, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	//СтрокаДоб = Объект.Файлы.Добавить();
	Если ПодключитьРасширениеРаботыСФайлами()=Ложь Тогда
        УстановитьРасширениеРаботыСФайлами(); 
    КонецЕсли;
    ИмяФайла = ""; Адрес = "";
    ПоместитьФайл(Адрес,,ИмяФайла,,);
    Файл = Новый Файл(ИмяФайла);
    ИмяФайла=Файл.Имя;
	СтрокаДоб = Объект.Файлы.Добавить();
	СтрокаДоб.КраткоеИмяФайла = Файл.ИмяБезРасширения;
	СтрокаДоб.Расширение = Файл.Расширение;
	СтрокаДоб.ВнесеныИзменения = Истина;
	СтрокаДоб.Размер = Файл.Размер();
	
    ПеремещениеФайлаВХранилище(ПолучитьИзВременногоХранилища(Адрес),СтрокаДоб.НомерСтроки); 
КонецПроцедуры

&НаСервере
Процедура ПеремещениеФайлаВХранилище(ДвоичныеДанные,НомерСтроки)
	
	Об=РеквизитФормыВЗначение("Объект");
	СтрокаДоб=Об.Файлы.Получить(НомерСтроки-1);
	СтрокаДоб.ИД = ОбщегоНазначенияСервер.ПолучитьНовыйУникальныйИдентификатор("Номенклатура.Файлы", "ИД") + СтрокаДоб.НомерСтроки;
	СтрокаДоб.КлючСтроки = Строка(Новый УникальныйИдентификатор);
	СтрокаДоб.ХранилищеКЗаписи = Новый ХранилищеЗначения(ДвоичныеДанные);
	Об.записать();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока = Элементы.Файлы.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.ВнесеныИзменения Тогда
			Предупреждение("Сначала запишите элемент, файл ещё не записан в базу.");
		Иначе
			ЗапуститьПриложение(ПолучитьПолноеИмяФайла(ТекСтрока.НомерСтроки));
		КонецЕсли;	
		
	КонецЕсли;
	Отказ=истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьПолноеИмяФайла(НомерСтроки)
	Об=РеквизитФормыВЗначение("Объект");
	ТекСтрока=Об.Файлы.Получить(НомерСтроки-1);
	КаталогКЗаписи = Константы.КаталогХраненияФайлов.Получить();
	Если Прав(КаталогКЗаписи, 1) <> "\" Тогда
		КаталогКЗаписи = КаталогКЗаписи + "\";
	КонецЕсли;	
	
	ИмяФайла = КаталогКЗаписи + Строка(Об.Ссылка.УникальныйИдентификатор()) + "_" + Строка(ТекСтрока.КлючСтроки) + ?(Лев(ТекСтрока.Расширение, 1) = ".", "", ".") + ТекСтрока.Расширение;
	
	Возврат ИмяФайла;
	
КонецФункции
