
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ОтгрузкаВТорговуюТочку Тогда
		
		Если ЭтотОбъект.ТранспортныеРасходы.Количество() > 0 Тогда
			ЭтотОбъект.ТранспортныеРасходы.Очистить();
		КонецЕсли;
		Если ЭтотОбъект.ПриходныеОрдера.Количество() > 0 Тогда
			ЭтотОбъект.ПриходныеОрдера.Очистить();
		КонецЕсли;
		Если ЭтотОбъект.КоличествоПоездок > 0
				И НЕ ЭтотОбъект.РасходныеОрдера.Количество() = ЭтотОбъект.КоличествоПоездок Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Количество расходных ордеров не соответствует количеству поездок!");
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ДоставкаНаСклад Тогда
		
		Если ЭтотОбъект.ТочкиДоставки.Количество() > 0 Тогда
			ЭтотОбъект.ТочкиДоставки.Очистить();
		КонецЕсли;
		Если ЭтотОбъект.РасходныеОрдера.Количество() > 0 Тогда
			ЭтотОбъект.РасходныеОрдера.Очистить();
		КонецЕсли;
		//Если ЭтотОбъект.КоличествоПоездок > 0
		//		И НЕ ЭтотОбъект.ПриходныеОрдера.Количество() = ЭтотОбъект.КоличествоПоездок Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("Количество приходных ордеров не соответствует количеству поездок!");
		//	Отказ = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	Если (НЕ ЭтотОбъект.Договор = ЭтотОбъект.Ссылка.Договор)
			И ДопМодульСервер.НекорректныйДоговор(ЭтотОбъект.Договор) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указан некорректный договор (помечен на удаление либо не используется)");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
