
//+++ AK suvv 15.06.2018 ИП-00018779
Процедура УстановитьОтборыПоВариантуОтчета(КомпоновщикНастроек) 
	
	КлючВарианта = неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ЭлементОтбораПодтвержденные = Новый ПолеКомпоновкиДанных("");
	Если КлючВарианта = "РасхождениеПлощадиПомещений" Тогда 
		ЭлементОтбораПодтвержденные = Новый ПолеКомпоновкиДанных("ПровереноНаРазницуПлощадей");
	ИначеЕсли КлючВарианта = "РасхождениеДатыПередачиПомещения" Тогда 
		ЭлементОтбораПодтвержденные = Новый ПолеКомпоновкиДанных("ПровереноНаРазницуДатыПередачи");
	КонецЕсли;
	
	Если ПоказыватьПодтвержденные Тогда 	
		Для Каждого ЭлементОтбора из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораПодтвержденные Тогда 
				ЭлементыОтбора.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;	
	Иначе 	
		ЭлементОтбораНайден = Ложь;
		Для Каждого ЭлементОтбора из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораПодтвержденные Тогда 
				ЭлементОтбораНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если не ЭлементОтбораНайден Тогда
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораПодтвержденные;
		КонецЕсли;	
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
	КонецЕсли;
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ЭлементОтбораНулевоеРасхождение = Новый ПолеКомпоновкиДанных("");
	Если КлючВарианта = "РасхождениеПлощадиПомещений" Тогда 
		ЭлементОтбораНулевоеРасхождение = Новый ПолеКомпоновкиДанных("РазницаПлощадей");
	ИначеЕсли КлючВарианта = "РасхождениеДатыПередачиПомещения" Тогда 
		ЭлементОтбораНулевоеРасхождение = Новый ПолеКомпоновкиДанных("РазницаДатПередачи");
	КонецЕсли;
	
	Если ПоказыватьСНулевымРасхождением Тогда 	
		Для Каждого ЭлементОтбора из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораНулевоеРасхождение Тогда 
				ЭлементыОтбора.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭлементОтбораНайден = Ложь;
		Для Каждого ЭлементОтбора из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораНулевоеРасхождение Тогда 
				ЭлементОтбораНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если не ЭлементОтбораНайден Тогда
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ЭлементОтбораНулевоеРасхождение;
		КонецЕсли;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = 0;
	КонецЕсли;

КонецПроцедуры //--- AK suvv

Функция РезультатКомпоновкиВТЗ(СКД) Экспорт

    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));

    НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
    ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;
	
	//+++ AK suvv 15.06.2018 ИП-00018779
	УстановитьОтборыПоВариантуОтчета(КомпоновщикНастроек);	
	//--- AK suvv	
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

    ТаблицаРезультат = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

    ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

    Возврат ТаблицаРезультат;

КонецФункции
