
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеПроцентовПоДоговорамНачисления.Ссылка,
		|	НачислениеПроцентовПоДоговорамНачисления.НомерСтроки,
		|	НачислениеПроцентовПоДоговорамНачисления.Договор,
		|	НачислениеПроцентовПоДоговорамНачисления.Сумма,
		|	НачислениеПроцентовПоДоговорамНачисления.ДатаНачала,
		|	НачислениеПроцентовПоДоговорамНачисления.ДатаОкончания,
		|	НачислениеПроцентовПоДоговорамНачисления.Ссылка.Организация,
		|	НачислениеПроцентовПоДоговорамНачисления.Ссылка.Контрагент,
		|	НачислениеПроцентовПоДоговорамНачисления.Ссылка.Дата,
		|	РАЗНОСТЬДАТ(НачислениеПроцентовПоДоговорамНачисления.ДатаНачала, НачислениеПроцентовПоДоговорамНачисления.ДатаОкончания, ДЕНЬ) + 1 КАК Дней
		|ПОМЕСТИТЬ втДанныеДокумента
		|ИЗ
		|	Документ.НачислениеПроцентовПоДоговорам.Начисления КАК НачислениеПроцентовПоДоговорамНачисления
		|ГДЕ
		|	НачислениеПроцентовПоДоговорамНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДокумента.Ссылка,
		|	втДанныеДокумента.НомерСтроки,
		|	втДанныеДокумента.Договор,
		|	втДанныеДокумента.Сумма,
		|	втДанныеДокумента.ДатаНачала,
		|	втДанныеДокумента.ДатаОкончания,
		|	втДанныеДокумента.Организация,
		|	втДанныеДокумента.Контрагент,
		|	НастройкаОтраженияОперацийВУчетеСрезПоследних.Счет КАК СчетКт,
		|	НастройкаОтраженияОперацийВУчетеСрезПоследних.ЦФО,
		|	НастройкаОтраженияОперацийВУчетеСрезПоследних.СтатьяДоходовРасходов,
		|	НастройкаОтраженияОперацийВУчетеСрезПоследних.СтруктурнаяЕдиница,
		|	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ПрочиеЗаймыВыданные) КАК счетДт,
		|	втДанныеДокумента.Дата КАК Период,
		|	втДанныеДокумента.Дней
		|ИЗ
		|	втДанныеДокумента КАК втДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаОтраженияОперацийВУчете.СрезПоследних(&ДатаОкончания, ВидОперации = &ВидОперации) КАК НастройкаОтраженияОперацийВУчетеСрезПоследних
		|		ПО (ИСТИНА)";
	
	
	Если ТипДоговора = Перечисления.ТипыДоговоровФинансы.Депозит Тогда
		ВидОперации = Перечисления.ВидыОперацийВУчете.НачислениеПроцентовПоДепозитам;
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоровФинансы.Займ Тогда
		ВидОперации = Перечисления.ВидыОперацийВУчете.НачислениеПроцентовПоЗаймам;  	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДт", );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭтотОбъект.Движения.Финансовый.Очистить();
	ЭтотОбъект.Движения.Финансовый.Записывать = Истина;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетКт) Тогда
			Отказ = Истина;
			Сообщить("Не задана настройка проведения документа");
			Возврат;
		КонецЕсли;	
		
		НоваяПроводка = Движения.Финансовый.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка,ВыборкаДетальныеЗаписи);
		
		НоваяПроводка.СубконтоДт.КонтрагентыФизЛица = ВыборкаДетальныеЗаписи.Контрагент;
		НоваяПроводка.СубконтоДт.Договоры 			= ВыборкаДетальныеЗаписи.Договор;
		
		НоваяПроводка.СубконтоКт.СтатьиДоходовРасходов 	= ВыборкаДетальныеЗаписи.СтатьяДоходовРасходов;
		НоваяПроводка.СубконтоКт.ТорговыеТочки			= ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
		НоваяПроводка.СубконтоКт.ЦФО 					= ВыборкаДетальныеЗаписи.ЦФО;
		
		
		Если ТипДоговора = Перечисления.ТипыДоговоровФинансы.Депозит Тогда
			Содержание = "Доход от размещения депозита " + ВыборкаДетальныеЗаписи.Договор.СуммаДоговора + " руб. от " + Формат(ВыборкаДетальныеЗаписи.Договор.Дата,"ДФ=dd.MM.yy")+ ", ";
			Содержание = Содержание + "Ставка: " + ВыборкаДетальныеЗаписи.Договор.ПроцентнаяСтавка + " %" + " Срок договора: " + ДлительностьВДнях(ВыборкаДетальныеЗаписи.Договор.Дата,ВыборкаДетальныеЗаписи.Договор.СрокДействия)+ ", ";
			Содержание = Содержание + "Срок начисления: " + ВыборкаДетальныеЗаписи.Дней; 
		КонецЕсли;
		НоваяПроводка.Содержание = Содержание;
		
	КонецЦикла;

КонецПроцедуры

Функция ДлительностьВДнях(ДатаНачала,ДатаОкончания)

	Если ДатаНачала < ДатаОкончания И  ДатаНачала > Дата(1,1,1) И ДатаОкончания > Дата(1,1,1) Тогда
		Возврат (ДатаОкончания-ДатаНачала)/(24*3600)+1;
	Иначе 	
		Возврат 0;
	КонецЕсли;	
	
	
	
	
КонецФункции	