
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаТаб Из СписокРассылки Цикл
		Если ЗначениеЗаполнено(СтрокаТаб.Отправлено)
			И ЗначениеЗаполнено(СтрокаТаб.АктСверки)
			И СтрокаТаб.АктСверки.ДатаОтправкиКонтрагенту = '00010101' Тогда
			ДокОб = СтрокаТаб.АктСверки.ПолучитьОбъект();
			ДокОб.ДатаОтправкиКонтрагенту = ТекущаяДата();
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
