
&НаКлиенте
Процедура ОбработатьВыборНоменклатуры()
	
	ТекДанные = Элементы.ТоварныйАссортимент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(ТекДанные.Номенклатура);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЗапроса = ЭтаФорма.ТоварныйАссортимент.Параметры;
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ТорговаяТочка"		, Объект.ТорговаяТочка);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ПоказыватьУпаковку"	, 0);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьУпаковкуПриИзменении(Элемент)
	
	ПараметрыЗапроса = ЭтаФорма.ТоварныйАссортимент.Параметры;
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ПоказыватьУпаковку", ?(ЭтаФорма.ПоказыватьУпаковку, 1, 0));
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварныйАссортиментВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНоменклатуру(Команда)
	
	ОбработатьВыборНоменклатуры();
	
КонецПроцедуры
