Процедура СформироватьИСохранить() Экспорт
	
	Путь = Константы.ПутьХраненияТелефонногоСправочникаHTML.Получить();
    КаталогНаДиске = Новый Файл(Путь);
    Если КаталогНаДиске.Существует() Тогда
		Если НЕ КаталогНаДиске.ЭтоКаталог() Тогда
			Возврат;
		КонецЕсли;
    Иначе
        Возврат;
    КонецЕсли;
	ИмяФайла = Путь + "\Phonebook.HTML";
	
	ТекстХТМЛ = ПолучитьОтчетХТМЛ();
	
	Если ТекстХТМЛ = "" Тогда
		Возврат;
	КонецЕсли;

	Файл = Новый ТекстовыйДокумент;
	Файл.УстановитьТекст(ТекстХТМЛ);
	Файл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
КонецПроцедуры

Функция ПолучитьОтчетХТМЛ() Экспорт
	
	ТаблицаОтчета = ПолучитьТаблицуОтчета();
	Если ТаблицаОтчета.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстХТМЛ = "<HTML>
		|<HEAD>
		|<META HTTP-EQUIV='Content-Type' CONTENT='text/html; CHARSET=utf-8'>
		|<TITLE>Телефонный справочник</TITLE></HEAD><BODY>
		|<H1>Для поиска нажмите Ctrl-F</H1>
		|";
	ТекстХТМЛ = ТекстХТМЛ + "<TABLE width='100%' border='1' cellspacing='0'>
		|<THEAD align='center'>
		|<TR>
		|<TD><B>Абонент</B></TD>
		|<TD><B>Номер</B></TD>
		|<TD><B>EMail</B></TD>
		|<TD><B>Подразделение</B></TD>
		|<TD><B>Дата увольнения</B></TD>
		|<TD><B>Заблокирован</B></TD>
		|<TD><B>Должность</B></TD>
		|</TR>
		|</THEAD>
		|<TBODY>
		|";
		
	Для каждого Стр Из ТаблицаОтчета Цикл
			
		Номер = "";
		ГрязныйНомер = СокрЛП(Стр.НомерТелефона);
		Для НСим = 1 По СтрДлина(ГрязныйНомер) Цикл
			Сим = Сред(ГрязныйНомер, НСим, 1);
			Если Найти("0123456789", Сим)>0 Тогда
				Номер = Номер + Сим;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрДлина(Номер) = 11 Тогда
			Номер = ?(Лев(Номер, 1)="8", "7", Лев(Номер, 1)) + "(" + Сред(Номер, 2, 3) + ")" + Сред(Номер, 5, 3) + "-" + Прав(Номер, 4); 
		КонецЕсли;
		
		ТекстХТМЛ = ТекстХТМЛ + "<TR>
			|<TD>" + Строка(Стр.Абонент) + "</TD>
			|<TD>" + Номер + "</TD>
			|<TD>" + Строка(Стр.EMail) + "</TD>
			|<TD>" + Строка(Стр.Подразделение) + "</TD>
			|<TD>" + Формат(Стр.ДатаУвольнения, "ДФ=dd.MM.yyyy") + "</TD>
			|<TD>" + Строка(Стр.Заблокирован) + "</TD>
			|<TD>" + Строка(Стр.Должность) + "</TD>
			|</TR>
			|";		
	КонецЦикла;
		
	ТекстХТМЛ = ТекстХТМЛ + "</TBODY></TABLE></BODY></HTML>";
	
	Возврат ТекстХТМЛ;	
	
КонецФункции

Функция ПолучитьТаблицуОтчета()
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Все.Привязка КАК Объект,
	//			   |	Все.Вид КАК Вид,
	//			   |	Все.Назначение КАК Назначение,
	//			   |	Все.НомерЭлемент,
	//			   |	Все.НомерТелефона КАК НомерТелефона,
	//			   |	Все.Основной КАК Основной,
	//			   |	Все.Абонент КАК Абонент,
	//			   |	ЕСТЬNULL(Мыло.EMail, """") КАК EMail,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Привязка ССЫЛКА Справочник.СтруктурныеЕдиницы
	//			   |			ТОГДА СтруктурныеЕдиницы.Ссылка
	//			   |		ИНАЧЕ ЕСТЬNULL(Подразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	//			   |	КОНЕЦ КАК Подразделение,
	//			   |	Все.ДатаУвольнения,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Вид = ""Личный""
	//			   |				ИЛИ Все.Назначение = ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон)
	//			   |			ТОГДА ИСТИНА
	//			   |		ИНАЧЕ ЛОЖЬ
	//			   |	КОНЕЦ КАК ГолосоваяСвязь,
	//			   |	Все.Заблокирован,
	//			   |	Все.Должность,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//			   |			ТОГДА ""Нет""
	//			   |		ИНАЧЕ ВЫБОР
	//			   |				КОГДА Все.Привязка ССЫЛКА Справочник.ФизическиеЛица
	//			   |					ТОГДА ""ФизЛицо""
	//			   |				ИНАЧЕ ""Подразделение""
	//			   |			КОНЕЦ
	//			   |	КОНЕЦ КАК ВидПривязки
	//			   |ИЗ
	//			   |	(ВЫБРАТЬ
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
	//			   |		""Служебный"" КАК Вид,
	//			   |		ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
	//			   |		ПривязкаТелефоновСрезПоследних.Номер КАК НомерЭлемент,
	//			   |		ПривязкаТелефоновСрезПоследних.Номер.Код КАК НомерТелефона,
	//			   |		ВЫБОР
	//			   |			КОГДА ОсновныеТелефоны.Телефон ЕСТЬ NULL 
	//			   |					И НЕ ВложенныйЗапрос.Номеров = 1
	//			   |				ТОГДА ЛОЖЬ
	//			   |			ИНАЧЕ ИСТИНА
	//			   |		КОНЕЦ КАК Основной,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.Наименование КАК Абонент,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.ДатаУвольнения КАК ДатаУвольнения,
	//			   |		ЛОЖЬ КАК Заблокирован,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.Должность КАК Должность
	//			   |	ИЗ
	//			   |		РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
	//			   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
	//			   |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ОсновныеТелефоны.Привязка
	//			   |				И ПривязкаТелефоновСрезПоследних.Назначение = ОсновныеТелефоны.Назначение
	//			   |				И ПривязкаТелефоновСрезПоследних.Номер = ОсновныеТелефоны.Телефон
	//			   |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |				ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
	//			   |				ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
	//			   |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПривязкаТелефоновСрезПоследних.Номер) КАК Номеров
	//			   |			ИЗ
	//			   |				РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
	//			   |			
	//			   |			СГРУППИРОВАТЬ ПО
	//			   |				ПривязкаТелефоновСрезПоследних.Привязка,
	//			   |				ПривязкаТелефоновСрезПоследних.Назначение) КАК ВложенныйЗапрос
	//			   |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ВложенныйЗапрос.Привязка
	//			   |				И ПривязкаТелефоновСрезПоследних.Назначение = ВложенныйЗапрос.Назначение
	//			   |	
	//			   |	ОБЪЕДИНИТЬ ВСЕ
	//			   |	
	//			   |	ВЫБРАТЬ
	//			   |		КонтактнаяИнформация.Объект,
	//			   |		""Личный"",
	//			   |		"""",
	//			   |		ЗНАЧЕНИЕ(Справочник.СлужебныеSIMКарты.ПустаяСсылка),
	//			   |		ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(25)),
	//			   |		ИСТИНА,
	//			   |		КонтактнаяИнформация.Объект.Наименование,
	//			   |		ДАТАВРЕМЯ(1, 1, 1),
	//			   |		ЛОЖЬ,
	//			   |		КонтактнаяИнформация.Объект.Должность
	//			   |	ИЗ
	//			   |		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//			   |	ГДЕ
	//			   |		КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	//			   |		И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица)) КАК Все
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			КонтактнаяИнформация.Объект КАК Объект,
	//			   |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК EMail
	//			   |		ИЗ
	//			   |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//			   |		ГДЕ
	//			   |			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)) КАК Мыло
	//			   |		ПО Все.Привязка = Мыло.Объект
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			СтруктурныеЕдиницыФизлицСрезПоследних.ФизЛицо КАК ФизЛицо,
	//			   |			СтруктурныеЕдиницыФизлицСрезПоследних.Подразделение КАК Подразделение
	//			   |		ИЗ
	//			   |			РегистрСведений.СтруктурныеЕдиницыФизлиц.СрезПоследних КАК СтруктурныеЕдиницыФизлицСрезПоследних) КАК Подразделения
	//			   |		ПО Все.Привязка = Подразделения.ФизЛицо
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	//			   |		ПО Все.Привязка = СтруктурныеЕдиницы.Ссылка
	//			   |ГДЕ
	//			   |	Все.Основной
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Подразделение,
	//			   |	Абонент";
	
	Запрос.Текст = "ВЫБРАТЬ
        |	Все.Привязка КАК Объект,
        |	Все.Вид КАК Вид,
        |	Все.Назначение КАК Назначение,
        |	Все.НомерЭлемент,
        |	Все.НомерТелефона КАК НомерТелефона,
        |	Все.Основной КАК Основной,
        |	Все.Абонент КАК Абонент,
        |	ЕСТЬNULL(Мыло.EMail, """") КАК EMail,
        |	ВЫБОР
        |		КОГДА Все.Привязка ССЫЛКА Справочник.СтруктурныеЕдиницы
        |			ТОГДА СтруктурныеЕдиницы.Ссылка
        |		ИНАЧЕ ЕСТЬNULL(Подразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
        |	КОНЕЦ КАК Подразделение,
        |	Все.ДатаУвольнения,
        |	ВЫБОР
        |		КОГДА Все.Вид = ""Личный""
        |				ИЛИ Все.Назначение = ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон)
        |			ТОГДА ИСТИНА
        |		ИНАЧЕ ЛОЖЬ
        |	КОНЕЦ КАК ГолосоваяСвязь,
        |	Все.Заблокирован,
        |	Все.Должность,
        |	ВЫБОР
        |		КОГДА Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
        |			ТОГДА ""Нет""
        |		ИНАЧЕ ВЫБОР
        |				КОГДА Все.Привязка ССЫЛКА Справочник.ФизическиеЛица
        |					ТОГДА ""ФизЛицо""
        |				ИНАЧЕ ""Подразделение""
        |			КОНЕЦ
        |	КОНЕЦ КАК ВидПривязки
        |ИЗ
        |	(ВЫБРАТЬ
        |		ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |		""Служебный"" КАК Вид,
        |		ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
        |		ПривязкаТелефоновСрезПоследних.Номер КАК НомерЭлемент,
        |		ПривязкаТелефоновСрезПоследних.Номер.Код КАК НомерТелефона,
        |		ВЫБОР
        |			КОГДА ОсновныеТелефоны.Телефон ЕСТЬ NULL 
        |					И НЕ ВложенныйЗапрос.Номеров = 1
        |				ТОГДА ЛОЖЬ
        |			ИНАЧЕ ИСТИНА
        |		КОНЕЦ КАК Основной,
        |		ПривязкаТелефоновСрезПоследних.Привязка.Наименование КАК Абонент,
        |		ПривязкаТелефоновСрезПоследних.Привязка.ДатаУвольнения КАК ДатаУвольнения,
        |		ЛОЖЬ КАК Заблокирован,
        |		ПривязкаТелефоновСрезПоследних.Привязка.Должность КАК Должность
        |	ИЗ
        |		РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
        |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ОсновныеТелефоны.Привязка
        |				И ПривязкаТелефоновСрезПоследних.Назначение = ОсновныеТелефоны.Назначение
        |				И ПривязкаТелефоновСрезПоследних.Номер = ОсновныеТелефоны.Телефон
        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |				ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |				ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
        |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПривязкаТелефоновСрезПоследних.Номер) КАК Номеров
        |			ИЗ
        |				РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
        |			
        |			СГРУППИРОВАТЬ ПО
        |				ПривязкаТелефоновСрезПоследних.Привязка,
        |				ПривязкаТелефоновСрезПоследних.Назначение) КАК ВложенныйЗапрос
        |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ВложенныйЗапрос.Привязка
        |				И ПривязкаТелефоновСрезПоследних.Назначение = ВложенныйЗапрос.Назначение
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		КонтактнаяИнформация.Объект,
        |		""Личный"",
        |		"""",
        |		ЗНАЧЕНИЕ(Справочник.СлужебныеSIMКарты.ПустаяСсылка),
        |		ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(25)),
        |		ИСТИНА,
        |		КонтактнаяИнформация.Объект.Наименование,
        |		ДАТАВРЕМЯ(1, 1, 1),
        |		ЛОЖЬ,
        |		КонтактнаяИнформация.Объект.Должность
        |	ИЗ
        |		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |	ГДЕ
        |		КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
        |		И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный)
        |		И НЕ КонтактнаяИнформация.Объект В
        |					(ВЫБРАТЬ
        |						ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка
        |					ИЗ
        |						РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних)
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка),
        |		""Служебный"",
        |		"""",
        |		ВложенныйЗапрос.СимКарта,
        |		ВложенныйЗапрос.СимКарта.Код,
        |		ЛОЖЬ,
        |		"""",
        |		ДАТАВРЕМЯ(1, 1, 1),
        |		ВложенныйЗапрос.Заблокирован,
        |		ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
        |	ИЗ
        |		(ВЫБРАТЬ
        |			СлужебныеSIMКарты.Ссылка КАК СимКарта,
        |			ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |			СлужебныеSIMКарты.Заблокирован КАК Заблокирован
        |		ИЗ
        |			Справочник.СлужебныеSIMКарты КАК СлужебныеSIMКарты
        |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаТелефонов.СрезПоследних КАК ПривязкаТелефоновСрезПоследних
        |				ПО (ПривязкаТелефоновСрезПоследних.Номер = СлужебныеSIMКарты.Ссылка)
        |		ГДЕ
        |			НЕ СлужебныеSIMКарты.ПометкаУдаления) КАК ВложенныйЗапрос
        |	ГДЕ
        |		ВложенныйЗапрос.Привязка ЕСТЬ NULL ) КАК Все
        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |			КонтактнаяИнформация.Объект КАК Объект,
        |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК EMail
        |		ИЗ
        |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |		ГДЕ
        |			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)) КАК Мыло
        |		ПО Все.Привязка = Мыло.Объект
        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |			СтруктурныеЕдиницыФизлицСрезПоследних.ФизЛицо КАК ФизЛицо,
        |			СтруктурныеЕдиницыФизлицСрезПоследних.Подразделение КАК Подразделение
        |		ИЗ
        |			РегистрСведений.СтруктурныеЕдиницыФизлиц.СрезПоследних КАК СтруктурныеЕдиницыФизлицСрезПоследних) КАК Подразделения
        |		ПО Все.Привязка = Подразделения.ФизЛицо
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
        |		ПО Все.Привязка = СтруктурныеЕдиницы.Ссылка
        |ГДЕ
        |	(Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
        |			ИЛИ Все.Привязка.Активный
        |			ИЛИ НЕ Все.Привязка ССЫЛКА Справочник.ФизическиеЛица)";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции