
&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", ОтборСклад,,, ЗначениеЗаполнено(ОтборСклад));
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяВыставитьСчет(Команда)
	
	Элементы.ТребуетсяВыставитьСчет.Пометка = НЕ Элементы.ТребуетсяВыставитьСчет.Пометка;
	
	Если Элементы.ТребуетсяВыставитьСчет.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "ТребуетсяВыставитьСчётНаОплату", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор, Новый ПолеКомпоновкиДанных("ТребуетсяВыставитьСчётНаОплату"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаценкаРеализации(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаНаценки");
КонецПроцедуры
