
Функция ПечатьСличительнойВедомости(Ссылка) Экспорт 
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_СписаниеОС_СличительнаяВедомость";
	
	Макет = Документы.СписаниеОС.ПолучитьМакет("СличительнаяВедомость");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТекНомер = Ссылка.Номер;
	Пока Лев(ТекНомер, 1) = "0" Цикл
		ТекНомер = Сред(ТекНомер, 2);
	КонецЦикла;
    ОбластьМакета.Параметры.Номер 	= ТекНомер;
    ОбластьМакета.Параметры.Дата 	= Формат(Ссылка.Дата, "ДЛФ=Д");
    ОбластьМакета.Параметры.Склад 	= ?(ЗначениеЗаполнено(Ссылка.СкладОтправитель), СокрЛП(Ссылка.СкладОтправитель.Наименование), "");
    ОбластьМакета.Параметры.ЦФО 	= СокрЛП(Ссылка.ЦФООтправитель.Наименование);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	ТекВидГраницы = ?(Ссылка.Проведен, ВидГраницы.Включая, ВидГраницы.Исключая);
	Запрос.Параметры.Вставить("ДатаСреза"	, Новый Граница(Ссылка.МоментВремени(), ТекВидГраницы));
	Запрос.Параметры.Вставить("Ссылка"		, Ссылка);
	Запрос.Параметры.Вставить("Склад"		, Ссылка.СкладОтправитель);
	Запрос.Параметры.Вставить("ЦФО"			, Ссылка.ЦФООтправитель);
	Запрос.УстановитьПараметр("СчетУчета"	, Ссылка.СчетУчетаБУ);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОС.ОсновноеСредство.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	0 КАК Сумма,
	|	ЕСТЬNULL(ФинансовыйОстатки.КоличествоОстаток, 0) КАК КоличествоУчет,
	|	ЕСТЬNULL(ФинансовыйОстатки.СуммаОстаток, 0) КАК СуммаУчет
	|ПОМЕСТИТЬ ВТОсновная
	|ИЗ
	|	Документ.СписаниеОС.Номенклатура КАК ТЧОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Финансовый.Остатки(
	|				&ДатаСреза,
	|				Счет = &СчетУчета,
	|				,
	|				Субконто1 = &ЦФО
	|					И Субконто2 = &Склад) КАК ФинансовыйОстатки
	|		ПО (ФинансовыйОстатки.Субконто3 = ТЧОС.ОсновноеСредство)
	|ГДЕ
	|	ТЧОС.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновная.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТОсновная.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ВТОсновная.Количество) КАК КоличествоФакт,
	|	СУММА(ВТОсновная.КоличествоУчет) КАК КоличествоУчет,
	|	-СУММА(ВТОсновная.Количество) + СУММА(ВТОсновная.КоличествоУчет) КАК КоличествоРасхождение,
	|	СУММА(ВТОсновная.Сумма) КАК СуммаФакт,
	|	СУММА(ВТОсновная.СуммаУчет) КАК СуммаУчет,
	|	-СУММА(ВТОсновная.Сумма) + СУММА(ВТОсновная.СуммаУчет) КАК СуммаРасхождение
	|ИЗ
	|	ВТОсновная КАК ВТОсновная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОсновная.ОсновноеСредство,
	|	ВТОсновная.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТОсновная.ОсновноеСредство.Наименование,
	|	ВТОсновная.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновная";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 0;
	
	ИтСуммаУчет = 0;
	ИтСуммаРасх = 0;
	
 	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧГ=");
    	ТабДокумент.Вывести(ОбластьМакета);

		ИтСуммаУчет = ИтСуммаУчет + Выборка.СуммаУчет;
		ИтСуммаРасх = ИтСуммаРасх + Выборка.СуммаРасхождение;
		
	КонецЦикла;
	
 	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.СуммаУчет 			= ИтСуммаУчет;
	ОбластьМакета.Параметры.СуммаРасхождение 	= ИтСуммаРасх;
	ТабДокумент.Вывести(ОбластьМакета);

	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ФиксацияСверху 		= 8;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.Защита 				= Ложь;
	ТабДокумент.ТолькоПросмотр 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

//+++ АК bara 17113 01.11.2017
Функция ПечатьВедомостьНаСписание(Ссылка) Экспорт 
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_СписаниеОС_СличительнаяВедомость";
	
	Макет = Документы.СписаниеОС.ПолучитьМакет("ВедомостьПоСписанию");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.Дата 	= Формат(Ссылка.Дата, "ДЛФ=Д");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	ТекВидГраницы = ?(Ссылка.Проведен, ВидГраницы.Включая, ВидГраницы.Исключая);
	Запрос.Параметры.Вставить("ДатаСреза"	, Новый Граница(Ссылка.МоментВремени(), ТекВидГраницы));
	Запрос.Параметры.Вставить("Ссылка"		, Ссылка);
	Запрос.Параметры.Вставить("Склад"		, Ссылка.СкладОтправитель);
	Запрос.Параметры.Вставить("ЦФО"			, Ссылка.ЦФООтправитель);
	Запрос.УстановитьПараметр("СчетУчета"	, Ссылка.СчетУчетаБУ);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОС.ОсновноеСредство.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	0 КАК Сумма,
	|	ЕСТЬNULL(ФинансовыйОстатки.КоличествоОстаток, 0) КАК КоличествоУчет,
	|	ЕСТЬNULL(ФинансовыйОстатки.СуммаОстаток, 0) КАК СуммаУчет
	|ПОМЕСТИТЬ ВТОсновная
	|ИЗ
	|	Документ.СписаниеОС.Номенклатура КАК ТЧОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Финансовый.Остатки(
	|				&ДатаСреза,
	|				Счет = &СчетУчета,
	|				,
	|				Субконто1 = &ЦФО
	|					И Субконто2 = &Склад) КАК ФинансовыйОстатки
	|		ПО (ФинансовыйОстатки.Субконто3 = ТЧОС.ОсновноеСредство)
	|ГДЕ
	|	ТЧОС.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновная.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТОсновная.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ВТОсновная.Количество) КАК КоличествоФакт,
	|	СУММА(ВТОсновная.КоличествоУчет) КАК КоличествоУчет,
	|	-СУММА(ВТОсновная.Количество) + СУММА(ВТОсновная.КоличествоУчет) КАК КоличествоРасхождение,
	|	СУММА(ВТОсновная.Сумма) КАК СуммаФакт,
	|	СУММА(ВТОсновная.СуммаУчет) КАК СуммаУчет,
	|	-СУММА(ВТОсновная.Сумма) + СУММА(ВТОсновная.СуммаУчет) КАК СуммаРасхождение
	|ИЗ
	|	ВТОсновная КАК ВТОсновная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОсновная.ОсновноеСредство,
	|	ВТОсновная.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТОсновная.ОсновноеСредство.Наименование,
	|	ВТОсновная.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновная";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 0;
	
	ИтСуммаУчет = 0;
	ИтСуммаРасх = 0;
	
 	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл

		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧГ=");
    	ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;
	
 	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьМакета);

	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ФиксацияСверху 		= 8;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.Защита 				= Ложь;
	ТабДокумент.ТолькоПросмотр 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции
//--- АК bara 17113 01.11.2017

//+++ АК bara 17113 01.11.2017
Процедура Приказ(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Приказ)
	Макет = Документы.СписаниеОС.ПолучитьМакет("Приказ");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеОС.Дата,
	|	СписаниеОС.Номер,
	|	СписаниеОС.Организация,
	|	СписаниеОС.Ссылка
	|ИЗ
	|	Документ.СписаниеОС КАК СписаниеОС
	|ГДЕ
	|	СписаниеОС.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТекНомер = Выборка.Номер;
		Пока Лев(ТекНомер, 1) = "0" Цикл
			ТекНомер = Сред(ТекНомер, 2);
		КонецЦикла;
		ОбластьЗаголовок.Параметры.Номер 	= ТекНомер;
		ОбластьЗаголовок.Параметры.Дата 	= Формат(Выборка.Дата, "ДФ=dd.MM.yyyy; ДЛФ=Д");
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
//--- АК bara 17113 01.11.2017

//+++ АК bara 17113 01.11.2017
Функция ПечатьСписаниеОС(ТабДокумент, Ссылка)Экспорт
	Перем ПодразделениеОтветственныхЛиц;	
		
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_СписаниеОС_ОС4";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка[0]);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеОС.Номер КАК НомерДок,
	|	СписаниеОС.Дата КАК ДатаДок,
	|	СписаниеОС.Организация КАК Организация,
	|	СписаниеОС.Организация.КодПоОКПО КАК КодОКПО,
	|	СписаниеОС.СкладОтправитель,
	|	СписаниеОС.ЦФООтправитель,
	|	СписаниеОС.СкладПолучатель,
	|	СписаниеОС.ЦФОПолучатель,
	|	СписаниеОС.Организация КАК Организация1
	|ИЗ
	|	Документ.СписаниеОС КАК СписаниеОС
	|ГДЕ
	|	СписаниеОС.Ссылка = &Ссылка";
	СтруктураДока = Запрос.Выполнить().Выбрать();
	СтруктураДока.Следующий();
	
	СведенияОбОрганизации    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(СтруктураДока.Организация, СтруктураДока.ДатаДок);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		
	ОтветственныеЛица = ОбщегоНазначения.ОтветственныеЛица(СтруктураДока.Организация, СтруктураДока.ДатаДок, ПодразделениеОтветственныхЛиц);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка[0]);
	Запрос.УстановитьПараметр("ПериодОборотов", Ссылка[0].МоментВремени());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеОСНоменклатура.ОсновноеСредство,
	|	СписаниеОСНоменклатура.ОсновноеСредство.Наименование КАК НаимОС,
	|	СписаниеОСНоменклатура.ОсновноеСредство.ИнвентарныйНомер КАК ИнвНомер,
	|	СписаниеОСНоменклатура.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
	|	СписаниеОСНоменклатура.ОсновноеСредство.ПервоначальнаяСтоимость КАК НачСтоимость,
	|	СписаниеОСНоменклатура.ОсновноеСредство.СрокЭксплуатации КАК СрокЭкспл,
	|	СписаниеОСНоменклатура.ОсновноеСредство.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	СписаниеОСНоменклатура.ОсновноеСредство.Номенклатура КАК Номенклатура,
	|	СписаниеОСНоменклатура.СчетУчетаАмортизация,
	|	СписаниеОСНоменклатура.СчетУчетаЗабалансовый
	|ИЗ
	|	Документ.СписаниеОС.Номенклатура КАК СписаниеОСНоменклатура
	|ГДЕ
	|	СписаниеОСНоменклатура.Ссылка = &Ссылка";
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	
	Макет  = ПолучитьМакет("ОС4б");
	
	Шапка = Макет.ПолучитьОбласть("Шапка0");
	Шапка.Параметры.Заполнить(СтруктураДока);
	Шапка.Параметры.Организация           = ПредставлениеОрганизации;
	Шапка.Параметры.Руководитель          = ОтветственныеЛица.РуководительПредставление;
	Шапка.Параметры.ДолжностьРуководителя = ОтветственныеЛица.РуководительДолжность;
	
	ТабДокумент.Вывести(Шапка);
	
	Шапка = Макет.ПолучитьОбласть("Шапка1");
	Шапка.Параметры.Заполнить(СтруктураДока);
	ТабДокумент.Вывести(Шапка);
	
	Строка1 = Макет.ПолучитьОбласть("Строка1");
	
	Пока ВыборкаОС.Следующий() Цикл
		
		Строка1.Параметры.Заполнить(ВыборкаОС);
		Если НЕ ЗначениеЗаполнено(ВыборкаОС.НаимОС) Тогда
			Строка1.Параметры["НаимОС"] = ВыборкаОС.ОС;
		КонецЕсли;
		
		
		Строка1.Параметры.Заполнить(СтруктураДока);
		//Строка1.Параметры.НачСтоимость   = СтоимостьОС;
		//Строка1.Параметры.НачАмортизация = АмортизацияОС;
		//Строка1.Параметры.ОстСтоимость = ?(ВыборкаОС.ПорядокПогашенияСтоимости = Перечисления.ПорядокПогашенияСтоимостиОС.СписаниеПриПринятииКУчету,
		//0,
		//СтоимостьОС - АмортизацияОС);
		
		//Строка1.Параметры.Причина = СтруктураДока.ПричинаСписания;
		
		ДокументПринятияКУчету     = "";
		ДокументВводаВЭксплуатацию = "";
		ПринятоКУчету              = "";
		ВведеноВЭксплуатацию       = "";
		
		ТабДокумент.Вывести(Строка1);
		
	КонецЦикла;
	
	Шапка = Макет.ПолучитьОбласть("Шапка2");
	Шапка.Параметры.Заполнить(СтруктураДока);
	
	Шапка.Параметры.ГлавБух = ОтветственныеЛица.ГлавныйБухгалтерПредставление;
	
	ТабДокумент.Вывести(Шапка);
	
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСписаниеТоваров()
//--- АК bara 17113 01.11.2017