

Функция ОбработатьЭлемент(СсылкаБП,v82)
	УИН = Новый УникальныйИдентификатор(v82.XMLСтрока(СсылкаБП.УникальныйИдентификатор()));
	Ссылка = Справочники.СтатьиДвиженияДенежныхСредствБУ.ПолучитьСсылку(УИН);
	СтатьяОбъект = Ссылка.ПолучитьОбъект();
    Если СтатьяОбъект = Неопределено Тогда
		Если СсылкаБП.ЭтоГруппа Тогда
			НоваяСтатьяОбъект = Справочники.СтатьиДвиженияДенежныхСредствБУ.СоздатьГруппу();
		Иначе	
	    	НоваяСтатьяОбъект = Справочники.СтатьиДвиженияДенежныхСредствБУ.СоздатьЭлемент();
		КонецЕсли;	
			      
	    НоваяСтатьяОбъект.УстановитьСсылкуНового(Ссылка);
			
		СтатьяОбъект = НоваяСтатьяОбъект;
		//Сообщить("Создан новый элемент справочника Статьи ДДС(БУ) "+Выборка.Ссылка.Наименование);
	       
	Иначе
		
	КонецЕсли;
	
	Если СтатьяОбъект.Код<>СсылкаБП.Код или СтатьяОбъект.Наименование<>СсылкаБП.Наименование 
		или СтатьяОбъект.ПометкаУдаления<>СсылкаБП.ПометкаУдаления или СтатьяОбъект.Родитель.Наименование<>СсылкаБП.Родитель.Наименование Тогда
		СтатьяОбъект.ОбменДанными.Загрузка=истина;
		СтатьяОбъект.Код=СсылкаБП.Код ;
		СтатьяОбъект.Наименование=СсылкаБП.Наименование;
		СтатьяОбъект.ПометкаУдаления=СсылкаБП.ПометкаУдаления;
		
		Если ЗначениеЗаполнено(СсылкаБП.Родитель.Наименование) Тогда
			СтатьяОбъект.Родитель=ОбработатьЭлемент(СсылкаБП.Родитель,v82);
		Иначе
			СтатьяОбъект.Родитель=Справочники.СтатьиДвиженияДенежныхСредствБУ.ПустаяСсылка();
		КонецЕсли;	
		СтатьяОбъект.Записать();
	КонецЕсли;	
	Возврат СтатьяОбъект.Ссылка;
КонецФункции	

Процедура ОбновитьДанныеСправочника() Экспорт
	
	//СтрокаПодключения="Srvr=""10.0.0.15""; Ref=""BP_CORP""; Usr=""Обмен""; Pwd=""123321""";
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключитьс к базе бухгалтерии");
		Возврат;
		
	КонецПопытки;
	
	Выборка=v82.Справочники.СтатьиДвиженияДенежныхСредств.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СокрЛП(Выборка.Код)="901013" или СокрЛП(выборка.родитель.Код)="901013" Тогда//Остальные оказались не нужны
			ОбработатьЭлемент(Выборка.Ссылка,v82);
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры	