
//+++susk ИП-00016878
&НаКлиенте
Процедура ВыгрузитьВБП(Команда)
	
	СписокДокументов = Новый Массив;
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокДокументов.Добавить(Строка);		
	КонецЦикла;
	
	ВыгрузитьВБПСервер(СписокДокументов);

КонецПроцедуры

//+++susk ИП-00016878
&НаСервере
Процедура ВыгрузитьВБПСервер(ВремСписокДокументов)
	
	СписокДокументов = Новый Массив;
	
	Для Каждого Док Из ВремСписокДокументов Цикл
		Если Док.Дата < Дата(2017, 1, 1) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("У документа: " + Строка(Док) + " дата меньше 1 января 2017 года. Выгружен не будет!");
			Продолжить;
		КонецЕсли;
		
		Если Док.НеВыгружатьВБУ Тогда
			ОбщегоНазначения.СообщитьОбОшибке("У документа: " + Строка(Док) + " стоит флаг ""Не выгружать в БУ"", выгрузка документа невозможна!");
			Продолжить;
		КонецЕсли;
		
		СписокДокументов.Добавить(Док);
		
	КонецЦикла;	
	
	ОбменСБП2_0.ВыгрузитьСписокДокументовВБП("ПоступлениеДопРасходов", "ПоступлениеДопРасходов", СписокДокументов);	
	
КонецПроцедуры
