
&НаСервере
Процедура ВнестиЗаписьВРегистр(ИдентСтроки)
	
	ТекДанные = Отчет.ТаблицаРезультат.НайтиПоИдентификатору(ИдентСтроки);
	Запись = РегистрыСведений.ПроверенныеСтрокиОтчетаБухгалтераРасчетчика.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ТекДанные);
	Если ТекДанные.Проверено Тогда
		Запись.Записать();
	Иначе
		Запись.Удалить();
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаРезультатПровереноПриИзменении(Элемент)
	
	ВнестиЗаписьВРегистр(Элементы.ТаблицаРезультат.ТекущаяСтрока);
	
КонецПроцедуры
