
//+++АК Susk (Суслин К.В.) 2018.05.22 б/н закрытие месяца
Функция ЭтоОрганизацияТилси() Экспорт
	
	Возврат Строка(Организация.УникальныйИдентификатор()) = "aec7bdbc-0fdd-11e8-8b52-005056a714c6"; // Тилси
	
КонецФункции

//+++АК Susk (Суслин К.В.) 2018.05.22 б/н закрытие
Функция Возврат90СчетаВЗависимостиОтОрганизации() Экспорт
	
	//+++ AK suvv 2018.10.22 ИП-00020212
	Счета90 = Новый СписокЗначений;
	Счета90.Добавить(ПланыСчетов.Финансовый.ВыручкаПрочая);   //90.5
	
	Если ЭтоОрганизацияТилси() Тогда 
		Счета90.Добавить(ПланыСчетов.Финансовый.ВыручкаТорговыхТочек);   //90.4
	КонецЕсли;
	
	Возврат Счета90;
	//--- AK suvv
	
КонецФункции 
		
//+++АК Susk (Суслин К.В.) 2018.06.04 ИП-00018793
Функция ПолучитьОрганизациюБух(ОргФин, Соединение) Экспорт
	
	Запрос = Соединение.NewObject("Запрос");	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОргФин, "ИНН"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Соединение.Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	                                                          
	
КонецФункции

