
Процедура УстановитьНаименование()
	
	Если ЗначениеЗаполнено(Объект.МестоВыкладки)
			И ЗначениеЗаполнено(Объект.Владелец) Тогда
		НаименованиеМагазина = Объект.Владелец.Наименование;
		КодМагазина = "";
		Для Сч=1 По СтрДлина(НаименованиеМагазина) Цикл
			Симв=Сред(НаименованиеМагазина,Сч,1);
			Если Найти("0123456789",Симв)<>0 Тогда
				КодМагазина=КодМагазина+Симв;
			Иначе	
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		КодМагазина = Прав("0000000" + КодМагазина, 4);
		
		Префикс = КодМагазина + "-" + Объект.МестоВыкладки.КодДляДатчиков;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", "%" + Префикс + "%");
		Запрос.УстановитьПараметр("Ссылка"		, Объект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Датчики.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Датчики КАК Датчики
		|ГДЕ
		|	Датчики.Наименование ПОДОБНО &Наименование
		|	И Датчики.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НаименованиеПоследнее = СокрЛП(ВыборкаДетальныеЗаписи.Наименование);
			ЦифраПосл = Прав(НаименованиеПоследнее, 1);
			Если Найти("01234567890", ЦифраПосл) > 0 Тогда
				ТекНомер = Число(ЦифраПосл) + 1;
			Иначе
				ТекНомер = 1;
			КонецЕсли; 
		Иначе
			ТекНомер = 1;
		КонецЕсли;   
		Объект.Наименование = Префикс + Строка(ТекНомер);	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    Если Параметры.Свойство("МестоВыкладки") Тогда
		     Объект.МестоВыкладки 	= Параметры.МестоВыкладки;
		КонецЕсли;
	    Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		     Объект.Владелец 		= Параметры.СтруктурнаяЕдиница;
		КонецЕсли;
	КонецЕсли;
	
	//ЭлементОтбора = ЭтаФорма.История.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Датчик");
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	//ЭтаФорма.История.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.Владелец) и ЗначениеЗаполнено(Объект.МестоВыкладки) Тогда
	//   ПослеЗаписиСервер();
	//   КонецЕсли;
	//ОповеститьОбИзменении(Мен.ИсходныйКлючЗаписи);
	////Кол=ЭтаФорма.История.Отбор.Элементы.Количество();
	////Для Сч=0 По Кол-1 Цикл
	////	 ЭтаФорма.История.Отбор.Элементы.Удалить(Кол-1-Сч);
	//// КонецЦикла;
	////ЭлементОтбора = ЭтаФорма.История.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Датчик");
	////ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	////ЭлементОтбора.Использование 	= Истина;
	////ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	
	//ЭтаФорма.История.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиСервер()
	
	//
	МенеджерЗаписи = РеквизитФормыВЗначение("Мен");
	МенеджерЗаписи.Магазин			= Объект.Владелец;
	МенеджерЗаписи.МестоВыкладки	= Объект.МестоВыкладки;
	МенеджерЗаписи.Датчик			= Объект.Ссылка;
	МенеджерЗаписи.Прочитать(); 
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Магазин			= Объект.Владелец;
		МенеджерЗаписи.МестоВыкладки	= Объект.МестоВыкладки;
		МенеджерЗаписи.Датчик			= Объект.Ссылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Мен");
	
КонецПроцедуры


&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоВыкладкиПриИзменении(Элемент)
	
	УстановитьНаименование();
	
КонецПроцедуры
 