
&НаКлиенте
Процедура ВыполнитьПривязку(Команда)
	
	ТехнологПоКачеству =  ПланыВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству;
	ТекДата = ТекущаяДата();
	
	Для каждого Стр  Из Номенклатура Цикл
		Если Стр.Выбрать Тогда 
			НовЗапись = РегистрыСведений.СоответствиеОбъектРоль.СоздатьМенеджерЗаписи();
			НовЗапись.Объект = Стр.Характеристика;
			НовЗапись.ТипРоли = ТехнологПоКачеству;
			НовЗапись.РольПользователя = НоваяРоль;
			НовЗапись.ТипРолиID = "TechnologPoKachestvu";
			НовЗапись.Период = ТекДата;
			НовЗапись.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр  Из КонтрагентСписок Цикл
		Если Стр.Выбрать Тогда 
			НовЗапись = РегистрыСведений.СоответствиеОбъектРоль.СоздатьМенеджерЗаписи();
			НовЗапись.Объект = Стр.Контрагент;
			НовЗапись.ТипРоли = ТехнологПоКачеству;
			НовЗапись.РольПользователя = НоваяРоль;
			НовЗапись.ТипРолиID = "TechnologPoKachestvu";
			НовЗапись.Период = ТекДата;
			НовЗапись.Записать();		
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
	
	ОтобратьНаСервере();	
	Элементы.Номенклатура.Видимость = Истина;	
	Элементы.КонтрагентСписок.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьНаСервере()
	
	Номенклатура.Очистить();
	КонтрагентСписок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныПоставщиковСрезПоследних.Номенклатура,
	|	ЦеныПоставщиковСрезПоследних.Характеристика,
	|	ЦеныПоставщиковСрезПоследних.Поставщик
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков.СрезПоследних КАК ЦеныПоставщиковСрезПоследних
	|ГДЕ ЦеныПоставщиковСрезПоследних.Поставщик = &Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СоответствиеОбъектРольСрезПоследних.Объект, ВТ.Характеристика) КАК Характеристика,
	|	ВТ.Поставщик,
	|	СоответствиеОбъектРольСрезПоследних.РольПользователя,
	|	ЕСТЬNULL(СоответствиеОбъектРольСрезПоследних.Объект.Владелец, ВТ.Номенклатура) КАК Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектРоль.СрезПоследних КАК СоответствиеОбъектРольСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО СоответствиеОбъектРольСрезПоследних.Объект = ВТ.Характеристика
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(СоответствиеОбъектРольСрезПоследних.Объект) = ТИП(Справочник.ХарактеристикиНоменклатуры) ИЛИ СоответствиеОбъектРольСрезПоследних.Объект есть null )
	|	И ВТ.Поставщик = &Поставщик
	|	И СоответствиеОбъектРольСрезПоследних.РольПользователя = &РольПользователя";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.УстановитьПараметр("Поставщик", Контрагент);
		Если Холдинг Тогда 
			Запрос.УстановитьПараметр("Поставщик", Контрагент.ГоловнойКонтрагент);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ.Поставщик = &Поставщик","И ВТ.Поставщик В ИЕРАРХИИ (&Поставщик)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ ЦеныПоставщиковСрезПоследних.Поставщик = &Поставщик","ГДЕ ЦеныПоставщиковСрезПоследних.Поставщик В ИЕРАРХИИ (&Поставщик)");
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ.Поставщик = &Поставщик","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ ЦеныПоставщиковСрезПоследних.Поставщик = &Поставщик","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Роль) Тогда 
		Запрос.УстановитьПараметр("РольПользователя", Роль);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И СоответствиеОбъектРольСрезПоследних.РольПользователя = &РольПользователя","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Роль) и ЗначениеЗаполнено(Контрагент) Тогда
	    Запрос.Текст = СтрЗаменить(Запрос.Текст,"И СоответствиеОбъектРольСрезПоследних.РольПользователя = &РольПользователя","ИЛИ СоответствиеОбъектРольСрезПоследних.РольПользователя = &РольПользователя)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ.Поставщик = &Поставщик","И ( ВТ.Поставщик = &Поставщик");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Номенклатура.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = Номенклатура.Добавить();
		НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НовСтр.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
		
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОтобратьКонтрагентовПоРоли(Команда)
	
	ОтобратьКонтрагентовПоРолиСервер();	
	
	Элементы.Номенклатура.Видимость = Ложь;	
	Элементы.КонтрагентСписок.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьКонтрагентовПоРолиСервер()

	Номенклатура.Очистить();
	КонтрагентСписок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеОбъектРольСрезПоследних.Объект КАК Контрагент
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектРоль.СрезПоследних КАК СоответствиеОбъектРольСрезПоследних
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СоответствиеОбъектРольСрезПоследних.Объект) = ТИП(Справочник.Контрагенты)
	|	И СоответствиеОбъектРольСрезПоследних.РольПользователя = &РольПользователя";
	
	Если ЗначениеЗаполнено(Роль) Тогда 
		Запрос.УстановитьПараметр("РольПользователя", Роль);
	Иначе
		Сообщить("Заполните роль.");
		Возврат;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Номенклатура.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = КонтрагентСписок.Добавить();
		НовСтр.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого Стр Из Номенклатура Цикл
		
		Стр.Выбрать = Истина;
		
	КонецЦикла;
	
	Для каждого Стр Из КонтрагентСписок Цикл
		
		Стр.Выбрать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого Стр Из Номенклатура Цикл
		
		Стр.Выбрать = Ложь;
		
	КонецЦикла;
	
	Для каждого Стр Из КонтрагентСписок Цикл
		
		Стр.Выбрать = Ложь;
		
	КонецЦикла;

КонецПроцедуры
