
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//АК БЕЛН 01.06+	
	//ОткрытьФорму("Обработка.ГрафикРаботы_Магазины.Форма.Форма", , , , ПараметрыВыполненияКоманды.Окно);
	ОткрытьФорму("Обработка.ГрафикРаботыСотрудниковМагазина.Форма.Форма", , , , ПараметрыВыполненияКоманды.Окно);
	//АК БЕЛН 01.06-
	//+++АК mika 2018.08.09 ИП-00019475 "Статистика использования(Удалить)"↓
	ОбщегоНазначенияСервер.СтатистикаИспользованияПодсистемДобавитьЗапись(Новый Структура("Подсистема, ИмяОбъекта, ИмяФормы, ИмяЭлемента, ДопИнформация", 
			"Магазины", "ОбщаяКоманда.ГрафикРаботы" , , ,"ОткрытьФорму(Обработка.ГрафикРаботыСотрудниковМагазина.Форма.Форма)")); 
	//---АК mika
КонецПроцедуры
