
Процедура ПередЗаписью(Отказ)
	Если НЕ ПометкаУдаления Тогда
		//Проверка дублей пользователя системы
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	МЙ_ПользовательВетис.Ссылка
		|ИЗ
		|	Справочник.МЙ_ПользовательВетис КАК МЙ_ПользовательВетис
		|ГДЕ
		|	МЙ_ПользовательВетис.Ссылка <> &Ссылка
		|	И МЙ_ПользовательВетис.ПользовательСистемы = &Пользователь
		|	И МЙ_ПользовательВетис.Организация = &Организация
		|	И НЕ МЙ_ПользовательВетис.ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Пользователь", ПользовательСистемы);
		Запрос.УстановитьПараметр("Организация", Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сообщить(?(ЗначениеЗаполнено(ПользовательСистемы), "Для пользователя " + ПользовательСистемы, "В качестве значения по умолчанию") + " уже создан элемент " + Выборка.Ссылка, СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры
