
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата() - 9 * 60 * 60));
	Запрос.УстановитьПараметр("ТипКИТелефон",Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипКИПочта",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Дежурные.Дежурный,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформацияПочта.Представление КАК СТРОКА(100))) КАК Почта,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформацияТелефон.Представление КАК СТРОКА(100))) КАК Телефон
	               |ИЗ
	               |	РегистрСведений.Дежурные КАК Дежурные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	               |		ПО Дежурные.Дежурный = КонтактнаяИнформацияТелефон.Объект
	               |			И (КонтактнаяИнформацияТелефон.Тип = &ТипКИТелефон)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияПочта
	               |		ПО Дежурные.Дежурный = КонтактнаяИнформацияПочта.Объект
	               |			И (КонтактнаяИнформацияПочта.Тип = &ТипКИПочта)
	               |ГДЕ
	               |	Дежурные.Период = &Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Дежурные.Дежурный";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДежурныйСегодня = Выборка.Дежурный;
		Если ЗначениеЗаполнено(Выборка.Телефон) Тогда 
			Телефон = "+7 499 350 77 98, " + Выборка.Телефон;
		Иначе
			Телефон = "+7 499 350 77 98";
		КонецЕсли;
		Почта = Выборка.Почта;
	КонецЕсли;	
	
КонецПроцедуры
