
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АК_РассылкиПоставщикамТехнологам Приход
	Движения.АК_РассылкиПоставщикамТехнологам.Записывать = Истина;
	Движения.АК_РассылкиПоставщикамТехнологам.Очистить();
	Движение = Движения.АК_РассылкиПоставщикамТехнологам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Производитель = Производитель;
	Движение.Технолог = Технолог;
	Движение.УведомлятьТехнологаПриРассылке = УведомлятьТехнологаПриРассылке;
	Движение.УведомлятьПоставщикаПриРассылке = УведомлятьПоставщикаПриРассылке;
	Движение.КоличествоОбращений = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
