
//+++АК LATV 2018.10.01 ИП-00019985
Функция ЗагрузитьСписокИзВетис(Параметры, АдресХранилища) Экспорт

	Прокси = ОбменССистемойВетис.ПолучитьПроксиProduct(Параметры.НастройкаApi);
	ListOptions = ОбменССистемойВетис.ПолучитьListOptionsИзПрокси(Прокси);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЙ_ТипыПродукции.Код КАК Код,
		|	МЙ_ТипыПродукции.Наименование,
		|	МЙ_ТипыПродукции.Ссылка
		|ИЗ
		|	Справочник.МЙ_ТипыПродукции КАК МЙ_ТипыПродукции
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Группа = Справочники.МЙ_ВидПродукцииВетис.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование);
		Если Группа.Пустая() Тогда
			Группа = Справочники.МЙ_ВидПродукцииВетис.СоздатьГруппу();
			Группа.Наименование=ВыборкаДетальныеЗаписи.Наименование;
			Группа.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи.Сбросить();
	КодЭл=100000000;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Группа= Справочники.МЙ_ВидПродукцииВетис.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование);
		КодЭл=100000000*Группа.Код;
		ТипПродукции= ВыборкаДетальныеЗаписи.код;
		Смещение = 0;
		Пока Истина Цикл
			ListOptions.offset = Смещение;
			Ответ = Прокси.GetProductByTypeList(ListOptions, СОКРЛП(ТипПродукции));
			Для Каждого стр из Ответ.Product Цикл
				КодЭл=КодЭл+1;
				Эл=справочники.МЙ_ВидПродукцииВетис.НайтиПоРеквизиту("GUID",стр.GUID);
				Если Эл.Ссылка.Пустая() Тогда
					эл=справочники.МЙ_ВидПродукцииВетис.СоздатьЭлемент();
				Иначе
					Эл=эл.ПолучитьОбъект();
				КонецЕсли;
				Эл.Код=Формат(КодЭл,"ЧВН=; ЧГ=");
				Эл.GUID=стр.GUID;
				эл.UUID=стр.UUID;
				Эл.Наименование=Стр.name;
				Эл.Статус = Стр.status;
				Эл.Родитель=Группа.Ссылка;
				Эл.Коды=стр.code;
				Эл.ТипПродукции=ВыборкаДетальныеЗаписи.Ссылка;
				Эл.Активность=стр.active;
				Эл.Записать();
				//Состояние(стр.name);
			КонецЦикла;
			Если Ответ.Count + Смещение >= Ответ.Total Тогда 
				Прервать;
			КонецЕсли;
			Смещение = Смещение + ListOptions.Count;
			
		КонецЦикла;
	КонецЦикла;

КонецФункции
