
&НаКлиенте
Процедура ПродукцияВетисОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//ЭтаФорма.Запись.ТипПродукции=ВыбранноеЗначение.ТипПРодукции;	
	//ЭтаФорма.Запись.ВидПродукции=ВыбранноеЗначение.ВидПРодукции;
	ЭтаФорма.Запись.ТипПродукции= ЗначРекв(ВыбранноеЗначение,"ТипПРодукции");	
	ЭтаФорма.Запись.ВидПродукции= ЗначРекв(ВыбранноеЗначение,"ВидПРодукции");
КонецПроцедуры

//+++АК BELN 2018.02.01
&НаСервереБезКонтекста
Функция ЗначРекв(Ссылка,ИмяРекв)
	Возврат Ссылка[ИмяРекв]
КонецФункции // ()
 
//---АК BELN 2018.02.01 