
&НаКлиенте
Процедура Выбрать(Команда)
	СтруктураВозврата=Новый Структура;
	//СтруктураВозврата.Вставить("Контрагент",Контрагент);
	ВыбранныеСтроки=ТабОстатков.НайтиСтроки(Новый Структура("Пометка",Истина));
	СтруктураВозврата.Вставить("ВыбранныеСтроки",ВыбранныеСтроки);
	СтруктураВозврата.Вставить("Режим",Режим);
	ОповеститьОВыборе(СтруктураВозврата);
    Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса="ВЫБРАТЬ
	             |	ЛОЖЬ КАК Пометка,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.Сделка,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.УИН_Этапа,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.Комплектация,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.УИН_СтрокиКомплектации,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.ДатаПлатежа,
	             |	РасчетыПоСделкамСПоставщикамиОстатки.СуммаОстаток КАК Сумма,
	             |	ЕСТЬNULL(Предпоступление.Ссылка.Магазин, СделкаСПоставщикомГрафикОплат.СтруктурнаяЕдиница) КАК Магазин,
	             |	ПредпоступлениеТовары.Ссылка.ДатаАкта КАК АктПодписан,
	             |	СделкаСПоставщикомГрафикОплат.Номенклатура,
	             |	СделкаСПоставщикомГрафикОплат.Цена,
	             |	СделкаСПоставщикомГрафикОплат.НомерСтрокиГрафика КАК Этап
	             |ИЗ
	             |	РегистрНакопления.РасчетыПоСделкамСПоставщиками.Остатки(, Сделка.Контрагент = &Контрагент) КАК РасчетыПоСделкамСПоставщикамиОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	             |		ПО РасчетыПоСделкамСПоставщикамиОстатки.Сделка = СделкаСПоставщикомГрафикОплат.Ссылка
	             |			И РасчетыПоСделкамСПоставщикамиОстатки.УИН_Этапа = СделкаСПоставщикомГрафикОплат.УИН_Строки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредпоступлениеПоКомплектации.Товары КАК ПредпоступлениеТовары
	             |		ПО РасчетыПоСделкамСПоставщикамиОстатки.Комплектация = ПредпоступлениеТовары.Ссылка
	             |			И РасчетыПоСделкамСПоставщикамиОстатки.УИН_СтрокиКомплектации = ПредпоступлениеТовары.УИН_Строки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредпоступлениеПоКомплектации КАК Предпоступление
	             |		ПО РасчетыПоСделкамСПоставщикамиОстатки.Комплектация = Предпоступление.Ссылка
	             |			И РасчетыПоСделкамСПоставщикамиОстатки.Комплектация = Предпоступление.Ссылка
	             |ГДЕ
	             |	(РасчетыПоСделкамСПоставщикамиОстатки.СуммаОстаток < 0
	             |				И &Режим = 1
	             |			ИЛИ РасчетыПоСделкамСПоставщикамиОстатки.СуммаОстаток > 0
	             |				И &Режим = 2)";
	Запрос=новый Запрос(ТекстЗапроса);			 
	Запрос.УстановитьПараметр("Режим",Параметры.Режим);
	Запрос.УстановитьПараметр("Контрагент",Параметры.Контрагент);
	Таб=Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Таб,"ТабОстатков");
	Режим = Параметры.Режим;
КонецПроцедуры

&НаКлиенте
Процедура ТабОстатковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабОстатковПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыделенные(Команда)
	Для Каждого Стр Из Элементы.ТабОстатков.ВыделенныеСтроки Цикл
		ТабОстатков.НайтиПоИдентификатору(Стр).Пометка = Истина;
	КонецЦикла;	
КонецПроцедуры
