
&НаСервере
Процедура УстановитьПараметрКомпоновки(ИмяПараметра, Значение) Экспорт
	
	мКомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	
	мПараметр = мКомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
    мПараметр.Значение      = Значение;
    мПараметр.Использование = Истина;
	
	мПараметр = мКомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	мПараметр.Значение      = Значение;
    мПараметр.Использование = Истина;
    
КонецПроцедуры

&НаСервере
Процедура СформироватьСервер()
	
	СкомпоноватьРезультат();
	
КонецПроцедуры	


&НаКлиенте
Процедура СформироватьСвоя(Команда)
	
	СформироватьСервер();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Задание")
			И ЗначениеЗаполнено(Параметры.Задание) Тогда
		УстановитьПараметрКомпоновки("Задание", Параметры.Задание);	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьСервер();
	
КонецПроцедуры
