
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Магазины_Клиент.УправлениеОкнамиМагазинов("Товародвижения");
	ОткрытьФорму("Обработка.РабочийСтолПродавца.Форма.ФормаТовародвижения", , , "ТД_РабочийСтол", ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
