
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    Параметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачПериода").ИдентификаторПользовательскойНастройки);
    Параметр.Значение = НачалоДня(ТекущаяДата());
    Параметр.Использование = Истина;
	
	Параметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонПериода").ИдентификаторПользовательскойНастройки);
    Параметр.Значение = КонецДня(ТекущаяДата());
    Параметр.Использование = Истина;
	
КонецПроцедуры