
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабТовары.Очистить();
	ТабТовары.Вывести(Обработки.УстановкаАкцийПоНоменклатуре.ПолучитьМакет("МакетСпецАкции"));
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСервер()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураСпр.Ссылка,
	               |	НоменклатураСпр.Наименование
	               |ИЗ
	               |	Справочник.Номенклатура КАК НоменклатураСпр
	               |ГДЕ
	               |	НоменклатураСпр.ЭтоГруппа = ЛОЖЬ";
				   
	Результаты = Запрос.ВыполнитьПакет();
	ТабКеш = Результаты[0].Выгрузить();
	
	Для н = 2 По ТабТовары.ВысотаТаблицы Цикл
		БылаНайденаНоменклатура = Ложь;
		ТабТовары.Область(н, 2, н, 2).Текст = "";
		Для Каждого СтрокаКеш Из ТабКеш Цикл
			Если СокрЛП(НРег(СтрокаКеш.Наименование)) = СокрЛП(НРег(ТабТовары.Область(н, 1, н, 1).Текст)) Тогда
				БылаНайденаНоменклатура = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если Не БылаНайденаНоменклатура Тогда
			ТабТовары.Область(н, 2, н, 2).Текст = "Номенклатура не найдена по наименованию";
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураСпр.Ссылка,
	               |	НоменклатураСпр.Наименование
	               |ИЗ
	               |	Справочник.Номенклатура КАК НоменклатураСпр
	               |ГДЕ
	               |	НоменклатураСпр.ЭтоГруппа = ЛОЖЬ";
				   
	Результаты = Запрос.ВыполнитьПакет();
	ТабКеш = Результаты[0].Выгрузить();
	
	Для н = 2 По ТабТовары.ВысотаТаблицы Цикл
		БылаНайденаНоменклатура = Ложь;
		Для Каждого СтрокаКеш Из ТабКеш Цикл
			Если СокрЛП(НРег(СтрокаКеш.Наименование)) = СокрЛП(НРег(ТабТовары.Область(н, 1, н, 1).Текст)) Тогда
				СпрОбъект = СтрокаКеш.Ссылка.ПолучитьОбъект();
				СпрОбъект.ОбязателенВАссортиментеМагазиновС = Объект.ДатаНачала;
				СпрОбъект.ОбязателенВАссортиментеМагазиновПо = Объект.ДатаОкончания;
				СпрОбъект.СпецАссортиментМожноВывестиСМагазинов.Очистить();
				Для Каждого СтрокаМагаз Из Объект.Магазины Цикл
					СтрокаДоб = СпрОбъект.СпецАссортиментМожноВывестиСМагазинов.Добавить();
					СтрокаДоб.Магазин = СтрокаМагаз.СтруктурнаяЕдиница;
				КонецЦикла;	
				СпрОбъект.Записать();
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаписатьДанныеВТовары(Команда)
	
	ЗаписатьНаСервере();
	Предупреждение("Данные успешно записаны");
	
КонецПроцедуры
