
Процедура УстановитьДоступностьЗапрещена()
	
	Элементы.Запрещена.Доступность = Запись.Выведена;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//mind
	Если ОткрытоИзМагазина Тогда
		
		Если ТекущийОбъект.Выведена
				И ТекущийОбъект.Номенклатура.КатегорияАссортимента = Перечисления.КатегорииАссортимента.Необязательный Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТоргТочка"	, ТекущийОбъект.ТорговаяТочка);
			Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТоварныйАссортиментТочекСрезПоследних.Выведена
			|ИЗ
			|	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(
			|			,
			|			ТорговаяТочка = &ТоргТочка
			|				И Номенклатура = &Номенклатура) КАК ТоварныйАссортиментТочекСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварныйАссортиментТочекСрезПоследних.ТорговаяТочка) КАК КолвоМагазинов,
			|	СУММА(ВЫБОР
			|			КОГДА ТоварныйАссортиментТочекСрезПоследних.Выведена
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КолвоВыведенных
			|ИЗ
			|	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(, Номенклатура = &Номенклатура) КАК ТоварныйАссортиментТочекСрезПоследних";
						   
			Результаты = Запрос.ВыполнитьПакет();
			Выборка = Результаты[0].Выбрать();
			Если Выборка.Следующий()
					И НЕ Выборка.Выведена Тогда
				ВыборкаМагазины = Результаты[1].Выбрать();
				Если ВыборкаМагазины.Следующий()
						И ТипЗнч(ВыборкаМагазины.КолвоМагазинов) = Тип("Число")
						И ВыборкаМагазины.КолвоМагазинов > 0 Тогда
					Если ВыборкаМагазины.КолвоВыведенных / ВыборкаМагазины.КолвоМагазинов >= 0.5 Тогда
						Сообщить("Этому товару назначена категория Необязательный. Он уже выведен более чем на 50 процентах магазинов. Для вывода его с вашего магазина обращайтесь к Татьяне Янышевой или в управление заказов.");
						Отказ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		//АК БЕЛН 05.04.2017+
		Если ТекущийОбъект.Выведена
				И ТекущийОбъект.Номенклатура.КатегорияАссортимента = Перечисления.КатегорииАссортимента.Новинки Тогда

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Магазин"		, ТекущийОбъект.ТорговаяТочка);
			Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МестаХраненияВМагазинах.Магазин,
			|	МестаХраненияВМагазинах.МестоВыкладки,
			|	МестаХраненияВМагазинах.Хватает
			|ИЗ
			|	РегистрСведений.МестаХраненияВМагазинах КАК МестаХраненияВМагазинах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ВыкладкаПланограммы.МестоВыкладки.Родитель КАК МестоВыкладки
			|		ИЗ
			|			РегистрСведений.ВыкладкаПланограммы КАК ВыкладкаПланограммы
			|		ГДЕ
			|			ВыкладкаПланограммы.Номенклатура = &Номенклатура
			|			И ВыкладкаПланограммы.Планограмма В
			|					(ВЫБРАТЬ
			|						СтруктурныеЕдиницы.Планограмма
			|					ИЗ
			|						Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|					ГДЕ
			|						СтруктурныеЕдиницы.Ссылка = &Магазин)) КАК ВЗ_Выкладка
			|		ПО МестаХраненияВМагазинах.МестоВыкладки = ВЗ_Выкладка.МестоВыкладки
			|ГДЕ
			|	МестаХраненияВМагазинах.Магазин = &Магазин
			|	И МестаХраненияВМагазинах.Хватает";
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Сообщить("Новинку нельзя вывести");
				Отказ = Истина;
			КонецЦикла;
			
		КонецЕсли;
		//АК БЕЛН 05.04.2017-
		
	КонецЕсли;	
	
	//+++АК MIND 2017.12.17 есть магазины, в которых нельзя торговать алкоголем
	Если Запись.Выведена
		И Запись.Запрещена
		И Запись.ТорговаяТочка.НеТоргуетАлкольнойПродукцией
		И ЗначениеЗаполнено(Запись.Номенклатура.ВидПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В указанном магазине нельзя торговать алкогольной продукцией",,,, Отказ);
	КонецЕсли;
	//---АК MIND 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОткрытоИзМагазина = Параметры.ОткрытоИзМагазина;
	Если ОткрытоИзМагазина Тогда
		Попытка
			Запись.ТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
			Элементы.ТорговаяТочка.Доступность = Ложь;
			Элементы.Номенклатура.ФормаВыбора = "Справочник.Номенклатура.Форма.ФормаВыбораДляМагазина.";
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	УстановитьДоступностьЗапрещена();
	
	//Попытка
	//	Если ЗначениеЗаполнено(ПараметрыСеанса.ТорговаяТочкаПоАйпи) Тогда
	//		Элементы.ТорговаяТочка.Доступность = Ложь;
	//		Если НЕ ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
	//			Запись.ТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//Исключение		
	//КонецПопытки;		
	
КонецПроцедуры


&НаКлиенте
Процедура ВыведенаПриИзменении(Элемент)
	
	УстановитьДоступностьЗапрещена();
	
	Если Запись.Запрещена
			И НЕ Запись.Выведена Тогда
		Запись.Запрещена = Ложь;
	КонецЕсли;
	
КонецПроцедуры
