Функция РезультатКомпоновкиВТЗ(КомпоновщикНастроек) Экспорт
    СКД = СхемаКомпоновкиДанных;
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	//КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);

    НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	//НастройкиКомпоновщика.ПараметрыДанных.Элементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	НастройкиКомпоновщика.ПараметрыДанных.Элементы[2].Значение = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	НастройкиКомпоновщика.ПараметрыДанных.Элементы[2].Использование = Истина;
	
	Для каждого ЭлементОтбора Из НастройкиКомпоновщика.Отбор.Элементы Цикл
		
		//ЭлементОтбора.ИдентификаторПользовательскойНастройки
		
		ЭлементОтбораПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);		
		ЭлементОтбора.ПравоеЗначение = ЭлементОтбораПользовательскаяНастройка.ПравоеЗначение;
		ЭлементОтбора.Использование = ЭлементОтбораПользовательскаяНастройка.Использование;
		ЭлементОтбора.ВидСравнения = ЭлементОтбораПользовательскаяНастройка.ВидСравнения;
		//ЗаполнитьЗначенияСвойств(ЭлементОтбора,ЭлементОтбораПользовательскаяНастройка);
	
	КонецЦикла;
	
//ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНач"));
	//ЗначениеПараметра.Значение = НачалоПериода;

	//ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКон"));
	//ЗначениеПараметра.Значение = КонецДня(КонецПериода);

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных , НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

    ТаблицаРезультат = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

    ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

    Возврат ТаблицаРезультат;

КонецФункции