
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВетеринарныеГруппыПереченьНоменклатуры.Ссылка,
		|	ВетеринарныеГруппыПереченьНоменклатуры.Номенклатура
		|ИЗ
		|	Справочник.ВетеринарныеГруппы.ПереченьНоменклатуры КАК ВетеринарныеГруппыПереченьНоменклатуры
		|ГДЕ
		|	ВетеринарныеГруппыПереченьНоменклатуры.Ссылка <> &Ссылка
		|	И ВетеринарныеГруппыПереченьНоменклатуры.Номенклатура В(&Номенклатура)
		|	И НЕ ВетеринарныеГруппыПереченьНоменклатуры.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Номенклатура", Объект.ПереченьНоменклатуры.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(Строка(ВыборкаДетальныеЗаписи.Номенклатура)+" уже используется в группе "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		Отказ=Истина;
	КонецЦикла;
КонецПроцедуры
