
&НаКлиенте
Процедура ИмпортИзEXCEL(Команда)
	ЗаполнитьКэшФизлицСервер();
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Открыть файл с данными";
	ДиалогВыбораФайла.Фильтр    = "Файл Excel (*.xls)|*.xls";
	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	xl = Новый COMОбъект("Excel.Application");
	xl_документ = xl.Workbooks.Open(ДиалогВыбораФайла.ПолноеИмяФайла);
	xl_лист  = xl_документ.Sheets(1);

	й=1;
	КоличествоПустых = 10;
	Пока КоличествоПустых>0 Цикл	
		й = й + 1;
		ФИО = СокрЛП(xl_лист.cells(й,2).value);
		Сумма = СокрЛП(xl_лист.cells(й,3).value);
		//Папка = СокрЛП(xl_лист.cells(й,4).value);
		Если НЕ ЗначениеЗаполнено(ФИО) Тогда
			КоличествоПустых = КоличествоПустых - 1;
			Продолжить;
		КонецЕсли;
		НС=Объект.Состав.Добавить();
		ОтборСтрок=Новый Структура("ФИО",ФИО);
		МассивСтрок=КэшСотрудников.НайтиСтроки(ОтборСтрок);
		Если МассивСтрок.Количество()>0 Тогда
			НС.Сотрудник=МассивСтрок[0].Сотрудник;
		Иначе
			Сообщить("Не нашёл сотрудника из строки "+й+" с ФИО "+ФИО);
		КонецЕсли;	
		Попытка 
			НС.Сумма=Число(Сумма);
		Исключение	
			Сообщить("Ошибка преобразования в число значения из строки "+й);
		КонецПопытки	
	КонецЦикла;	
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшФизлицСервер()
	Если КэшСотрудников.Количество()=0 Тогда
		ТекстЗапроса="ВЫБРАТЬ
		             |	ФизическиеЛица.Ссылка КАК Сотрудник,
		             |	ФизическиеЛица.Наименование КАК ФИО
		             |ИЗ
		             |	Справочник.ФизическиеЛица КАК ФизическиеЛица";
		Запрос=Новый Запрос(ТекстЗапроса);
		ТЗ=Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(ТЗ,"КэшСотрудников");
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
	Иначе
		
		//
		ГраницаЗапретаРедактирования = Константы.ГраницаЗапретаРедактированияУдержанийСФизЛиц.Получить();
		Если КонецДня(ГраницаЗапретаРедактирования) >= КонецДня(Объект.Дата) Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан ответственный!", Отказ);
	КонецЕсли;
	
КонецПроцедуры
