&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму(ПолучитьПолноеИмяФормы("ВыборСтандартногоПериода"), ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ДатаНачала	 = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	//Если (ТекущийПериод.ДатаНачала <> Объект.ДатаНачала ИЛИ ТекущийПериод.ДатаОкончания <> КонецДня(Объект.ДатаОкончания)) И ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.ДатаНачала) И  ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
	//	
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииПериодаЗавершение", ЭтотОбъект);
	//	Текст = НСтр("ru='При изменении периода сверки табличная часть будет очищена. Изменить период?'");
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	ПоказатьВопрос(ОписаниеОповещения, Текст, Режим, 0, КодВозвратаДиалога.Да);
	//	
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииПериодаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТекущийПериод.ДатаНачала	 = Объект.ДатаНачала;
		ТекущийПериод.ДатаОкончания	 = Объект.ДатаОкончания;
		ЗаполнитьНаСервере();
	Иначе
		Объект.ДатаНачала	 = ТекущийПериод.ДатаНачала;
		Объект.ДатаОкончания = ТекущийПериод.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Функция ПолучитьПолноеИмяФормы(ИмяФормы)

    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
    Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	//Если Вопрос("Таблицы будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
	//	Возврат;
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить("Выберите контрагента");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Сообщить("Выберите даты");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьНаСервере()
	ТаблицаРасчеты.Очистить();
	Объект.ТаблицаЗаказы.Очистить();
	
	Об=РеквизитФормыВЗначение("Объект");
	Прокси = Об.ПолучитьПрокси();
	
	Если Прокси = Неопределено Тогда
		Сообщить(НСтр("ru='Не удалось установить соединение с информационной базой.';en='Could not establish a connection to the database.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура("ИНН, ДатаНачала, ДатаОкончания, НаименованиеПолное, НаименованиеКонтрагента", Объект.Логин, Объект.ДатаНачала,?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания,'39991231235959'),Справочники.Организации.НайтиПоРеквизиту("ИНН",Объект.Логин).НаименованиеПолное,Объект.Контрагент);
	ДанныеМП = Новый ХранилищеЗначения(СтруктураДанных, Новый СжатиеДанных(9));
	
	Попытка 
		СтруктураОтвета = Прокси.ПолучитьДанныеСверки(ДанныеМП).Получить();	
	Исключение
		Сообщить("Не удалось получить данные по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Если СтруктураОтвета.Свойство("ОписаниеОшибок") Тогда
		Сообщить(СтруктураОтвета.ОписаниеОшибок);
		Возврат;
	КонецЕсли;
	ДанныеДокументов=СтруктураОтвета.ДанныеДокументов;
	ХранилищеОбщихНастроек.Сохранить("ДанныеДокументов",,СтруктураОтвета.ДанныеДокументов);
	ХранилищеОбщихНастроек.Сохранить("ИндексыДокументов",,СтруктураОтвета.ИндексыДокументов);
	СоответствиеТД=СтруктураОтвета.ТД;
	Для каждого Эл Из СоответствиеТД Цикл
		ТаблицаРасчеты.Вывести(Эл.Значение);
		ТаблицаРасчеты.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла; 

	
	Результат=ЗначениеВСтрокуВнутр(СтруктураОтвета);
	ТаблицаЗаказы=СтруктураОтвета.ТаблицаЗаказы;
	Для каждого Стр Из ТаблицаЗаказы Цикл
	    НовСтр=Объект.ТаблицаЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		НовСтр.Заказ="Заказ №"+Стр.НомерЗаказа+" от "+Строка(Формат(Стр.ДатаЗаказа,"ДФ=dd.MM.yyyy"));
	КонецЦикла; 
КонецПроцедуры
//

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект,Параметры);
	
	Объект.Организация=Справочники.Организации.НайтиПоРеквизиту("ИНН",Объект.Логин);
	Об=РеквизитФормыВЗначение("Объект");
	Прокси = Об.ПолучитьПрокси();
	
	Если Прокси = Неопределено Тогда
		Сообщить(НСтр("ru='Не удалось установить соединение с информационной базой.';en='Could not establish a connection to the database.'"));
		Возврат;
	КонецЕсли;
	Попытка 
		СтруктураОтвета = Прокси.ПолучитьОрганизации();	
	Исключение
		Сообщить("Не удалось данные по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	СписокКонтрагентов=СтруктураОтвета.Получить();
	Для каждого Эл Из СписокКонтрагентов Цикл
		Если Эл.Значение="Вкусвилл" Или Эл.Значение="Луг да Поле" Тогда
			Элементы.Контрагент.СписокВыбора.Добавить(Эл.Значение);
		КонецЕсли; 
	КонецЦикла;
	Объект.ДатаНачала=НачалоМесяца(ТекущаяДата());
	Объект.ДатаОкончания=КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчетыВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Область.Низ=Область.Верх и Область.Лево=Область.Право и Область.Лево=7 и Область.Верх>=10 Тогда
		ИнДок=Область.Верх-10;
	    ПараметрыФормы = Новый Структура();
		ВидДок="";
		СсылкаДок=Неопределено;
		СформироватьСтруктуруДляОткрытияФормы(ПараметрыФормы,ВидДок,ИнДок,СсылкаДок);
		
		Если СсылкаДок<>Неопределено Тогда
			Если ВидДок="РасходИзБанка" Тогда

			    ОткрытьФорму(ПолучитьПолноеИмяФормы("ФормаРасходИзБанкаУправляемая"), ПараметрыФормы, ЭтаФорма);
				
				
			ИначеЕсли ВидДок="ПоступлениеВБанк" Тогда

			    ОткрытьФорму(ПолучитьПолноеИмяФормы("ФормаПоступлениеВБанкУправляемая"), ПараметрыФормы, ЭтаФорма);
				
			ИначеЕсли ВидДок="ПоступлениеТоваровУслуг" Тогда
				Объект.Товары.Очистить();
			    ОткрытьФорму(ПолучитьПолноеИмяФормы("ФормаПоступлениеТоваровУслугУправляемая"), ПараметрыФормы, ЭтаФорма);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьСтруктуруДляОткрытияФормы(ПараметрыФормы,ВидДок,ИнДок,СсылкаДок)

		ИндексыДокументов=ХранилищеОбщихНастроек.Загрузить("ИндексыДокументов");
		ДанныеДокументов=ХранилищеОбщихНастроек.Загрузить("ДанныеДокументов");
		СсылкаДок=ИндексыДокументов.Получить(ИнДок);
		Если СсылкаДок<>Неопределено Тогда
			СтруктураДок=ДанныеДокументов.Получить(СсылкаДок);
			СтруктураРекв=СтруктураДок.Реквизиты;
			ВидДок =СтруктураРекв.ВидДок;
			Если СтруктураРекв.ВидДок="РасходИзБанка" Тогда
				
			    ПараметрыФормы = Новый Структура();
			    ПараметрыФормы1 = Новый Структура();
				Для каждого Эл Из СтруктураРекв Цикл
				    ПараметрыФормы.Вставить(Эл.Ключ,Эл.Значение);
				    ПараметрыФормы1.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;
				ПараметрыФормы.Вставить("СтрукПараметры",ПараметрыФормы1);
				
				
			ИначеЕсли СтруктураРекв.ВидДок="ПоступлениеВБанк" Тогда
			    ПараметрыФормы = Новый Структура();
			    ПараметрыФормы1 = Новый Структура();
				Для каждого Эл Из СтруктураРекв Цикл
				    ПараметрыФормы.Вставить(Эл.Ключ,Эл.Значение);
				    ПараметрыФормы1.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;
				ПараметрыФормы.Вставить("СтрукПараметры",ПараметрыФормы1);

				
			ИначеЕсли СтруктураРекв.ВидДок="ПоступлениеТоваровУслуг" Тогда
				
				ТоварыКЗагрузке=СтруктураДок.ТабличныеЧасти.Товары;
			    ПараметрыФормы = Новый Структура();
			    ПараметрыФормы1 = Новый Структура();
				Для каждого Эл Из СтруктураРекв Цикл
				    ПараметрыФормы.Вставить(Эл.Ключ,Эл.Значение);
				    ПараметрыФормы1.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;
				ПараметрыФормы.Вставить("ИнДок",ИнДок);
				ПараметрыФормы.Вставить("СтрукПараметры",ПараметрыФормы1);
			КонецЕсли; 
		КонецЕсли; 

КонецПроцедуры
  
