
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Отчет.НеоплаченныеЗаявкиНаУслугиМатериалы.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Отбор = Новый Структура;
	//Отбор.Вставить("ПериодОтчета",Новый СтандартныйПериод(ПараметрКоманды.Дата,ПараметрКоманды.Дата));
	Отбор.Вставить("Заявка",ПараметрКоманды);
	//Отбор.Вставить("БезОтбораПериода",Истина);
	
	ПараметрыФормы = Новый Структура("Отбор,СФормироватьПриОткрытии",Отбор,Истина );
	ПараметрыФормы.Вставить("КлючВарианта","ВсеЗаявки");
	
	
	ОткрытьФорму("Отчет.НеоплаченныеЗаявкиНаУслугиМатериалы.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
