
&НаКлиенте
Процедура СоставНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные=Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Контрагент)   Тогда
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка=Ложь;
	СоставНоменклатурыКонтрагента=ПолучитьСоставНоменклатурыКонтрагентаПоСделкам(ТекущиеДанные.Контрагент);
	ФормаВыбора=ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора");
	ФормаВыбора.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбора.Отбор.Ссылка.Использование = Истина;
	ФормаВыбора.Отбор.Ссылка.Значение = СоставНоменклатурыКонтрагента;
	ВыбЗначение=ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВыбЗначение) Тогда
		ТекущиеДанные.Номенклатура=ВыбЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоставНоменклатурыКонтрагентаПоСделкам(Контрагент)
	ТекстЗапроса="ВЫБРАТЬ
	|	СделкаСПоставщикомГрафикОплат.Номенклатура
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка.Проведен
	|	И СделкаСПоставщикомГрафикОплат.Ссылка.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.Номенклатура";
	Запрос=Новый Запрос(ТекстЗапроса);			 
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Спис=Новый СписокЗначений();
	Спис.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Возврат Спис;
	
КонецФункции	
