
&НаСервере
Процедура СохранитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТелЛичный = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица;
	ТелОсновной = Справочники.ВидыКонтактнойИнформации.ТелефонСлужебный;
	ТипТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(ФизЛицо);
	Набор.Отбор.Тип.Установить(ТипТелефон);
	ТабКонтИнфа = Набор.Выгрузить();
	КолвоСтрок = ТабКонтИнфа.Количество();
	Для н = 1 По КолвоСтрок Цикл
		Если ТабКонтИнфа[КолвоСтрок - н].Вид = ТелЛичный Тогда
			ТабКонтИнфа.Удалить(КолвоСтрок - н);
		ИначеЕсли ТабКонтИнфа[КолвоСтрок - н].Вид = ТелОсновной Тогда
			ТабКонтИнфа.Удалить(КолвоСтрок - н);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
		СтрокаДоб = ТабКонтИнфа.Добавить();
		СтрокаДоб.Объект = ФизЛицо;
		СтрокаДоб.Тип = ТипТелефон;
		СтрокаДоб.Вид = ТелОсновной;
		СтрокаДоб.Представление = ОсновнойТелефон;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныйТелефон) Тогда
		СтрокаДоб = ТабКонтИнфа.Добавить();
		СтрокаДоб.Объект = ФизЛицо;
		СтрокаДоб.Тип = ТипТелефон;
		СтрокаДоб.Вид = ТелЛичный;
		СтрокаДоб.Представление = ДополнительныйТелефон;
	КонецЕсли;
	
	Набор.Загрузить(ТабКонтИнфа);
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если СтрДлина(СокрЛП(ОсновнойТелефон)) <> 11
		ИЛИ Лев(ОсновнойТелефон, 1) <> "8" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основной телефон должен обязательно состоять из 11 цифр и начинаться с 8-ки");
		Возврат;
	КонецЕсли;
	
	СохранитьНаСервере();
	
	Закрыть(ОсновнойТелефон + ?(ЗначениеЗаполнено(ДополнительныйТелефон), "; " + ДополнительныйТелефон, ""));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизЛицо = Параметры.ФизЛицо;
	СтрокаТелефоны = СтрЗаменить(Параметры.СтрокаТелефоны, ";", Символы.ПС);
	ОсновнойТелефон = СтрПолучитьСтроку(СтрокаТелефоны, 1);
	Если СтрЧислоСтрок(СтрокаТелефоны) > 1 Тогда
		ДополнительныйТелефон = СокрЛП(СтрПолучитьСтроку(СтрокаТелефоны, 2));
	КонецЕсли;	
	
КонецПроцедуры
