
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
	//ТолькоПросмотр = Истина;
	
	//+++АК sils 08.06.2018 ИП-00018876
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));
	//---АК
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	
	КаталогФотографий = СокрЛП(Константы.МП_КаталогХраненияФайловЗадачМП.Получить());
	
	Если Прав(КаталогФотографий, 1) <> "\" Тогда
		КаталогФотографий = КаталогФотографий + "\";
	КонецЕсли;
	
	ИмяФайла = КаталогФотографий + Объект.ОтносительноеИмяФайла;;
	
	Файл = Новый Файл(ИмяФайла);

	Если Файл.Существует() Тогда
		АдресКартинки = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	КонецЕсли;
	
КонецПроцедуры

//+++АК sils 08.06.2018 ИП-00018876
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Инвентаризация упаковки");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
КонецПроцедуры
