Процедура АкцептоватьЗаявкиСервер(Ссылка, МасНомеров, СоответствиеНомеровИЗаявок) Экспорт
    УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыАвтоакцепта.Контрагент
		|ИЗ
		|	РегистрСведений.КонтрагентыАвтоакцепта КАК КонтрагентыАвтоакцепта";

	Результат = Запрос.Выполнить();

	МассивКонтрагентов = Результат.Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, Ссылка);
	Запрос.УстановитьПараметр("МасНомерСтроки"	, МасНомеров);
	Запрос.УстановитьПараметр("Услуга"	, Ссылка.Услуги.ВыгрузитьКолонку("Услуга"));
	Запрос.УстановитьПараметр("Магазин"	, Ссылка.Магазин);
	Запрос.УстановитьПараметр("Ремонт"	, Справочники.Услуги.НайтиПоКоду("000000001"));      
	Запрос.УстановитьПараметр("Монтаж"	, Справочники.Услуги.НайтиПоКоду("000000002")); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.Услуга,
	|	СУММА(КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.КомплектацияМагазинаПоСделкамСПоставщиком.УслугиПоСчетам КАК КомплектацияМагазинаПоСделкамСПоставщикомУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияМагазинаПоСделкамСПоставщиком.Услуги КАК Услуги
	|		ПО КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка = Услуги.Ссылка
	|			И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.УИН_Строки = Услуги.УИН_Строки
	|ГДЕ
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка <> &Ссылка
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка.Магазин = &Магазин
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеСредств.Акцептована)
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка.Проведен
	|	И Услуги.Услуга В(&Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Сумма) КАК Сумма,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.УИН_Строки
	|ПОМЕСТИТЬ втГотовыеСуммы
	|ИЗ
	|	Документ.КомплектацияМагазинаПоСделкамСПоставщиком.УслугиПоСчетам КАК КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам
	|ГДЕ
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Ссылка = &Ссылка
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Заявка <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеСредств.ПустаяСсылка)
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеСредств.Акцептована)
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.УИН_Строки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга.СтатьяДДС КАК УслугаСтатьяДДС,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга.СтатьяДДС.ОсновнаяСтатьяДоходовРасходов КАК УслугаСтатьяДР,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Контрагент КАК Контрагент,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Контрагент.Организация КАК ОрганизацияКонтрагента,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Контрагент.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.ДоговорКонтрагента.Организация КАК ОрганизацияДоговора,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Сумма КАК Сумма,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.УИН_Строки,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.НомерСтроки,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.СтавкаНДС,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Аванс,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.НомерСчета,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.ДатаСчета,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.ФормаОплаты,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Комментарий,
	|	ЕСТЬNULL(вт.Сумма, 0) КАК СуммаИзрасходовано,
	|	ЕСТЬNULL(втГотовыеСуммы.Сумма, 0) КАК СуммаИзрасходованоЭтотДок,
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Заявка
	|ИЗ
	|	Документ.КомплектацияМагазинаПоСделкамСПоставщиком.Услуги КАК КомплектацияМагазинаПоСделкамСПоставщикомУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияМагазинаПоСделкамСПоставщиком.УслугиПоСчетам КАК КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам
	|		ПО КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка = КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Ссылка
	|			И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.УИН_Строки = КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.УИН_Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга = вт.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГотовыеСуммы КАК втГотовыеСуммы
	|		ПО КомплектацияМагазинаПоСделкамСПоставщикомУслуги.УИН_Строки = втГотовыеСуммы.УИН_Строки
	|ГДЕ
	|	КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Ссылка = &Ссылка
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.Ссылка = &Ссылка
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслугиПоСчетам.НомерСтроки В(&МасНомерСтроки)
	|	И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга <> &Ремонт И КомплектацияМагазинаПоСделкамСПоставщикомУслуги.Услуга <> &Монтаж";
	
	Результат = Запрос.Выполнить();
	
	//
	мДокЗаявки				= Документы.ЗаявкаНаРасходованиеСредств;
	мДемниченко 			= Справочники.Пользователи.НайтиПоНаименованию("Демниченко Наталия");
	мСтатусНеАкцептована 	= Перечисления.СтатусыЗаявокНаРасходованиеСредств.НеАкцептована;
	мСтатусАкцептована 	= Перечисления.СтатусыЗаявокНаРасходованиеСредств.Акцептована;
	ТекОтветственный		= глЗначениеПеременной("глТекущийПользователь");
	ТекЦФО 					= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ЦФО_12");
	ТекТорговаяТочка 		= Ссылка.Магазин;
	ТекИнициаторЗаявки		= Ссылка.Ответственный.ФизЛицо;
	Счет443					= ПланыСчетов.Финансовый.ЗатратыТочекДляРаспределения;
	
	//
	ВыборкаДДС = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Счет=Справочники.БанковскиеСчета.НайтиПоКоду("000001100");   

	СоотУслуги=Новый Соответствие;
	Пока ВыборкаДДС.Следующий() Цикл
		
		ОбЗаявки = ВыборкаДДС.Заявка.ПолучитьОбъект();	
		
		Если ВыборкаДДС.Сумма+?(СоотУслуги.Получить(ВыборкаДДС.Услуга)=Неопределено,0,СоотУслуги.Получить(ВыборкаДДС.Услуга))+
			ВыборкаДДС.СуммаИзрасходовано+ВыборкаДДС.СуммаИзрасходованоЭтотДок>ВыборкаДДС.Услуга.СуммаНормативная Тогда
			//ОбЗаявки.Статус                 = мСтатусНеАкцептована;
		Иначе
			Если ВыборкаДДС.Заявка.Статус <>мСтатусАкцептована Тогда
				ОбЗаявки.Статус                 = мСтатусАкцептована;
				ОбЗаявки.ДатаАкцептования       =ТекущаяДата();
				ОбЗаявки.КтоАкцептовал          =ТекОтветственный;
				ОбЗаявки.АкцептованыВсеСтроки   =Истина;
				СоотУслуги.Вставить(ВыборкаДДС.Услуга,?(СоотУслуги.Получить(ВыборкаДДС.Услуга)=Неопределено,0,СоотУслуги.Получить(ВыборкаДДС.Услуга))+ВыборкаДДС.Сумма);
				Если ОбЗаявки.ТорговыеТочки.Количество()>0 Тогда
					НоваяСтрока=ОбЗаявки.ТорговыеТочки[0];
					НоваяСтрока.Управляющий 			= ТекОтветственный;
					НоваяСтрока.ДатаАкцепта			= ТекущаяДата();
					НоваяСтрока.Статус			= мСтатусАкцептована;    
				КонецЕсли;
					
				Попытка
					ОбЗаявки.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОбЗаявки.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки; 
				СоответствиеНомеровИЗаявок.Вставить(ВыборкаДДС.НомерСтроки, ОбЗаявки.Ссылка);
				
				Сообщить("Акцептована "+?(ОбЗаявки.Статус=Перечисления.СтатусыЗаявокНаРасходованиеСредств.НеАкцептована,"","") + ОбЗаявки.Ссылка);
				
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

