
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЕстьПравоРедактировать = УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.РедактированиеРегистраЦеныПоставщиков, Ложь)
								ИЛИ УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.ПолныеПраваПоРекламнымМатериалам, Ложь);
								
	ЭтаФорма.ТолькоПросмотр = НЕ ЕстьПравоРедактировать;
	
	//+++АК mika 2018.02.12 ИП-00017505
	//Запретить возможность редактирвоать записи, сформированные документом								
	Если ЗначениеЗаполнено(Запись.Документ) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	//---АК mika ИП-00017505
	
КонецПроцедуры
