
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(объект.Ссылка) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.РасчетОбязательствПоАренде;
		Объект.Дата = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецМесяца(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ЗапролнитьПоВидуОперацииНаСервере();
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ЗапролнитьПоВидуОперацииНаСервере()
	Если Объект.ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений и Объект.СписокСтатейДР.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ СписокДокументов
		               |ИЗ
		               |	Документ.ФормированиеДвиженийПоМСФО.СписокСтатейДР КАК ФормированиеДвиженийПоМСФОСписокСтатейДР
		               |ГДЕ
		               |	ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.Дата < &Дата
		               |	И ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.Проведен
		               |	И ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.Организация = &Организация
		               |	И ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФормированиеДвиженийПоМСФОСписокСтатейДР.Ссылка.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(СписокДокументов.Ссылка.Дата) КАК СсылкаДата
		               |ПОМЕСТИТЬ МаксДата
		               |ИЗ
		               |	СписокДокументов КАК СписокДокументов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СписокДокументов.Ссылка
		               |ИЗ
		               |	СписокДокументов КАК СписокДокументов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДата КАК МаксДата
		               |		ПО СписокДокументов.Ссылка.Дата = МаксДата.СсылкаДата";
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда 
			ПредДок = ТЗ[0].Ссылка;
			Объект.СписокСтатейДР.Загрузить(ПредДок.СписокСтатейДР.Выгрузить());
		Иначе
			Инвестиции = Справочники.СтатьиДоходовРасходов.НайтиПоКоду("61027");
			Если Инвестиции <> Справочники.СтатьиДоходовРасходов.ПустаяСсылка() Тогда
				НовСтр = Объект.СписокСтатейДР.Добавить();
				НовСтр.Статья = Инвестиции.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.СписокСтатейДР.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений");
	Элементы.СтатьяАмортизации.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Дата <> КонецМесяца(Объект.Дата) Тогда
		Объект.Дата = КонецМесяца(Объект.Дата);
	КонецЕсли;
КонецПроцедуры
