Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//		
	//// Подготовим и выведем отчет.
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	//НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//Если ДанныеРасшифровки = Неопределено тогда
	//	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//КонецЕсли;
	//
	//ПараметрПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).ИдентификаторПользовательскойНастройки);
	////ПараметрКонецПериода  = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).ИдентификаторПользовательскойНастройки);
	////ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	////ПараметрКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	//
	//ВнешниеНаборыДанных = Новый Структура;
	////ВнешниеНаборыДанных.Вставить("ТаблицаДанныхПоПоступлению", ТаблицаДанныхПоПоступлению);
	//
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(
	//	СхемаКомпоновкиДанных, 
	//	НастройкиКомпоновкиДанных,
	//	ДанныеРасшифровки
	//);
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(
	//	МакетКомпоновки,
	//	ВнешниеНаборыДанных,
	//	ДанныеРасшифровки
	//);
	//
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.НачатьВывод();
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	//ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры
