&НаСервере
Процедура УстановитьПараметрКомпоновки(ИмяПараметра, Значение) Экспорт
    
    Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра)).Значение      = Значение;
    Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра)).Использование = Истина;
	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра)).Значение      = Значение;
    Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных(ИмяПараметра)).Использование = Истина;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заявка") И ЗначениеЗаполнено(Параметры.Заявка) Тогда
		УстановитьПараметрКомпоновки("Заявка", Параметры.Заявка);	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьСвоя(Команда)
	СформироватьСервер();
КонецПроцедуры

&НаСервере
Процедура СформироватьСервер()
	СкомпоноватьРезультат();
	Обл=Результат.Область("C7:C10");
	Результат.УдалитьОбласть(Обл,ТипСмещенияТабличногоДокумента.ПоВертикали);
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСервер();
КонецПроцедуры
