
&НаКлиенте
Процедура ТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПодбора    =    Новый Структура("ДополнительныеПараметры, ТекстПоиска", "ПодборДляМагазина", Текст);
    ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Номенклатура"), ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Характеристика = ВнешниеДанные.ПолучитьХарактеристикуДляНоменклатуры(Элементы.Товары.ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

Функция ПолучитьФайлДляСтроки(Номенклатура, Характеристика)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Характеристика);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроверкаКачестваТоваров.ИмяФайлаСРасширением,
	               |	ПроверкаКачестваТоваров.ИмяФайла
	               |ИЗ
	               |	Документ.ПроверкаКачестваТоваров КАК ПроверкаКачестваТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПроверкаКачестваТоваровСоставПоказателей.Ссылка КАК Ссылка,
	               |			МАКСИМУМ(ПроверкаКачестваТоваровСоставПоказателей.Нарушение) КАК Нарушение
	               |		ИЗ
	               |			Документ.ПроверкаКачестваТоваров.СоставПоказателей КАК ПроверкаКачестваТоваровСоставПоказателей
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПроверкаКачестваТоваровСоставПоказателей.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ПроверкаКачестваТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ПроверкаКачестваТоваров.Номенклатура = &Номенклатура
	               |	И ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И ПроверкаКачестваТоваров.ПометкаУдаления = ЛОЖЬ
	               |	И ПроверкаКачестваТоваров.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЖурналаПроверкиКачестваТоваров.ПроверкаВыполнена)
	               |	И ПроверкаКачестваТоваров.ИмяФайлаСРасширением <> """"
	               |	И ЕСТЬNULL(ВложенныйЗапрос.Нарушение, ЛОЖЬ) = ЛОЖЬ";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Расширение, ДвоичныеДанные"
					, ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Выборка.ИмяФайлаСРасширением)
					, Новый ДвоичныеДанные(Выборка.ИмяФайла));
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ОткрытьДокументы(Команда)
	
	Для Каждого СтрокаТаб Из Объект.Товары Цикл
		СтрВозврат = ПолучитьФайлДляСтроки(СтрокаТаб.Номенклатура, СтрокаТаб.Характеристика);
		Если СтрВозврат = Неопределено Тогда
			Сообщить("Для товара " + СтрокаТаб.Номенклатура + " не найден протокол проверки качества");
		Иначе
			ИмяФайла = ПолучитьИмяВременногоФайла(СтрВозврат.Расширение);
			СтрВозврат.ДвоичныеДанные.Записать(ИмяФайла);
			ЗапуститьПриложение(ИмяФайла);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
