
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ИД) Тогда
		ИД = ОбщегоНазначенияСервер.ПолучитьНовыйУникальныйИдентификатор("Склады", "ИД");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЯвляетсяЗонойСклада) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	Склады.Ссылка
		               |ИЗ
		               |	Справочник.Склады КАК Склады
		               |ГДЕ
		               |	Склады.ЯвляетсяЗонойСклада = &Ссылка";
					   
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			Сообщить("Сам склад указан в качестве составляющих из зон. Нельзя его указать в качестве зоны другого склада");
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИД = 0;
	
КонецПроцедуры
