
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если НЕ ЗначениеЗаполнено(ДатаНач) ИЛИ НЕ ЗначениеЗаполнено(ДатаКон) ИЛИ ДатаНач > ДатаКон Тогда
	//	Сообщить("Не заполнен или некорректно заполнен период!");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//Пар1 = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
	//Пар1.Значение = ДатаНач;
	//Пар1.Использование = Истина;
	//
	//Пар1 = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
	//Пар1.Значение = КонецДня(ДатаКон);
	//Пар1.Использование = Истина;
		
КонецПроцедуры

