
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Владелец)Тогда
		Объект.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмерения(Объект.Владелец);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ТекуЩиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура)Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмерения(ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБазовуюЕдиницуИзмерения(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Номенклатура.БазоваяЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Номенклатура",			Номенклатура);
	
	Запрос.Текст= 	"ВЫБРАТЬ
	              	|	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
	              	|ИЗ
	              	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	              	|ГДЕ
	              	|	ЕдиницыИзмерения.Владелец = &Номенклатура
	              	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	              	|	И НЕ ЕдиницыИзмерения.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЕдиницаИзмерения;
	КонецЕсли;
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
	
КонецФункции
