
Функция СоздатьФайлХранения(СтрокаТаблицы, РасширениеРезультата)
	
	СпрОбъект = Справочники.Файлы.СоздатьЭлемент();
	СпрОбъект.Наименование 	= СтрокаТаблицы.Представление;
	СпрОбъект.Расширение 	= РасширениеРезультата;
	СпрОбъект.ДополнительныеСвойства.Вставить("Хранилище", Новый ХранилищеЗначения(Новый Картинка(СтрокаТаблицы.ДанныеКартинки)));
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

Функция ПолучитьРеквизитыСохраненияКартинки(ФайлСсылка)
	
	Картинка = Новый Картинка(Справочники.Файлы.ПолучитьИмяФайлаДляОбъекта(ФайлСсылка));
	Возврат Новый Структура("АдресКартинки, Расширение", ПоместитьВоВременноеХранилище(Картинка), ФайлСсылка.Расширение);
	
КонецФункции


&НаКлиенте
Процедура НачалоВыбора(ИмяЭлемента)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
	        ВыбФайл = Новый Файл(ИмяФайла);
			Если НЕ ВыбФайл.Существует() Тогда				
				Сообщить("Не существует файл. "+ИмяФайла);
				Продолжить;
			КонецЕсли;
			ЭтаФорма[ИмяЭлемента] = СоздатьФайлХранения(Новый Структура("Представление, ДанныеКартинки", ВыбФайл.Имя, Новый ДвоичныеДанные(ИмяФайла)), ВыбФайл.Расширение);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытиеВЭлементе(ИмяЭлемента)
	
	СтруктураКартинки = ПолучитьРеквизитыСохраненияКартинки(ЭтаФорма[ИмяЭлемента]);
	ИмяФайла = ПолучитьИмяВременногоФайла(СтруктураКартинки.Расширение);
	Если ПолучитьФайл(СтруктураКартинки.АдресКартинки, ИмяФайла, Ложь) = Истина Тогда
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура УПДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура АктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Для Каждого СтрокаТаб Из ТабРейсы Цикл
		ДокОб = СтрокаТаб.Документ.ПолучитьОбъект();
		Если ЗначениеЗаполнено(УПД) Тогда
			ДокОб.УПД = УПД;
		КонецЕсли;
		Если ЗначениеЗаполнено(Акт) Тогда
			ДокОб.Акт = Акт;
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			ДокОб.СчетФактура = СчетФактура;
		КонецЕсли;
		Если ЗначениеЗаполнено(Приложение) Тогда
			ДокОб.Приложение = Приложение;
		КонецЕсли;
		//ziga
		Если ЗначениеЗаполнено(Заявка) Тогда
			ДокОб.Заявка=Заявка;
			ДокОб.ДокументОснование=Заявка;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументыПолучены) Тогда
			ДокОб.СтатусПолученныхДокументов=ДокументыПолучены;
			ДокОб.ДокументыПолучены=Истина;
		КонецЕсли;
		Если ДокОб.Проведен Тогда
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		//..ziga
		  
			
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.МассивДоки) = Тип("Массив") Тогда
		Для Каждого ЭлМас Из Параметры.МассивДоки Цикл
			СтрокаДоб = ТабРейсы.Добавить();
			СтрокаДоб.Документ = ЭлМас;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УПДОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытиеВЭлементе(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура АктОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытиеВЭлементе(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытиеВЭлементе(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытиеВЭлементе(Элемент.Имя);
	
КонецПроцедуры
