
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокТоварныйАссортимент.Параметры.УстановитьЗначениеПараметра("ТТ", ПараметрыСеанса.ТорговаяТочкаПоАйпи);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоварныйАссортиментПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоварныйАссортиментВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоварныйАссортиментПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ОткрытьФорму("РегистрСведений.ТоварныйАссортиментТочек.Форма.ФормаЗаписи", Новый Структура("ОткрытоИзМагазина", Истина));
	
КонецПроцедуры
