
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
			И ЭтаФорма.Параметры.Свойство("Товар") Тогда
		ОбъектСпр = РеквизитФормыВЗначение("Объект");
		НоваяСтрока = ОбъектСпр.Товары.Добавить();
		НоваяСтрока.Номенклатура = ЭтаФорма.Параметры.Товар;
		ЗначениеВРеквизитФормы(ОбъектСпр, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//
	//Если Объект.ПолностьюЗаменяемыйТовар Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЗначенияСвойствОбъектов.Значение,
	//	|	СУММА(1) КАК КолвоРаз
	//	|ИЗ
	//	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	//	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектов.Объект
	//	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
	//	|ГДЕ
	//	|	ХарактеристикиНоменклатуры.СтатусАктивностиХарактеристики = ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Активна)
	//	|	И ХарактеристикиНоменклатуры.Владелец В
	//	|			(ВЫБРАТЬ
	//	|				АналогиНоменклатурыТовары.Номенклатура
	//	|			ИЗ
	//	|				Справочник.АналогиНоменклатуры.Товары КАК АналогиНоменклатурыТовары
	//	|			ГДЕ
	//	|				АналогиНоменклатурыТовары.Ссылка = &Ссылка)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЗначенияСвойствОбъектов.Значение
	//	|
	//	|ИМЕЮЩИЕ
	//	|	СУММА(1) > 1";
	//				   
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указаны товары с одинаковыми производителем (" + Выборка.Значение +  ") в активных характеристиках. Запись невозможна",,,, Отказ);
	//	КонецЦикла;
	//	
	//КонецЕсли;	
	//
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	АналогиНоменклатурыТовары.Номенклатура,
	               |	АналогиНоменклатурыТовары.Ссылка
	               |ИЗ
	               |	Справочник.АналогиНоменклатуры.Товары КАК АналогиНоменклатурыТовары
	               |ГДЕ
	               |	АналогиНоменклатурыТовары.Ссылка <> &Ссылка
	               |	И АналогиНоменклатурыТовары.Номенклатура В (&Товары)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("Товар " + Выборка.Номенклатура + " уже указан в элементе " + Выборка.Ссылка);
		Отказ = Истина;
	КонецЦикла;	
	
КонецПроцедуры
