
Функция ПечатьШтрихкода(Данные) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
	ТабДок.РазмерКолонтитулаСнизу	= 0;
	ТабДок.РазмерКолонтитулаСверху 	= 0;
	ТабДок.ПолеСверху 	= 5;
	ТабДок.ПолеСнизу 	= 5;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.АвтоМасштаб	= Истина;

	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		е = 1;
		
		Для каждого Ссылка Из Данные Цикл		
			ДобавитьШК(ТабДок, Ссылка);
			
			Если е = 4 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				е = 0;
			КонецЕсли;
			
			е = е + 1;
		КонецЦикла;	
	Иначе
		ДобавитьШК(ТабДок, Данные);
	КонецЕсли;
	
	Возврат ТабДок;
КонецФункции

//+++АК BELN 2018.08.01 ИП-00019403
Функция ПечатьШтрихкодаQR(Данные) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
	ТабДок.РазмерКолонтитулаСнизу	= 0;
	ТабДок.РазмерКолонтитулаСверху 	= 0;
	ТабДок.ПолеСверху 	= 5;
	ТабДок.ПолеСнизу 	= 5;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.АвтоМасштаб	= Истина;

	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		е = 1;
		
		Для каждого Ссылка Из Данные Цикл		
			ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
			Макет = Справочники.AK_Ворота.ПолучитьМакет("ЭтикеткаQR");
			
			ШтрихКод = ПолучитьШтрихкод(Ссылка);
			Область = Макет.ПолучитьОбласть("Этикетка");
			Область.Параметры.Ворота = Ссылка.Наименование;
			//ОбщегоНазначенияКлиентСервер.ДобавитьШтрихкодВОбластьДокумента(Область,Ссылка);
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Штрихкод, 0, 708);
			
			Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
				
				Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				Рисунок.Имя="QrКод";
				Рисунок.Ширина = 187;
				Рисунок.Высота = 187;
				Рисунок.Лево = 10;
				//Рисунок.Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
				
				КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			
				Рисунок.Картинка = КартинкаQRКода;
			КонецЕсли;
			
			
			//Рисунок = Область.Рисунки["ШтрихКод"];
			
			//ПараметрыШК = Новый Структура();
			//ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
			//ПараметрыШК.Вставить("Высота", Рисунок.Высота);
			//ПараметрыШК.Вставить("ТипКода", 4);
			//ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
			//ПараметрыШК.Вставить("РазмерШрифта", 10);
			//ПараметрыШК.Вставить("Штрихкод", Штрихкод);
			//Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
			Область.Параметры.ШК = ШтрихКод;
			ТабДок.Вывести(Область);	
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
			е = е + 1;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ТабДок;
КонецФункции
//---АК BELN 2018.08.01 




Функция ДобавитьШК(ТабДок, Ссылка) Экспорт	
	ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Макет = Справочники.AK_Ворота.ПолучитьМакет("Этикетка");
	
	ШтрихКод = ПолучитьШтрихкод(Ссылка);
	Область = Макет.ПолучитьОбласть("Этикетка");
	Область.Параметры.Ворота = Ссылка.Наименование;
	
	Рисунок = Область.Рисунки["ШтрихКод"];
	
	ПараметрыШК = Новый Структура();
	ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
	ПараметрыШК.Вставить("Высота", Рисунок.Высота);
	ПараметрыШК.Вставить("ТипКода", 4);
	ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШК.Вставить("РазмерШрифта", 10);
	ПараметрыШК.Вставить("Штрихкод", Штрихкод);
	Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
	Область.Параметры.ШК = ШтрихКод;
	ТабДок.Вывести(Область);	
КонецФункции

Функция ПолучитьШтрихкод(Ворота) экспорт
	Возврат Формат(Ворота.Ид, "ЧГ=");
КонецФункции

