
//+++АК LATV 2018.06.10 ИП-00017712.01
Функция ВидыОтчета() Экспорт

	ВидыОтчета = Новый СписокЗначений();
	
	ВидыОтчета.Добавить("ПроверкаПоУсловию",	НСтр("ru = 'Проверка по счету и условию'"));
	ВидыОтчета.Добавить("ПроверкаПоСубконто",	НСтр("ru = 'Проверка по счету отбору по субконто'"));
	
	Возврат ВидыОтчета;

КонецФункции

//+++АК LATV 2018.06.10 ИП-00017712.01
Функция ПараметрыОтчетаПоВиду(ВидОтчета) Экспорт

	ПараметрыОтчета = Новый ТаблицаЗначений();
	ПараметрыОтчета.Колонки.Добавить("Имя");
	ПараметрыОтчета.Колонки.Добавить("Тип");
	ПараметрыОтчета.Колонки.Добавить("Описание");
	
	// СчетФин
	НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
	НоваяСтрокаПараметров.Имя		= "СчетФин";
	НоваяСтрокаПараметров.Тип		= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);
	НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Счета по базе Фин. Задаются через запятую, если необходимо формировать по нескольким (Пример: 01.1,01.4)'");
	
	// СчетБух
	НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
	НоваяСтрокаПараметров.Имя		= "СчетБух";
	НоваяСтрокаПараметров.Тип		= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);
	НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Счета по базе Бух. Задаются через запятую, если необходимо формировать по нескольким (Пример: 01.1,01.4)'");
	
	Если ВидОтчета = "ПроверкаПоУсловию" Тогда
		// УсловиеСравнения
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "УсловиеСравнения";
		НоваяСтрокаПараметров.Тип		= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0);
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Условия сравнения реквизитов регистров бухгалтерии. По-умолчанию Субконто1.Наименование=Субконто1.Наименование'");
		
		// Субконто2Бух
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто2Бух";
		НоваяСтрокаПараметров.Тип		= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0);
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №2 в базе Бух. Задается выражение, которое можно исполнить методом ""Вычислить"" в базе Бух. (Пример: Перечисления.ВидыПлатежейВГосБюджет.Штраф)'");
		
	ИначеЕсли ВидОтчета = "ПроверкаПоСубконто" Тогда
		// Субконто1Фин
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто1Фин";
		НоваяСтрокаПараметров.Тип		= Справочники.ТипВсеСсылки();
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №1 в базе Фин, для выбранных счетов'");
		
		// Субконто1Фин1
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто1Фин1";
		НоваяСтрокаПараметров.Тип		= Справочники.ТипВсеСсылки();
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №1 в базе Фин, для выбранных счетов'");
		
		// Субконто2Фин
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто2Фин";
		НоваяСтрокаПараметров.Тип		= Справочники.ТипВсеСсылки();
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №2 в базе Фин, для выбранных счетов'");
		
		// Субконто2Фин1
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто2Фин1";
		НоваяСтрокаПараметров.Тип		= Справочники.ТипВсеСсылки();
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №2 в базе Фин, для выбранных счетов'");
		
		// Субконто1Бух
		НоваяСтрокаПараметров = ПараметрыОтчета.Добавить();
		НоваяСтрокаПараметров.Имя		= "Субконто1Бух";
		НоваяСтрокаПараметров.Тип		= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0);
		НоваяСтрокаПараметров.Описание	= НСтр("ru = 'Значение субконто №1 в базе Бух. Задается выражение, которое можно исполнить методом ""Вычислить"" в базе Бух. (Пример: Перечисления.ВидыПлатежейВГосБюджет.Штраф)'");
		
	КонецЕсли;
	
	Возврат ПараметрыОтчета;

КонецФункции
