
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	НормативныйКвант = Параметры.НормативныйКвант;
	МинОстаток = Параметры.МинОстаток;
	//+++АК MIND 2018.02.06 принудительно сразу обнулим макс остаток по просьбе Разгуляева, чтобы вывести постепенно в 0
	//МаксОстаток = Параметры.МаксОстаток;
	МаксОстаток = 0;
	
	//+++АК SHEP 2018.10.25 ИП-00020078: небольшая оптимизация, запоминаем ТТ
	УстановитьПривилегированныйРежим(Истина);
	ТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	id_TT = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяТочка, "id_TT");
	id_tov = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "id_tov");
	МожетПродать = МожетПродать(id_TT, id_tov);
	//---АК SHEP 2018.10.25
	
	// квант упаковки
	Запрос = Новый Запрос;
	//+++АК SHEP 2018.10.25 ИП-00020078
	//Запрос.УстановитьПараметр("ТорговаяТочка"	, ПараметрыСеанса.ТорговаяТочкаПоАйпи);
	Запрос.УстановитьПараметр("ТорговаяТочка"	, ТорговаяТочка);
	//---АК SHEP 2018.10.25
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);
	Запрос.УстановитьПараметр("ГруппаУРЗ"		, Номенклатура.ГруппаНоменклатурыУРЗ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоличествоВКоробкеСрезПоследних.Характеристика КАК Характеристика,
	|	КоличествоВКоробкеСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТКоличествоВКоробке
	|ИЗ
	|	РегистрСведений.КоличествоВКоробке.СрезПоследних(, Номенклатура = &Номенклатура) КАК КоличествоВКоробкеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОбеспеченияТорговыхТочек.СрезПоследних(
	|				,
	|				ГруппаУРЗ = &ГруппаУРЗ
	|					И ТорговаяТочка = &ТорговаяТочка) КАК ПорядокОбеспеченияТорговыхТочек
	|		ПО КоличествоВКоробкеСрезПоследних.СтруктурнаяЕдиница = ПорядокОбеспеченияТорговыхТочек.Расчетчик
	|ГДЕ
	|	КоличествоВКоробкеСрезПоследних.Характеристика.БратьКоличествоВКоробкеПоСкладуДляРаспределения
	|	И НЕ КоличествоВКоробкеСрезПоследних.Количество = 0
	|	И НЕ ПорядокОбеспеченияТорговыхТочек.Расчетчик ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТКоличествоВКоробке.Количество, 0) = 0
	|				ТОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СпрХарактеристикиНоменклатуры.Владелец.Весовой
	|						ТОГДА ВТКоличествоВКоробке.Количество
	|					ИНАЧЕ ВЫРАЗИТЬ(ВТКоличествоВКоробке.Количество КАК ЧИСЛО(15, 0))
	|				КОНЕЦ
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(
	|			,
	|			ТорговаяТочка = &ТорговаяТочка
	|				И Номенклатура = &Номенклатура) КАК ТоварныйАссортиментТочек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО (СпрХарактеристикиНоменклатуры.Ссылка = ТоварныйАссортиментТочек.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке))
	|			И (ЗначенияСвойствОбъектов.Объект = ТоварныйАссортиментТочек.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВКоробке КАК ВТКоличествоВКоробке
	|		ПО (ВТКоличествоВКоробке.Характеристика = ТоварныйАссортиментТочек.Характеристика)
	|ГДЕ
	|	СпрХарактеристикиНоменклатуры.Владелец = &Номенклатура";
	                                                            
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КвантУпаковки = Выборка.Количество;
	Иначе
		КвантУпаковки = 0;
	КонецЕсли;
	ЭтаФорма.МинимальноВозможныйМаксОстаток = КвантУпаковки * 1.15;
	
	
	// Вторая макс. продажа
	ADOСоединение = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionTimeOut = 0;
	ADOСоединение.CommandTimeOut    = 0;
	ADOСоединение.ConnectionString  = ОбменСAccess.ПолучитьСтрокуСоединения("SMS_Izbenka");
	ADOСоединение.Open();
	
	ТекстЗапроса = "
	|IF OBJECT_ID ('tempdb..#ls') IS NOT NULL
    |
	|DROP TABLE #ls
	|
	|create table #ls (date_tt date, quantity numeric(15, 3)) 
    |
	|Insert into #ls
	|exec ('SELECT TOP 2 dtt.date_tt,
	|	cast(SUM(dtt.quantity - dtt.discount50_qty) as numeric(10, 1)) as quantity
	|	
	|FROM [vv03].[dbo].[DTT] DTT (nolock) 
    |
	|where
	|	dtt.date_tt >= DATEADD(WEEK, -3, Convert(DATE, GETDATE()))
	//+++АК SHEP 2018.10.25 ИП-00020078
	//|	and id_tov = " + Формат(Номенклатура.id_tov, "ЧГ=;ЧН=") + "
	//|	and id_tt = " + Формат(ПараметрыСеанса.ТорговаяТочкаПоАйпи.id_TT, "ЧГ=;ЧН=") + "
	|	and id_tov = " + Формат(id_tov, "ЧГ=;ЧН=") + "
	|	and id_tt = " + Формат(id_TT, "ЧГ=;ЧН=") + "
	//---АК SHEP 2018.10.25
	|group by
	|	dtt.date_tt
	|order by
	|	quantity desc
	|') at [SRV-SQL03]
	|
	|select top 2
	|	dtt.date_tt,
	|	cast(SUM(dtt.quantity) as numeric(10, 1)) as quantity
	|from #ls as dtt
	|group by
	|	dtt.date_tt
	|order by
	|	quantity desc";
	
	Выборка = ADOСоединение.Execute(ТекстЗапроса);
	
	мКоличество = 0;
	Пока НЕ Выборка = Неопределено Цикл
		Если Выборка.Fields.Count > 0 Тогда
			Пока НЕ Выборка.EOF Цикл
				Если НЕ Выборка.EOF Тогда
					мКоличество = Выборка.Fields("quantity").Value;
					Выборка.MoveNext();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Выборка = Выборка.NextRecordSet();
	КонецЦикла;
	
	ADOСоединение.Close();		
	
	//
	ЭтаФорма.ВтораяМаксПродажа 			= мКоличество;
	ЭтаФорма.РекомендуемыйМаксОстаток 	= мКоличество + ЭтаФорма.МинимальноВозможныйМаксОстаток;
	
	ЗаполнитьПродажиЗаНеделю(); //+++АК SHEP 2018.08.02 ИП-00019381
	
	//+++АК mika 2018.11.14 ИП-00019857 Просмотр для контролеров сторонней розницы
	ЭтоКонтролер = РольДоступнаНаСервере("КонтролерСторонняяРозницаПросмотр"); 
	Элементы.МинОстаток.ТолькоПросмотр = ЭтоКонтролер;
	Элементы.ФормаОк.Доступность = НЕ ЭтоКонтролер;
	//---АК mika 
	 
КонецПроцедуры

//+++АК SHEP 2018.08.02 ИП-00019381
&НаСервере
Процедура ЗаполнитьПродажиЗаНеделю()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сутки = 24*60*60;
	//+++АК SHEP 2018.10.16 ИП-00020078
	//ДатаНачала 		= НачалоДня(ТекущаяДата()) - 7 * Сутки; // берём предыдущие 7 дней
	ДатаНачала 		= НачалоДня(ТекущаяДата()) - 14 * Сутки; // берём предыдущие 14 дней
	//---АК SHEP 2018.10.16
	ДатаОкончания 	= КонецДня(ТекущаяДата()) - 1 * Сутки;
	мРасчетчик 		= Номенклатура;
	мОсновнойСклад	= Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
	МассивТТВкл		= Новый Массив;
	МассивТТВкл.Добавить(ТорговаяТочка);
	МассивТТИскл 	= Новый Массив;
	
	ВыводитьТТМиниТТПусто =
		(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяТочка, "ТипТорговойТочкиДляАссортимента") <> ПредопределенноеЗначение("Перечисление.ТипыТорговыхТочекДляТоварногоАссортимента.ВВ"));
	ВыводитьТолькоВВ = Ложь;
	
	ТаблицаДанных_ПродажиЗаНеделю = Отчеты.ОтчетПоПродажамИПотеряннымПродажам.ПолучитьТаблицуПродаж(ДатаНачала, ДатаОкончания,
														мРасчетчик, мОсновнойСклад, МассивТТВкл, МассивТТИскл,
														ВыводитьТТМиниТТПусто, ВыводитьТолькоВВ);
	
	Для Каждого СтрокаТаб Из ТаблицаДанных_ПродажиЗаНеделю Цикл
		НоваяСтрокаТЧ = ПродажиЗаНеделю.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТаб);
		НоваяСтрокаТЧ.Количество = СтрокаТаб.Количество_пр + СтрокаТаб.Количество_с + СтрокаТаб.Количество_пот;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаНаСервере(Роль)
	Возврат РольДоступна(Роль)
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	
	Если ЗначениеЗаполнено(НормативныйКвант) Тогда
		//Если ЗначениеЗаполнено(МаксОстаток)И МаксОстаток < НормативныйКвант Тогда
		//	Предупреждение("Нельзя установить максимальный остаток меньше, чем нормативный квант");
		//	Возврат
		//КонецЕсли;
		Если МинОстаток > 10*НормативныйКвант Тогда
			ТекстПредупреждения = "«Продажи+Выкладка» превышает квант упаковки более чем в 10 раз.";
			Если РольДоступнаНаСервере("Помощник")Тогда
				Если Вопрос(ТекстПредупреждения+Символы.ПС+"Вы уверены, что хотите сохранить изменения?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда 
					Возврат
				КонецЕсли;
			Иначе 
				Предупреждение(ТекстПредупреждения+Символы.ПС+"У вас недостаточно прав для установки такого значения");
				Возврат
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//+++АК SHEP 2018.11.26 ИП-00020078.03
	Если МинОстаток < МожетПродать Тогда
		//ПоказатьПредупреждение(, "Мин. остаток не может быть меньше значения «Может продать»!");
		//Возврат;
		МинОстаток = МожетПродать;
	КонецЕсли;
	//---АК SHEP 2018.11.26
	
	СтруктураВозврат = Новый Структура("МинОстаток, МаксОстаток", МинОстаток, МаксОстаток);
	Закрыть(СтруктураВозврат);
	
КонецПроцедуры

//+++АК SHEP 2018.10.25 ИП-00020078, ИП-00020078.01
&НаСервере
Функция МожетПродать(id_TT, id_tov)
	
	Сутки = 24*60*60;
	ДатаОкончания = КонецДня(ТекущаяДата() + Сутки); // берём на завтра
	ДатаНачала = НачалоДня(ДатаОкончания);
	//ТаблицаДанных = Отчеты.РасшифровкаРаспределенияТоваровВТорговойТочке.ПолучитьТаблицуДанных(
	//	ВнешниеДанные.ФорматПоля(ДатаНачала, Истина), ВнешниеДанные.ФорматПоля(ДатаОкончания, Истина),
	//	Формат(id_TT, "ЧГ="), Формат(id_tov, "ЧГ="));
	
	ТаблицаДанных = РеквизитФормыВЗначение("Объект").ПолучитьТаблицуМожетПродать(ДатаНачала, ДатаОкончания, id_TT, id_tov);
	
	Возврат ?(ТаблицаДанных.Количество() = 0, 0, ТаблицаДанных[0].МожетПродать);
	
КонецФункции
