
&НаКлиенте
Процедура ЗаблокироватьДвижениеПоСкладуПриИзменении(Элемент)
	Элементы.ДатаБлокировкиДвижений.Видимость = Объект.ЗаблокироватьДвижениеПоСкладу;
	Объект.ДатаБлокировкиДвижений = ?(Объект.ЗаблокироватьДвижениеПоСкладу, Объект.ДатаБлокировкиДвижений, Дата(1, 1, 1));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ЗаблокироватьДвижениеПоСкладу.Доступность = УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.БлокировкаПериодовПоСкладам"), Ложь);
	Элементы.ДатаБлокировкиДвижений.Видимость = Объект.ЗаблокироватьДвижениеПоСкладу;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++AK BATG 2018.12.06 Разрешить устанавливать владельца и организацию только при создании нового элемента
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.Владелец.ТолькоПросмотр = Ложь;
		Элементы.Организация.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Владелец.ТолькоПросмотр = Истина;
		Элементы.Организация.ТолькоПросмотр = Истина;
	КонецЕсли; 
	//---AK BATG
КонецПроцедуры
