
&НаКлиенте
Процедура ВпередВсе(Команда)
	СтрокаТаб=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные;
	Если СтрокаТаб<>Неопределено и КоличествоВперед<>0 Тогда
		СоздатьПаллетыСервер();

		
		Мас=Элементы.ТоварыПриходногоОрдера.ВыделенныеСтроки;
		Для каждого Эл Из Мас Цикл
		    Стр=Объект.ТоварыПриходногоОрдера.НайтиПоИдентификатору(Эл);
			Объект.ТоварыПриходногоОрдера.Удалить(Стр);
		КонецЦикла; 
	КонецЕсли; 
    Элементы.Паллеты.Обновить();
КонецПроцедуры

&НаСервере
Процедура СоздатьПаллетыСервер()
	Мас=Элементы.ТоварыПриходногоОрдера.ВыделенныеСтроки;
	ТЗТовары=Объект.ТоварыПриходногоОрдера.Выгрузить();
	ТЗТовары.Очистить();
	ТЗТовары.Колонки.Добавить("Остаток");
	Для каждого Эл Из Мас Цикл
	    Стр=Объект.ТоварыПриходногоОрдера.НайтиПоИдентификатору(Эл);
		СтрКоличество=Строка(Формат(Стр.Количество, "ЧГ="));
		Поз=Найти(СтрКоличество,",");
		Если Поз=0 Тогда
			Разряд=0;
		Иначе
			Разряд=СтрДлина(СтрКоличество)-Поз;
		КонецЕсли; 
		КолВПаллете=Окр(Стр.Количество/КоличествоВперед,Разряд,РежимОкругления.Окр15как10);
		Остаток=Стр.Количество-КолВПаллете*КоличествоВперед;
		СтрНов=ТЗТовары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов,Стр);
		СтрНов.Количество=КолВПаллете;
		СтрНов.Остаток=Остаток;
	КонецЦикла; 
	Ит=0;
	Для Сч=1 По КоличествоВперед Цикл
	     НовыйОбъект=Справочники.СоставПаллеты.СоздатьЭлемент();
		 НовыйОбъект.РасходныйОрдер=Объект.ПриходныйОрдер;
		 Ит=Ит+1;
		 Для каждого СтрТовары Из ТЗТовары Цикл
		     КолКДобавлению=?(Ит=1,СтрТовары.Остаток,0)+ СтрТовары.Количество;
		 	 Если КолКДобавлению>0 Тогда
				 НовСтрПаллеты=НовыйОбъект.Состав.Добавить();
				 ЗаполнитьЗначенияСвойств(НовСтрПаллеты,СтрТовары);
			     НовСтрПаллеты.Количество=КолКДобавлению;
			 КонецЕсли; 
		 КонецЦикла; 
		 Если НовыйОбъект.Состав.Количество()>0 Тогда
		     НовыйОбъект.Записать();
		 КонецЕсли; 
	КонецЦикла;

КонецПроцедуры
 

&НаКлиенте
Процедура НазадВсе(Команда)
	Если Не ЗначениеЗаполнено(Объект.Паллета) Тогда
	    Сообщить("Выберите паллету");
		Возврат;
	КонецЕсли; 
	Для каждого СтрокаТаб Из Объект.Состав Цикл
		СтрокиВДоке = Объект.ТоварыПриходногоОрдера.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ДатаПроизводства", СтрокаТаб.Номенклатура, СтрокаТаб.Характеристика, СтрокаТаб.ДатаПроизводства));
		Если СтрокиВДоке.Количество() > 0 Тогда
			СтрокаВДоке = СтрокиВДоке[0];
		Иначе
			СтрокаВДоке = Объект.ТоварыПриходногоОрдера.Добавить();
			СтрокаВДоке.Номенклатура = СтрокаТаб.Номенклатура;
			СтрокаВДоке.Характеристика = СтрокаТаб.Характеристика;
			СтрокаВДоке.ДатаПроизводства = СтрокаТаб.ДатаПроизводства;
		КонецЕсли;	
		СтрокаВДоке.Количество = СтрокаВДоке.Количество + СтрокаТаб.Количество;
	КонецЦикла;
	Объект.Состав.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Не ЗначениеЗаполнено(Объект.Паллета) Тогда
	    Сообщить("Выберите паллету");
		Возврат;
	КонецЕсли; 
	СтрокаТаб=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные;
	Если СтрокаТаб<>Неопределено Тогда
		СтрокиВДоке = Объект.Состав.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ДатаПроизводства", СтрокаТаб.Номенклатура, СтрокаТаб.Характеристика, СтрокаТаб.ДатаПроизводства));
		Если СтрокиВДоке.Количество() > 0 Тогда
			СтрокаВДоке = СтрокиВДоке[0];
		Иначе
			СтрокаВДоке = Объект.Состав.Добавить();
			СтрокаВДоке.Номенклатура = СтрокаТаб.Номенклатура;
			СтрокаВДоке.Характеристика = СтрокаТаб.Характеристика;
			СтрокаВДоке.ДатаПроизводства = СтрокаТаб.ДатаПроизводства;
		КонецЕсли;	
		СтрокаВДоке.Количество = СтрокаВДоке.Количество + КоличествоВперед;
		Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество-Мин(Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество,КоличествоВперед);
		КоличествоВперед=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество;
		Если Элементы.Состав.ТекущиеДанные<>Неопределено Тогда
		     КоличествоНазад=Элементы.Состав.ТекущиеДанные.Количество;
		КонецЕсли; 
		Если Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество=0 Тогда
			НомерСтр=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.НомерСтроки;
		    Объект.ТоварыПриходногоОрдера.Удалить(НомерСтр-1);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Не ЗначениеЗаполнено(Объект.Паллета) Тогда
	    Сообщить("Выберите паллету");
		Возврат;
	КонецЕсли; 
	СтрокаТаб=Элементы.Состав.ТекущиеДанные;
	Если СтрокаТаб<>Неопределено Тогда
		СтрокиВДоке = Объект.ТоварыПриходногоОрдера.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ДатаПроизводства", СтрокаТаб.Номенклатура, СтрокаТаб.Характеристика, СтрокаТаб.ДатаПроизводства));
		Если СтрокиВДоке.Количество() > 0 Тогда
			СтрокаВДоке = СтрокиВДоке[0];
		Иначе
			СтрокаВДоке = Объект.ТоварыПриходногоОрдера.Добавить();
			СтрокаВДоке.Номенклатура = СтрокаТаб.Номенклатура;
			СтрокаВДоке.Характеристика = СтрокаТаб.Характеристика;
			СтрокаВДоке.ДатаПроизводства = СтрокаТаб.ДатаПроизводства;
		КонецЕсли;	
		СтрокаВДоке.Количество = СтрокаВДоке.Количество + КоличествоНазад;
		Элементы.Состав.ТекущиеДанные.Количество=Элементы.Состав.ТекущиеДанные.Количество-Мин(Элементы.Состав.ТекущиеДанные.Количество,КоличествоНазад);
		КоличествоНазад=Элементы.Состав.ТекущиеДанные.Количество;
		Если Элементы.ТоварыПриходногоОрдера.ТекущиеДанные<>Неопределено Тогда
		     КоличествоВперед=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество;
		КонецЕсли; 
		Если Элементы.Состав.ТекущиеДанные.Количество=0 Тогда
			НомерСтр=Элементы.Состав.ТекущиеДанные.НомерСтроки;
		    Объект.Состав.Удалить(НомерСтр-1);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриходныйОрдерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПриходныйОрдер) Тогда
		ПриходныйОрдерПриИзмененииСервер();
	КонецЕсли;
	Паллеты.Параметры.УстановитьЗначениеПараметра("Ордер",Объект.ПриходныйОрдер);
КонецПроцедуры

&НаСервере
Процедура ПриходныйОрдерПриИзмененииСервер()
	Объект.ТоварыПриходногоОрдера.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерСкладТовары.Номенклатура,
		|	ПриходныйОрдерСкладТовары.Характеристика,
		|	СУММА(ПриходныйОрдерСкладТовары.Количество) КАК Количество,
		|	ПриходныйОрдерСкладТовары.ДатаПроизводства
		|ИЗ
		|	Документ.ПриходныйОрдерСклад.Товары КАК ПриходныйОрдерСкладТовары
		|ГДЕ
		|	ПриходныйОрдерСкладТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходныйОрдерСкладТовары.Номенклатура,
		|	ПриходныйОрдерСкладТовары.Характеристика,
		|	ПриходныйОрдерСкладТовары.ДатаПроизводства";

	Запрос.УстановитьПараметр("Ссылка", Объект.ПриходныйОрдер);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрНов=Объект.ТоварыПриходногоОрдера.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов,ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры
 

&НаКлиенте
Процедура ПаллетаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Паллета) Тогда
		ПаллетаПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПаллетаПриИзмененииСервер()
	Объект.Состав.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставПаллеты.Номенклатура,
		|	СоставПаллеты.Характеристика,
		|	СУММА(СоставПаллеты.Количество) КАК Количество,
		|	СоставПаллеты.ДатаПроизводства
		|ИЗ
		|	Справочник.СоставПаллеты.Состав КАК СоставПаллеты
		|ГДЕ
		|	СоставПаллеты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СоставПаллеты.Номенклатура,
		|	СоставПаллеты.Характеристика,
		|	СоставПаллеты.ДатаПроизводства";

	Запрос.УстановитьПараметр("Ссылка", Объект.Паллета);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрНов=Объект.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов,ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры
 

&НаКлиенте
Процедура ТоварыПриходногоОрдераПриАктивизацииСтроки(Элемент)
	КоличествоВперед=1;
	Если Элементы.ТоварыПриходногоОрдера.ТекущиеДанные<>Неопределено Тогда
		ТекКоличество=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество;
	//	КоличествоВперед=Элементы.ТоварыПриходногоОрдера.ТекущиеДанные.Количество;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	КоличествоНазад=0;
	Если Элементы.Состав.ТекущиеДанные<>Неопределено Тогда
		КоличествоНазад=Элементы.Состав.ТекущиеДанные.Количество;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПаллету(Команда)
	Если Объект.Состав.Количество()=0 Тогда
	    Сообщить("Нет данных для записи");
		Возврат;
	КонецЕсли; 
	ЗаписатьПаллетуСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПаллетуСервер()
	Об=РеквизитФормыВЗначение("Объект");
	ОбПаллеты=Об.Паллета.ПолучитьОбъект();
	ОбПаллеты.Состав.Очистить();
	ОбПаллеты.Состав.Загрузить(Об.Состав.Выгрузить());
	ОбПаллеты.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ПаллетыПриАктивизацииСтроки(Элемент)
	Объект.Состав.Очистить();
	Если Элементы.Паллеты.ТекущиеДанные<>Неопределено Тогда
		ТекПаллета=Элементы.Паллеты.ТекущиеДанные.Ссылка;
		ПаллетыПриАктивизацииСтрокиСервер();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПаллетыПриАктивизацииСтрокиСервер()
	Объект.Состав.Загрузить(ТекПаллета.Состав.Выгрузить());
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставПаллетыСостав.Номенклатура,
		|	СоставПаллетыСостав.Характеристика,
		|	СоставПаллетыСостав.ДатаПроизводства,
		|	СоставПаллетыСостав.Ссылка.РасходныйОрдер
		|ПОМЕСТИТЬ втЭтаПаллета
		|ИЗ
		|	Справочник.СоставПаллеты.Состав КАК СоставПаллетыСостав
		|ГДЕ
		|	СоставПаллетыСостав.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЭтаПаллета.РасходныйОрдер,
		|	СУММА(СоставПаллетыСостав.Количество) КАК Количество
		|ПОМЕСТИТЬ втПодобныеПаллеты
		|ИЗ
		|	Справочник.СоставПаллеты.Состав КАК СоставПаллетыСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтаПаллета КАК втЭтаПаллета
		|		ПО СоставПаллетыСостав.Ссылка.РасходныйОрдер = втЭтаПаллета.РасходныйОрдер
		|			И СоставПаллетыСостав.Номенклатура = втЭтаПаллета.Номенклатура
		|			И СоставПаллетыСостав.Характеристика = втЭтаПаллета.Характеристика
		|			И СоставПаллетыСостав.ДатаПроизводства = втЭтаПаллета.ДатаПроизводства
		|
		|СГРУППИРОВАТЬ ПО
		|	втЭтаПаллета.РасходныйОрдер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерСкладТовары.Ссылка,
		|	СУММА(ПриходныйОрдерСкладТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ втПО
		|ИЗ
		|	Документ.ПриходныйОрдерСклад.Товары КАК ПриходныйОрдерСкладТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтаПаллета КАК втЭтаПаллета
		|		ПО ПриходныйОрдерСкладТовары.Ссылка = втЭтаПаллета.РасходныйОрдер
		|			И ПриходныйОрдерСкладТовары.Номенклатура = втЭтаПаллета.Номенклатура
		|			И ПриходныйОрдерСкладТовары.Характеристика = втЭтаПаллета.Характеристика
		|			И ПриходныйОрдерСкладТовары.ДатаПроизводства = втЭтаПаллета.ДатаПроизводства
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходныйОрдерСкладТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПО.Количество - ЕСТЬNULL(втПодобныеПаллеты.Количество, 0) КАК Количество
		|ИЗ
		|	втПО КАК втПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПодобныеПаллеты КАК втПодобныеПаллеты
		|		ПО втПО.Ссылка = втПодобныеПаллеты.РасходныйОрдер";

	Запрос.УстановитьПараметр("Ссылка", ТекПаллета);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоВнеПаллет=ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СохранитьПаллету();
КонецПроцедуры

&НаСервере
Процедура СохранитьПаллету()
	ОбПал=ТекПаллета.ПолучитьОбъект();
	ОбПал.Состав.Очистить();
	ОбПал.Состав.Загрузить(Объект.Состав.Выгрузить());
	ОбПал.Записать();
	ПаллетыПриАктивизацииСтрокиСервер();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Паллеты.Параметры.УстановитьЗначениеПараметра("Ордер",Объект.ПриходныйОрдер);
КонецПроцедуры

&НаКлиенте
Процедура СоставПередУдалением(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставПослеУдаления(Элемент)
	СохранитьПаллету();
КонецПроцедуры
