
//&НаСервереБезКонтекста
//Функция ПолучитьМассивДолжностей()
//	
//	Запрос = Новый Запрос();
//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//				   |	ФизическиеЛица.Должность КАК Должность
//				   |ИЗ
//				   |	Справочник.ФизическиеЛица КАК ФизическиеЛица
//				   |
//				   |УПОРЯДОЧИТЬ ПО
//				   |	Должность";
//				   
//	МассивДолжности = Новый Массив();
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		МассивДолжности.Добавить(Выборка.Должность);
//	КонецЦикла;
//	
//	Возврат МассивДолжности;
//	
//КонецФункции

&НаКлиенте
Процедура ДолжностьНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//Элемент.СписокВыбора.Очистить();
	//Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДолжностей());
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель"	, Справочники.ФизическиеЛица.НайтиПоКоду("9990000001"));
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Родитель = &Родитель
	|	И ФизическиеЛица.Наименование = &Наименование";
				   
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Сообщить("Внештатный сотрудник с таким наименованием уже есть в справочнике");
		Возврат Ложь;
	КонецЕсли;	
	
	//
	СпрОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.УстановитьНовыйКод("999");
	СпрОбъект.Родитель 				= Справочники.ФизическиеЛица.НайтиПоКоду("9990000001");
	СпрОбъект.Наименование 			= Наименование;
	СпрОбъект.Должность 			= СокрЛП(Должность);
	СпрОбъект.ДолжностьВнештатника 	= Должность;
	СпрОбъект.ВнештатныйСотрудник 	= Истина;
	СпрОбъект.Записать();
	
	Фио = СтрЗаменить(Наименование, " ", Символы.ПС);
	
	Если СтрЧислоСтрок(Фио) > 0 Тогда
		ФиоФизЛиц = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
		ФиоФизЛиц.Период 		= '20000101';
		ФиоФизЛиц.ФизЛицо 		= СпрОбъект.Ссылка;
		ФиоФизЛиц.Фамилия 		= СтрПолучитьСтроку(Фио, 1);
		Если СтрЧислоСтрок(Фио) > 1 Тогда
			ФиоФизЛиц.Имя 		= СтрПолучитьСтроку(Фио, 2);
		КонецЕсли;
		Если СтрЧислоСтрок(Фио) > 2 Тогда
			ФиоФизЛиц.Отчество 	= СтрПолучитьСтроку(Фио, 3);
		КонецЕсли;
		ФиоФизЛиц.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Должность) Тогда
		Предупреждение("Не указана должность внештатника");
		Возврат;
	КонецЕсли;	
	
	//
	Если ЗаписатьНаСервере() Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры
