
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ЭтоАудитор = РольДоступна("АудиторКартДизайнПроектов");
	
	Если ЭтоАудитор Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "Статус", ПредопределенноеЗначение("Перечисление.СтатусыКарточекТовараПоставщиков.НаПроверкеАудит"));
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "Аудитор", РегистрыСведений.СоответствиеВебПользователейЛабораториям.ПолучитьТекущуюЛабораторию());
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	Элементы.ФормаНастройкаСписка.Видимость = Ложь;
	Элементы.ФормаВывестиСписок.Видимость = Ложь;
	#КонецЕсли
	
КонецПроцедуры
