
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.Проверяющий=ПараметрыСеанса.ТекущийПользователь;
	ЭтотОбъект.Статус=Перечисления.СтатусыАудитаМагазинов.ВРаботе;
	ЗаполнитьАудитАктуальнымиСтатьями();
КонецПроцедуры

Процедура ЗаполнитьАудитАктуальнымиСтатьями() Экспорт
	ТекстЗапроса="ВЫБРАТЬ
	             |	ОпросникДляАудитаМагазинов.Ссылка КАК СтатьяАудита
	             |ИЗ
	             |	Справочник.ОпросникДляАудитаМагазинов КАК ОпросникДляАудитаМагазинов
	             |ГДЕ
	             |	НЕ ОпросникДляАудитаМагазинов.Устарел
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка ИЕРАРХИЯ";
	Запрос=Новый Запрос(ТекстЗапроса);
	ЭтотОбъект.Результаты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (ЭтотОбъект.Статус=Перечисления.СтатусыАудитаМагазинов.ВРаботе ИЛИ  ЭтотОбъект.Статус=Перечисления.СтатусыАудитаМагазинов.Завершен) И НЕ РольДоступна("АудиторМагазина") И НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ=Истина;
		Сообщить("У Вас недостаточно прав для записи документа в этом статусе. Заишите документ в статусе ""Принят"" или ""Отправлен на доработку""");
	ИначеЕсли (ЭтотОбъект.Статус=Перечисления.СтатусыАудитаМагазинов.ОтправленНаДоработку ИЛИ  ЭтотОбъект.Статус=Перечисления.СтатусыАудитаМагазинов.Принят) И НЕ РольДоступна("СупервайзерАудитаМагазина") И НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ=Истина;
		Сообщить("У Вас недостаточно прав для записи документа в этом статусе. Заишите документ в статусе ""В работе"" или ""Завершен""");
	КонецЕсли;
	
	ЭтотОбъект.Результат=0;
	Для каждого стр из ЭтотОбъект.Результаты Цикл
		ЭтотОбъект.Результат=ЭтотОбъект.Результат+Стр.Результат*Стр.СтатьяАудита.Родитель.ВесГруппы/100;
	КонецЦикла;	
КонецПроцедуры
