
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекИмяСтраницы = ПараметрыВыполненияКоманды.Источник.ПодчиненныеЭлементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	ПараметрКоманды = Новый Структура;
	Если (НЕ ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.ВыборкаЗП)) И ТекИмяСтраницы = "ГруппаЗП" Тогда
		Сообщить("Не указана Выборка!");
		Возврат;		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.лкПроект)) Тогда
		Сообщить("Не указан Проект!");
		Возврат;
	КонецЕсли;
	
	//Если ТекИмяСтраницы = "ГруппаРассылки" И (НЕ ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.ВыборкаЗП1)) Тогда
	//	 Сообщить("Не указана Выборка!");
	//	Возврат;
	//КонецЕсли;
	
	Если ТекИмяСтраницы = "ГруппаРассылки" И (НЕ ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.лкТипСвязи)) Тогда
		 Сообщить("Не указан ТипСвязи!");
		Возврат;
	КонецЕсли;
	
	
	Если ТекИмяСтраницы = "ГруппаРассылки" И СокрЛП(ПараметрыВыполненияКоманды.Источник.СообщениеДляРассылки) = "" Тогда
		 Сообщить("Не указано сообщение для рассылки!");
		Возврат;
	КонецЕсли;
	Если Вопрос("Обработка может занять продолжительное время. Хотите продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	ФормаПараметров = ПолучитьФорму("РегистрСведений.ОбращенияКПокупателям.Форма.ФормаВводаПараметровПоАбонементам");
	РезПарам = ФормаПараметров.ОткрытьМодально();
	
	Если РезПарам = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрКоманды.Вставить("ВыборкаЗП", ПараметрыВыполненияКоманды.Источник.ВыборкаЗП);
	ПараметрКоманды.Вставить("Проект", ПараметрыВыполненияКоманды.Источник.лкПроект);
	ПараметрКоманды.Вставить("Вопрос", ПараметрыВыполненияКоманды.Источник.ПолеВопрос);
	ПараметрКоманды.Вставить("ТипСвязи", ПараметрыВыполненияКоманды.Источник.лкТипСвязи);
	ПараметрКоманды.Вставить("МаксКол", ПараметрыВыполненияКоманды.Источник.МаксКол);
	ПараметрКоманды.Вставить("СообщениеДляРассылки", ПараметрыВыполненияКоманды.Источник.СообщениеДляРассылки);	
	ПараметрКоманды.Вставить("ТипОбращения", ТекИмяСтраницы);
	ПараметрКоманды.Вставить("ТекРассылка", ПараметрыВыполненияКоманды.Источник.Рассылка);
	ПараметрКоманды.Вставить("ИспользоватьПриоритеты", ПараметрыВыполненияКоманды.Источник.ИспользоватьПриоритеты);
	ПараметрКоманды.Вставить("КоличествоОбрабатываемыхЧеков", ПараметрыВыполненияКоманды.Источник.КоличествоОбрабатываемыхЧеков);
	ПараметрКоманды.Вставить("ВыборкаЗП", ПараметрыВыполненияКоманды.Источник.ВыборкаЗП);
	ПараметрКоманды.Вставить("РезПарам", РезПарам);
	
	ПостроитьТаблицу(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры


&НаКлиенте
Процедура ПостроитьТаблицу(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Состояние("Идет выборка данных. Ожидайте...");
	ТекПарам = CRM.ПостроитьТаблицуРассылкиПоАбонементам(ПараметрКоманды);
	
	Если ТекПарам <> Неопределено Тогда
		
		ОткрытьФормуМодально("РегистрСведений.ОбращенияКПокупателям.Форма.ФормаОтправкиSMS", ТекПарам);	
		
	КонецЕсли;	
	
КонецПроцедуры
