
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК SHEP 20170804 ИП-00016394
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПоставщик = ПараметрыСеанса.ТекущийКонтрагент;
	ЭтоПоставщик = ЗначениеЗаполнено(ТекущийПоставщик);
	
	Если ЭтоПоставщик Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "Производитель", ТекущийПоставщик);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТипыОбращенийПокупателей.Код,
		|	ТипыОбращенийПокупателей.Ссылка
		|ИЗ
		|	Справочник.ТипыОбращенийПокупателей КАК ТипыОбращенийПокупателей
		|ГДЕ
		|	ТипыОбращенийПокупателей.Код В(&МассивКодовДляОтбора)");
	// разбивка по типам по нашей классификации, тип 1-4,7 и 9
	Запрос.УстановитьПараметр("МассивКодовДляОтбора", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("201,202,203,204,207,209"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивДляОтбора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "ТипОбращения", МассивДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	//---АК SHEP 20170804
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено добавлять записи!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено удалять записи!");
	КонецЕсли;
КонецПроцедуры
