
&НаКлиенте
Процедура СоздатьПоступления(Команда)
	
	ОткрытьФорму("Обработка.АК_СозданиеДокументовПоступленияПоСотрудникамАутсорсинг.Форма.Форма",, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеПоДоступнымКонтрагентам();  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеПоДоступнымКонтрагентам()
	
	ГруппаСотрудников = ДопМодульСервер.ПолучитьТекущуюГруппуСотрудниковАутсорсинг();
	
	ДоступныеКонтрагенты = Справочники.СотрудникиАутсорсинг.ПолучитьКонтрагентовПредоставляющихАутсорсУслуги(ГруппаСотрудников);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение  = ДоступныеКонтрагенты;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Этаформа.ТолькоПросмотр = ЗначениеЗаполнено(ГруппаСотрудников);
	
КонецПроцедуры
