//+++АК LAGP 2018.06.17 ИП-00018465.03 Форма создана. СопоставлениеРТУ из экселя.

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.НачалоТаблицы 			= 2;
	ЭтаФорма.КолонкаНомерНакладной 	= 11;
	ЭтаФорма.КолонкаСуммаНакладной 	= 10;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЭксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	//ДиалогВыбораФайла.Фильтр					= "Документ Microsoft Excel (*.xls)|*.xls";
	//ДиалогВыбораФайла.Расширение				= "xls";
	ДиалогВыбораФайла.Заголовок					= "Выберите файл Excel";
	ДиалогВыбораФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла			= ЭтаФорма.ФайлЭксель;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ЭтаФорма.ФайлЭксель = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЭксельОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("explorer " + ЭтаФорма.ФайлЭксель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНакладные(Команда)
	
	Если ЭтаФорма.ФайлЭксель = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНакладныхЭксель = ЭтаФорма.ВладелецФормы.ТаблицаНакладныхЭксель;
	
	Эксель = Новый COMОбъект("Excel.Application");
	
	Эксель_документ = Эксель.Workbooks.Open(ЭтаФорма.ФайлЭксель);
	ЛистЭксель = Эксель_документ.Sheets(1);
	
	КолонкаНомерНакладной = ЭтаФорма.КолонкаНомерНакладной;
	КолонкаСуммаНакладной = ЭтаФорма.КолонкаСуммаНакладной;	
	
	НомСтроки = ЭтаФорма.НачалоТаблицы;
	СтрокаНомерНакладной = ЛистЭксель.Cells(НомСтроки, КолонкаНомерНакладной).Value;
	СтрокаСуммаНакладной = ЛистЭксель.Cells(НомСтроки, КолонкаСуммаНакладной).Value; 
	
	Пока ЗначениеЗаполнено(СтрокаНомерНакладной) Цикл		
	 	НоваяСтрокаТаблицыНакладныхЭксель = ТаблицаНакладныхЭксель.Добавить();
		Попытка
			ЧислоНомерНакладной = Число(СтрокаНомерНакладной);
			ЧислоСуммаНакладной = Число(СтрокаСуммаНакладной)
		Исключение
			Сообщить("Не удалось привести значение к типу ""число""! Накладная № " + СтрокаНомерНакладной + ", сумма накладной " + СтрокаСуммаНакладной);
		КонецПопытки;	
		
		НоваяСтрокаТаблицыНакладныхЭксель.НомерНакладной = Формат(ЧислоНомерНакладной, "ЧРГ=' '; ЧГ=3,0");
		НоваяСтрокаТаблицыНакладныхЭксель.СуммаНакладной = ЧислоСуммаНакладной;
		
		НоваяСтрокаТаблицыНакладныхЭксель = ТаблицаНакладныхЭксель.Добавить();
		НоваяСтрокаТаблицыНакладныхЭксель.НомерНакладной = Формат(ЧислоНомерНакладной, "ЧГ=0");
		НоваяСтрокаТаблицыНакладныхЭксель.СуммаНакладной = ЧислоСуммаНакладной;
		
		НомСтроки = НомСтроки + 1;
		СтрокаНомерНакладной = ЛистЭксель.Cells(НомСтроки, ЭтаФорма.КолонкаНомерНакладной).Value;		
		СтрокаСуммаНакладной = ЛистЭксель.Cells(НомСтроки, ЭтаФорма.КолонкаСуммаНакладной).Value;
	КонецЦикла;
	
	Сообщить("Завершение. Последняя строка номера накладной - " + НомСтроки);
	
	Эксель.Quit();
		
	ЭтаФорма.Закрыть();
	
КонецПроцедуры