
&НаКлиенте
Процедура КопироватьНастройки(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	КопироватьНастройкиСервер();
КонецПроцедуры

&НаСервере
Процедура КопироватьНастройкиСервер()
	
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.КопироватьНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьФункциональныеРоли(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	КопироватьФункциональныеРолиСервер();
КонецПроцедуры

&НаСервере
Процедура КопироватьФункциональныеРолиСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.КопироватьФункциональныеРоли(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьДополнительныеПрава(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	КопироватьДополнительныеПраваСервер();
КонецПроцедуры

&НаСервере
Процедура КопироватьДополнительныеПраваСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.КопироватьДопНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура КопироватьВсе(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	КопироватьВсеСервер();
КонецПроцедуры


&НаСервере
Процедура КопироватьВсеСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.КопироватьДопНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
		Справочники.Пользователи.КопироватьНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла;
	КопироватьРолиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьНастройки(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	ОбъединитьНастройкиСервер();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьНастройкиСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.ОбъединитьНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьФункциональныеРоли(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	ОбъединитьФункциональныеРолиСервер();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьФункциональныеРолиСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.ОбъединитьФункциональныеРоли(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьДополнительныеПрава(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	ОбъединитьДополнительныеПраваСервер();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьДополнительныеПраваСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.ОбъединитьДопНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбъединитьВсе(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	ОбъединитьВсеСервер();
КонецПроцедуры


&НаСервере
Процедура ОбъединитьВсеСервер()
	Для каждого Стр Из Объект.Пользователи Цикл
		Справочники.Пользователи.ОбъединитьДопНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
		Справочники.Пользователи.ОбъединитьНастройки(Объект.ПользовательИсточник,Стр.ПользовательПолучатель);
	КонецЦикла;
	ОбъединитьРолиСервер();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьРоли(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	КопироватьРолиСервер();
КонецПроцедуры

&НаСервере
Процедура КопироватьРолиСервер()
	ПользовательИБИсх = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.ПользовательИсточник.Наименование);
	Если   (ПользовательИБИсх)=Неопределено Тогда
		Сообщить("Не найден пользователь-источник");
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из Объект.Пользователи Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Стр.ПользовательПолучатель.Наименование);
		Если   (ПользовательИБ)=Неопределено  Тогда
			Сообщить("Не найден пользователь-приемник "+Стр.ПользовательПолучатель.Наименование);
			Возврат;
		КонецЕсли;
		
		ПользовательИБ.Роли.Очистить();
		Для каждого Роль Из ПользовательИБИсх.Роли Цикл
			ПользовательИБ.Роли.Добавить(Роль);
		КонецЦикла; 
		//ПользовательИБ.Роли.Добавить(Метаданные.Роли.Бухгалтер);
		ПользовательИБ.Записать();
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбъединитьРоли(Команда)
	Если Не ЗначениеЗаполнено(Объект.ПользовательИсточник) Тогда
		Сообщить("Выберите пользователя-источника");
		Возврат;
	КонецЕсли; 
	ОбъединитьРолиСервер();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьРолиСервер()
	ПользовательИБИсх = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.ПользовательИсточник.Наименование);
	Для каждого Стр Из Объект.Пользователи Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Стр.ПользовательПолучатель.Наименование);
		//ПользовательИБ.Роли.Очистить();
		Для каждого Роль Из ПользовательИБИсх.Роли Цикл
			Если Не ПользовательИБ.Роли.Содержит(Роль) Тогда
				ПользовательИБ.Роли.Добавить(Роль);
			КонецЕсли; 
		КонецЦикла; 
		//ПользовательИБ.Роли.Добавить(Метаданные.Роли.Бухгалтер);
		ПользовательИБ.Записать();
		
	КонецЦикла;
КонецПроцедуры
