
&НаСервере
Функция ПолучитьТаблицуИзмененийАктивностиФизЛиц()Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Физлицо,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Активный
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизаций.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Пометка,
	|	ВТ.Физлицо,
	|	ВТ.Активный
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Физлицо.Активный <> ВТ.Активный
	|	И ВТ.Физлицо.Активный                 // Только снимаем галки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Физлицо.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции