
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Документ", ПараметрКоманды));
		
		ОткрытьФорму("РегистрСведений.ОчередьДокументовДляОтправки.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



