///////////////////////////////////////////////////////////////////////////////
// Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДокумента.Ссылка КАК Ссылка,
	                      |	ДанныеДокумента.Ссылка.Дата КАК Период,
	                      |	ДанныеДокумента.Ссылка.Организация КАК Организация,
	                      |	ДанныеДокумента.ФизЛицо КАК ФизЛицо,
	                      |	СУММА(ДанныеДокумента.Сумма) КАК Сумма
	                      |ИЗ
	                      |	Документ.УдержаниеПоИсполнительнымЛистам.ФизическиеЛица КАК ДанныеДокумента
	                      |ГДЕ
	                      |	ДанныеДокумента.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеДокумента.ФизЛицо,
	                      |	ДанныеДокумента.Ссылка,
	                      |	ДанныеДокумента.Ссылка.Дата,
	                      |	ДанныеДокумента.Ссылка.Организация");
						  
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
 	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// МассивРезультатов[0] - ВременнаяТаблицаОплатаПоставщикам
	СтруктураДополнительныеСвойства.Вставить("ТаблицаДанных", МассивРезультатов[0].Выгрузить());
	
КонецПроцедуры
