
&НаСервере
// Возвращает путь каталога хранения временных файлов
//
// Возвращаемое значение:
//   <Тип.Строка>   - Путь хранения
//
Функция ПолучитьКаталогВременныхФайлов(Идентификатор = Неопределено) Экспорт
	
	Каталог = Константы.КаталогХраненияФайловКартинок.Получить();
	Если Прав(Каталог,1) <> "\" Тогда
		Каталог = Каталог + "\";
	КонецЕсли;
	
	Возврат Каталог + "WordToHTML_Аттестация\" + ?(ЗначениеЗаполнено(Идентификатор), Строка(Идентификатор),"");
	
КонецФункции // ПолучитьКаталогВременныхФайлов()

//Выполняет автоматическую очистку неиспользуемых файлов
//
Процедура ОчисткаВременныхФайловWordToHTML() Экспорт 
	
	Каталог = Константы.КаталогХраненияФайловКартинок.Получить();
	Если Прав(Каталог,1) <> "\" Тогда
		Каталог = Каталог + "\";
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(Каталог + "WordToHTML_Аттестация\", "*.*");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Сохраняет файл в указанном каталоге временного хранения файлов
//
// Параметры:
//  Хранилище  - <Тип.ХранилищеЗначения> - Ссылка на хранилище файла
//  ПолноеИмяФайла  - <Тип.Строка> - Полный путь и имя сохраняемого файла
//  СсылкаНаОбъект  - <Тип.Ссылка> - Ссылка на объект (для дополнительного вывода уведомлений)              
//
Процедура СохранитьФайлНаДискеИзХранилищаСервер(Хранилище, ПолноеИмяФайла, СсылкаНаОбъект = "") Экспорт

	ТекстУведомления = "";
	
	ДвоичныеДанные = Хранилище.Получить();

	Если ДвоичныеДанные = Неопределено Тогда
		ТекстУведомления = СтрЗаменить("У объекта &Объект нет сохраненных файлов!", "&Объект", СсылкаНаОбъект);
	Иначе
		Попытка
			ДвоичныеДанные.Записать(ПолноеИмяФайла);
		Исключение
			ТекстУведомления = "Ошибка сохранения файла: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекстУведомления) Тогда
		
		Сообщить(ТекстУведомления);
		
		ПолноеИмяФайла = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Процедура удаляет все вложенные файлы и каталог
//
// Параметры:
//  Путь  - <Тип.Строка> - Путь к каталогу удаления файлов
//
Процедура УдалитьФайлыСервер(Путь) Экспорт
	
	Попытка
		УдалитьФайлы(Путь);
	Исключение
	КонецПопытки; 
		
КонецПроцедуры	
	