
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛист.Ссылка КАК Рейс,
		|	МаршрутныйЛист.Сумма КАК Сумма,
		|	МаршрутныйЛист.Дата КАК Дата
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|ГДЕ
		|	МаршрутныйЛист.ПометкаУдаления = ЛОЖЬ
		|	И МаршрутныйЛист.Проведен
		|	И МаршрутныйЛист.ДокументОснование = &ДокументОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Общие";

	Запрос.УстановитьПараметр("ДокументОснование", Параметры.Заявка);

	Результат = Запрос.Выполнить();
    Выб=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Мак=Документы.ЗаявкаНаУслугиМатериалы.ПолучитьМакет("СписокРейсов");
	Пока Выб.Следующий() Цикл
		ВыборкаДетальныеЗаписи = Выб.Выбрать();
		Обл=Мак.ПолучитьОбласть("Шапка");
		ТД.Вывести(Обл);
		Обл=Мак.ПолучитьОбласть("Строка");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Обл.Параметры,ВыборкаДетальныеЗаписи);
			ТД.Вывести(Обл);
		КонецЦикла;
		Обл.Параметры.Рейс="Итого:";
		Обл.Параметры.Сумма=Выб.Сумма;
		ТД.Вывести(Обл);
	КонецЦикла; 
    Заголовок=Строка(Параметры.Заявка);

КонецПроцедуры
