
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Расходники=Параметры.Расходники;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(РасходныйОрдерСкладТовары.ЗаданиеНаРазборку.Подготовлен) КАК ЗаданиеНаРазборкуПодготовлен,
		|	РасходныйОрдерСкладТовары.Ссылка КАК Расходник,
		|	РасходныйОрдерСкладТовары.Ссылка.Склад КАК Склад,
		|	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК Получатель
		|ИЗ
		|	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
		|ГДЕ
		|	РасходныйОрдерСкладТовары.Ссылка В(&Ссылка)
		|	И РасходныйОрдерСкладТовары.ЗаданиеНаРазборку <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаРазборку.ПустаяСсылка)
		|	И РасходныйОрдерСкладТовары.ЗаданиеНаРазборку.Проведен
		|	И РасходныйОрдерСкладТовары.Ссылка.СборкаТерминаломЗакончена = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерСкладТовары.Ссылка,
		|	РасходныйОрдерСкладТовары.Ссылка.Склад,
		|	РасходныйОрдерСкладТовары.Ссылка.Получатель
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(РасходныйОрдерСкладТовары.ЗаданиеНаРазборку.Подготовлен) = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Получатель,
		|	Расходник";
	
	Запрос.УстановитьПараметр("Ссылка", Расходники);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Отказ=Истина;
		Возврат;
	
	КонецЕсли; 
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(),ВыборкаДетальныеЗаписи);	
	КонецЦикла;
КонецПроцедуры
