
&НаКлиенте
Процедура Просмотр(Команда)
	П = Новый Структура("НомерЧека,НомерКассы,Тип");
	ЗаполнитьЗначенияСвойств(П,Элементы.Список.ТекущиеДанные);
	П.Вставить("IdЗаписи",Элементы.Список.ТекущиеДанные.ID);
	П.Тип = 10;
	ОткрытьФорму("Обработка.ПросмотрВидеоСКамер.Форма.Форма",П,ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВидеоПросмотрено(НомерКассы,НомерЧека,ИД)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидеоПоЗапросуСрезПоследних.НомерЧека,
	|	ВидеоПоЗапросуСрезПоследних.НомерКассы,
	|	ВидеоПоЗапросуСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ВидеоПоЗапросу.СрезПоследних(
	|			,
	|			НомерКассы = &НомерКассы
	|				И НомерЧека = &НомерЧека
	|				И ID = &ИдЗаписи) КАК ВидеоПоЗапросуСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("НомерКассы",НомерКассы);
	Запрос.УстановитьПараметр("НомерЧека",НомерЧека);
	Запрос.УстановитьПараметр("ИдЗаписи",ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.ВидеоПоЗапросу.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Прочитать();
		Запись.Просмотрено=Истина;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		Если ИсточникВыбора.ИмяФормы = "Обработка.ПросмотрВидеоСКамер.Форма.Форма" Тогда
			Если ВыбранноеЗначение = Истина Тогда
				ВидеоПросмотрено(ИсточникВыбора.НомерКассы,ИсточникВыбора.НомерЧека,ИсточникВыбора.IdЗаписи);
				Элементы.Список.Обновить();
			КонецЕсли
		КонецЕсли
	КонецЕсли;
КонецПроцедуры
