
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектПрав = ПараметрыСеанса.ТекущийПользователь;//глЗначениеПеременной("ПрофильПолномочийПользователя");
	ЗначениеПрава = Ложь;
	Если ЗначениеЗаполнено(ОбъектПрав) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектПрав"			, ОбъектПрав);
		Запрос.УстановитьПараметр("ПравоПользователя"	, ПланыВидовХарактеристик.ПраваПользователей.НайтиПоНаименованию("Все склады"));
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрЗначениеПрав.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК РегистрЗначениеПрав
		|ГДЕ
		|	РегистрЗначениеПрав.Право = &ПравоПользователя
		|	И РегистрЗначениеПрав.Пользователь = &ОбъектПрав";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗначениеПрава = Выборка.Значение;
		Иначе
			ЗначениеПрава = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("ОсновноеСтруктурноеПодразделение");
	Струк = УправлениеПользователями.ПолучитьСтруктуруЗначенийПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), МассивНастроек);
	Если Струк.Свойство("ОсновноеСтруктурноеПодразделение") и ЗначениеЗаполнено(Струк.ОсновноеСтруктурноеПодразделение) и ЗначениеПрава=Ложь 
		и (РольДоступна("ОператорСклада") или РольДоступна("Кладовщик") или РольДоступна("Ветеринар")) и Не РольДоступна("ПолныеПрава") 
		Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСклады", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОсновноеПодразделение", Струк.ОсновноеСтруктурноеПодразделение);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСклады", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ОсновноеПодразделение", Неопределено);
	КонецЕсли;	
		
	//АК_БЕЛН_20.04.2016--
КонецПроцедуры

//+++АК LATV 2018.10.01 ИП-00019854
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", ОтборСклад,,, ЗначениеЗаполнено(ОтборСклад));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

//+++АК LATV 2018.10.01 ИП-00019854
&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", ОтборСклад,,, ЗначениеЗаполнено(ОтборСклад));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

//+++АК LATV 2018.10.10 ИП-00019986
&НаКлиенте
Процедура ОткрытьОтчетПоЗаданиямНаРазборку(Команда)

	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Отчет.ОтчетПоЗаданиямНаРазборку.Форма", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

#КонецОбласти
