
// Процедура - заполняет таблицу из списка значений в параметрах и выводит для них процент похожести
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Строка из Параметры.СписокЗначений Цикл
		НоваяСтрокаСписка = СписокПохожих.Добавить();
		НоваяСтрокаСписка.Название = Строка.Значение;
		НоваяСтрокаСписка.Коэффициент = Лев(Строка.Представление,Найти(Строка.Представление,"% |"));
	КонецЦикла;
КонецПроцедуры

// Закрывает форму и возвращает выбранное значение
//
&НаКлиенте
Процедура СписокПохожихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбранноеЗначение = Элементы.СписокПохожих.ТекущиеДанные.Название;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		Закрыть(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

// Открывает значение из ТЧ
//
&НаКлиенте
Процедура ОткрытьЗначениеТЧ(Команда)
	ВыбранноеЗначение = Элементы.СписокПохожих.ТекущиеДанные.Название;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		ОткрытьЗначение(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры
