
&НаСервере
Процедура ПересчитатьСтроку(ТекИдентификатор)
	
	ТекДанные = Объект.Товары.НайтиПоИдентификатору(ТекИдентификатор);
	ТекДанные.Масса = ТекДанные.Количество * ТекДанные.Номенклатура.ЕдиницаХраненияОстатков.Вес;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

