&НаКлиенте
Процедура УстановитьПарольОрганизация(Команда)
	
	УстановитьПароль("Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПарольПользователь(Команда)
	
	УстановитьПароль("Пользователи");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПароль(ИмяТабличнойЧасти)
	
	Если Элементы[ИмяТабличнойЧасти].ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ВвестиСтроку(Элементы[ИмяТабличнойЧасти].ТекущиеДанные.СтрокаПароля, "Введите пароль") Тогда
		Если  ПустаяСтрока(Элементы[ИмяТабличнойЧасти].ТекущиеДанные.СтрокаПароля) Тогда
			Предупреждение("Пароль не может быть пустым!");
		Иначе
			Модифицированность = Истина;			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Строка Из Объект.Пользователи Цикл 
		Если НЕ ПустаяСтрока(Строка.СтрокаПароля) Тогда
			СтрокаОбъекта = ТекущийОбъект.Пользователи[Объект.Пользователи.Индекс(Строка)];
			СтрокаОбъекта.Пароль = Новый ХранилищеЗначения(Строка.СтрокаПароля);				
		КонецЕсли; 
	КонецЦикла;  
	
	Для Каждого Строка Из Объект.Организации Цикл 
		Если НЕ ПустаяСтрока(Строка.СтрокаПароля) Тогда
			СтрокаОбъекта = ТекущийОбъект.Организации[Объект.Организации.Индекс(Строка)];
			СтрокаОбъекта.Пароль = Новый ХранилищеЗначения(Строка.СтрокаПароля);				
		КонецЕсли; 
	КонецЦикла;  
	
КонецПроцедуры

//+++АК sole 2018.09.05 ИП-00018241
&НаКлиенте
Процедура ПользователиСертификатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;	
	
	ФормаЗагрузкиСетрификата = ПолучитьФорму("Справочник.ЭДО_КаналыОбмена.Форма.ФормаЗагрузкиСетрификата");
	
	ФормаЗагрузкиСетрификата.ФормаРодитель = ЭтаФорма; 
	ФормаЗагрузкиСетрификата.ИдентификаторСтроки = Объект.Пользователи.Индекс(ТекущиеДанные);
	
	ФормаЗагрузкиСетрификата.Открыть();
КонецПроцедуры

//+++АК sole 2018.09.05 ИП-00018241
&НаКлиенте
Процедура ЗаполнитьСертификатВСтроке(ИдентификаторСтроки, Сертификат) Экспорт
	
	Стр = Объект.Пользователи[ИдентификаторСтроки];
	Стр["Сертификат"] = Сертификат;
	
КонецПроцедуры 

