//+++АК LAGP 2018.03.07 ИП-00017097.03 Создание.

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = ПроверитьДопПрава();
	//CISA
	Если ВидОперации = Перечисления.ВидыОперацийДокументаЗаданиеЛаборатории.Загружено Тогда
		Движения.ОснованияЗаданийЛаборатории.Записывать = Истина;
		Движения.ОснованияЗаданийЛаборатории.Очистить();
		Движение = Движения.ОснованияЗаданийЛаборатории.Добавить();
		Движение.email_uid = email_uid;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Отказ = ПроверитьДопПрава();		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Отказ = ПроверитьДопПрава();
	
КонецПроцедуры

Функция ПроверитьДопПрава()
	
	Попытка 
		МассивПраваЛаборатория=УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.Лаборатория,Ложь,ПараметрыСеанса.ТекущийПользователь);	
		ПравоЛаборатория = МассивПраваЛаборатория[0];
	Исключение
		ПравоЛаборатория = РольДоступна("ПолныеПрава");
	КонецПопытки;	
	
	Если НЕ ПравоЛаборатория Тогда
		Сообщить("Для работы с документами ""Задание лаборатории"" необходимо доп. право ""Лаборатория""");
		Возврат Истина;	
	КонецЕсли;	
	
	Возврат Ложь;	
	
КонецФункции	

//+++АК CISA 2018.11.08 ИП-00020059
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийДокументаЗаданиеЛаборатории.Основная Тогда
		ПроверяемыеРеквизиты.Добавить("Номенклатура");
		ПроверяемыеРеквизиты.Добавить("Характеристика");
		ПроверяемыеРеквизиты.Добавить("Поставщик");
	КонецЕсли;
	  
КонецПроцедуры

//+++АК CISA 2018.11.08 ИП-00020059
Процедура ПриКопировании(ОбъектКопирования)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

