
&НаКлиенте
Процедура ПарольОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элемент.РежимПароля = НЕ Элемент.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	//Закрыть(Ложь);
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
Перем ЗаголовокПриложения;
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
	    Сообщить("Введите ИНН");
		Возврат;
	КонецЕсли;
	
	ЗаголовокПриложения = "";
	Если ПарольВведёнПравильно(ЗаголовокПриложения) Тогда
		
		Если НЕ Пустаястрока(ЗаголовокПриложения) Тогда
			УстановитьЗаголовокПриложения(ЗаголовокПриложения);
		КонецЕсли;

		Закрыть(Истина);
	Иначе
		Сообщить("Неправильный пароль!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПарольВведёнПравильно(ЗаголовокПриложения = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АК_ПаролиКонтрагентов.Контрагент
		|ИЗ
		|	РегистрСведений.АК_ПаролиКонтрагентов КАК АК_ПаролиКонтрагентов
		|ГДЕ
		|	АК_ПаролиКонтрагентов.Контрагент.ИНН = &ИНН
		|	И АК_ПаролиКонтрагентов.Пароль = &Пароль");
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("Пароль", Пароль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда Возврат Ложь; КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	ПараметрыСеанса.ТекущийКонтрагент = ВыборкаЗапроса.Контрагент;
	ПараметрыСеанса.НеСохранятьВерсииОбъектов = Истина;
	
	ЗаголовокПриложения = Константы.ЗаголовокСистемы.Получить() + " / " + СокрЛП(ПараметрыСеанса.ТекущийКонтрагент) + " / " + ИНН;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Истина;
	
КонецФункции
