Процедура СоздатьЗадачуНеЗаписанДокумент(Заявка,СуммаДокумента,Ответственный)Экспорт
	обЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	обЗадача.ВидЗадачи = Справочники.ВидыЗадачПользователей.НеЗаписанПлатеж;
	обЗадача.Дата = ТекущаяДата();
	//обЗадача.ОбъектЗадачи = ЗаявкаНаРасходованиеСредств;
	обЗадача.Ответственный = Ответственный;	
	обЗадача.Исполнитель = Ответственный;	
	//обЗадача.Организация = пДокумент.Организация;
	обЗадача.Оповещение = Истина;
	обЗадача.СрокИсполнения = КонецДня(ТекущаяДата());
	обЗадача.СрокОповещения = ТекущаяДата()+10;
	//обЗадача.Контрагент = ЭтотОбъект.Контрагент;
	ТекстОшибки = "Не записан платеж на основании "+Строка(Заявка)+" на сумму "+Строка(СуммаДокумента);
	обЗадача.Наименование = ТекстОшибки;
	обЗадача.Записать();
	//Задача = обЗадача.Ссылка;
	//Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
