
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Структура") И НЕ Расшифровка.Свойство("ТипАнкет") Тогда 	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ",  ПолучитьКлючЗаписиНаСервере(Расшифровка)); 
		ОткрытьФорму("РегистрСведений.ОбращенияПокупателей.ФормаЗаписи", ПараметрыФормы);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Структура") И Расшифровка.Свойство("ТипАнкет") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ",  ПолучитьКлючЗаписиНаСервере2(Расшифровка)); 
		ОткрытьФорму("РегистрСведений.ПроцентыТайногоПокупателя.Форма.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиНаСервере(СтруктураКлюча)
	
	РегМенеджер = РегистрыСведений.ОбращенияПокупателей;
	
	Возврат РегМенеджер.СоздатьКлючЗаписи(СтруктураКлюча); 
	
КонецФункции

&НаСервере
Функция ПолучитьКлючЗаписиНаСервере2(СтруктураКлюча)
	
	РегМенеджер = РегистрыСведений.ПроцентыТайногоПокупателя;
	
	Возврат РегМенеджер.СоздатьКлючЗаписи(СтруктураКлюча); 
	
КонецФункции
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Параметры.ТабДок);
	
КонецПроцедуры
