Процедура КопироватьНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Записать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = НаборНастроек.Добавить();
		Запись.Пользователь = Приемник;
		Запись.Настройка = ВыборкаДетальныеЗаписи.Настройка;
		Если ВыборкаДетальныеЗаписи.Настройка=ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный Тогда
			Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(Приемник);
		Иначе	
			Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
		КонецЕсли; 
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры

Процедура ОбъединитьНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			Фл=Ложь;
			Для каждого Зап Из НаборНастроек Цикл
				Если Зап.Настройка = ВыборкаДетальныеЗаписи.Настройка Тогда
					Зап.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
					Фл=истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			Если Не Фл Тогда
				Запись = НаборНастроек.Добавить();
				Запись.Пользователь = Приемник;
				Запись.Настройка = ВыборкаДетальныеЗаписи.Настройка;
				Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры


Процедура КопироватьФункциональныеРоли(Источник,Приемник) Экспорт
 
	ТЗ = "ВЫБРАТЬ
	     |	РолиПользователейТипыРолей.Ссылка как ТипРоли
	     |ИЗ
	     |	Справочник.РолиПользователей КАК РолиПользователейТипыРолей";
		 
	//
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.Текст = ТЗ;
	
	
	//
	Выборка = ПЗ.Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		МасСтр=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Источник.ФизЛицо));
		МасСтрПриемник=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Приемник.ФизЛицо));
		Если Не МасСтр.Количество()=0 и МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			НовСтр=ОбРоль.СоставРоли.Добавить();
			НовСтр.Сотрудник=Приемник.ФизЛицо;
			ОбРоль.Записать();
		КонецЕсли;                       
		Если МасСтр.Количество()=0 и Не МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			ОбРоль.СоставРоли.Удалить(МасСтрПриемник[0].НомерСтроки-1);
			ОбРоль.Записать();
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Процедура ОбъединитьФункциональныеРоли(Источник,Приемник) Экспорт
 
	ТЗ = "ВЫБРАТЬ
	     |	РолиПользователейТипыРолей.Ссылка как ТипРоли
	     |ИЗ
	     |	Справочник.РолиПользователей КАК РолиПользователейТипыРолей";
		 
	//
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.Текст = ТЗ;
	
	
	//
	Выборка = ПЗ.Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		МасСтр=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Источник.ФизЛицо));
		МасСтрПриемник=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Приемник.ФизЛицо));
		Если Не МасСтр.Количество()=0 и МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			НовСтр=ОбРоль.СоставРоли.Добавить();
			НовСтр.Сотрудник=Приемник.ФизЛицо;
			ОбРоль.Записать();
		КонецЕсли;                       
		//Если МасСтр.Количество()=0 и Не МасСтрПриемник.Количество()=0 Тогда                             
		//	ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
		//	ОбРоль.СоставРоли.Удалить(МасСтрПриемник[0].НомерСтроки-1);
		//	ОбРоль.Записать();
		//КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Процедура КопироватьДопНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Право,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Записать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = НаборНастроек.Добавить();
		Запись.Пользователь = Приемник;
		Запись.Право = ВыборкаДетальныеЗаписи.Право;
		Запись.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры

Процедура ОбъединитьДопНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Право,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			Фл=Ложь;
			Для каждого Зап Из НаборНастроек Цикл
				Если Зап.Право = ВыборкаДетальныеЗаписи.Право Тогда
					Зап.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
					Фл=истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			Если Не Фл Тогда
				Запись = НаборНастроек.Добавить();
				Запись.Пользователь = Приемник;
				Запись.Право = ВыборкаДетальныеЗаписи.Право;
				Запись.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;


	
	НаборНастроек.Записать();
	

КонецПроцедуры
