//+++АК ILIK 2018.10.04 ИП-00019810
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	Если Параметры.Свойство("Сотрудник") Тогда
		Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	Если Параметры.Свойство("СтандартныйПериод") Тогда
		СтандартныйПериод = Параметры.СтандартныйПериод;
	КонецЕсли;
	УстановитьОтборы();
КонецПроцедуры

//+++АК ILIK 2018.10.04 ИП-00019810
&НаКлиенте
Процедура СтандартныйПериодПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры	

//+++АК ILIK 2018.10.04 ИП-00019810
&НаСервере
Процедура УстановитьОтборы()
	Список.Параметры.УстановитьЗначениеПараметра("Сотрудник", Сотрудник);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", СтандартныйПериод.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", СтандартныйПериод.ДатаОкончания);
КонецПроцедуры
