
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	

	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключитьс к базе финансов");
		Возврат;
	КонецПопытки;
	
	Запрос=v82.NewObject("Запрос");  
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="ПериодОтчета" Тогда
			Запрос.УстановитьПараметр("ДатаС",Параметр.Значение.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаПо",Параметр.Значение.ДатаОкончания);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	УсловиеПоНоменклатуре="";
	РазделУчета="";
	Для каждого Параметр из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если СокрЛП(Параметр.ЛевоеЗначение)="ИД_ТМЦ" Тогда
			Если Параметр.Использование=Истина Тогда
				УсловиеПоНоменклатуре=УсловиеПоНоменклатуре+?(СокрЛП(УсловиеПоНоменклатуре)="",""," И ")+"ВЫБОР
	 			  |		КОГДА Субконто2 ссылка справочник.Номенклатура
	 			  |			ТОГДА Субконто2.ИД
	 			  |		ИНАЧЕ Субконто1.ИД
	 			  |	КОНЕЦ = """+Параметр.ПравоеЗначение+"""";
			КонецЕсли;	
			
		ИначеЕсли СокрЛП(Параметр.ЛевоеЗначение)="Наименование_ТМЦ" Тогда
			Если Параметр.Использование=Истина Тогда
				УсловиеПоНоменклатуре=УсловиеПоНоменклатуре+?(СокрЛП(УсловиеПоНоменклатуре)="",""," И ")+"ВЫБОР
	 			  |		КОГДА Субконто2 ссылка справочник.Номенклатура
	 			  |			ТОГДА Субконто2.Наименование
	 			  |		ИНАЧЕ Субконто1.Наименование
	 			  |	КОНЕЦ = """+Параметр.ПравоеЗначение+"""";
			  КонецЕсли;	
		ИначеЕсли СокрЛП(Параметр.ЛевоеЗначение)="РазделУчета" Тогда
			Если Параметр.Использование=Истина Тогда
				РазделУчета=Параметр.ПравоеЗначение;
			 КонецЕсли;		  
			  
		КонецЕсли;
	КонецЦикла;	
	
	
	 //|	ВЫБОР
	 //			  |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07""
	 //			  |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2.ИД
	 //			  |		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ИД
	 //			  |	КОНЕЦ КАК ИД_ТМЦ,
	 //			  |	ВЫБОР
	 //			  |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07""
	 //			  |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2.Наименование
	 //			  |		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Субконто1.Наименование
	 //			  |	КОНЕЦ КАК Наименование_ТМЦ,

	
	//ТекстЗапроса="ВЫБРАТЬ
	//		 |	ХозрасчетныйОстаткиИОбороты.ПериодМесяц КАК ПериодМесяц,
	//		 |	ХозрасчетныйОстаткиИОбороты.ПериодДень КАК ПериодДень,
	//		 |	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
	//		 |	Выбор Когда Счет.Код=""10.07"" Тогда ""Материалы в переработке"" Когда Счет.Код=""10.01"" Тогда ""Материалы"" Иначе ""Товары"" Конец КАК РазделУчета,
	//		 |	ТипЗначения(ХозрасчетныйОстаткиИОбороты.Регистратор) КАК ТипДокумента,
	//		 |	ХозрасчетныйОстаткиИОбороты.Счет.Код КАК Счет,
	//		 |	Выбор Когда Счет.Код=""10.07"" Тогда ХозрасчетныйОстаткиИОбороты.Субконто2 Иначе ХозрасчетныйОстаткиИОбороты.Субконто1 Конец КАК ТМЦ,
	//		 |	Выбор Когда Счет.Код=""10.07"" Тогда ХозрасчетныйОстаткиИОбороты.Субконто2.ИД Иначе  ХозрасчетныйОстаткиИОбороты.Субконто1.ИД Конец КАК ИД_ТМЦ,
	//		 |	Выбор Когда Счет.Код=""10.07"" Тогда ХозрасчетныйОстаткиИОбороты.Субконто2.Наименование Иначе ХозрасчетныйОстаткиИОбороты.Субконто1.Наименование Конец КАК Наименование_ТМЦ,
	//		 |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК БухСуммаНачало,
	//		 |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК БухСуммаКонец,
	//		 |	ХозрасчетныйОстаткиИОбороты.КоличествоНачальныйОстаток КАК БухКоличествоНачало,
	//		 |	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток КАК БухКоличествоКонец
	//		 |ИЗ
	//		 |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаС,&ДатаПо , Авто,Движения ,Счет В (&Счета) , , ) КАК ХозрасчетныйОстаткиИОбороты";

	ТекстЗапроса="ВЫБРАТЬ
  	             |	ХозрасчетныйОстаткиИОбороты.ПериодДень КАК ПериодДень,
  	             |	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07"" ТОГДА  ""Материалы в переработке""
				 
  	             |			Когда ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.01""
  	             |			ТОГДА ""Материалы""
  	             |		ИНАЧЕ ""Товары""
  	             |	КОНЕЦ КАК РазделУчета,
  	              |	ВЫБОР
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	             |			ТОГДА ""Авансовый отчет""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	             |			ТОГДА ""Возврат от покупателя""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	             |			ТОГДА ""Возврат поставщику""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОперацияБух
	             |			ТОГДА ""Операция""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	             |			ТОГДА ""Оприходование товаров""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПередачаТоваров
	             |			ТОГДА ""Передача товаров""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	             |			ТОГДА ""Отчет о розничных продажах""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеИзПереработки
	             |			ТОГДА ""Поступление из переработки""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеДопРасходов
	             |			ТОГДА ""Поступление доп.расходов""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	             |			ТОГДА ""Поступление""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	             |			ТОГДА ""Реализация""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
	             |			ТОГДА ""Списание товаров""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ТребованиеНакладная
	             |			ТОГДА ""Требование-накладная""
	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	             |			ТОГДА ""Корректировка поступления""
	             |		ИНАЧЕ ""Прочее""
	             |	КОНЕЦ КАК ТипДокумента,

  	             |	ХозрасчетныйОстаткиИОбороты.Счет.Код КАК Счет,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2
  	             |		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Субконто1
  	             |	КОНЕЦ КАК ТМЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2.ИД
  	             |		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ИД
  	             |	КОНЕЦ КАК ИД_ТМЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто2.Наименование
  	             |		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Субконто1.Наименование
  	             |	КОНЕЦ КАК Наименование_ТМЦ,
  	             |	NULL КАК БухСуммаНачало,
  	             |	NULL КАК БухСуммаКонец,
  	             |	NULL КАК БухКоличествоНачало,
  	             |	NULL КАК БухКоличествоКонец,
  	             |	ХозрасчетныйОстаткиИОбороты.СуммаОборот КАК БухСуммаОборот,
  	             |	ХозрасчетныйОстаткиИОбороты.КоличествоОборот КАК БухКоличествоОборот
  	             |ПОМЕСТИТЬ Выборка
  	             |ИЗ
  	             |	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаС, &ДатаПо, Авто, Счет В (&Счета), ,"+УсловиеПоНоменклатуре+" , , ) КАК ХозрасчетныйОстаткиИОбороты
  	             |
  	             |ОБЪЕДИНИТЬ ВСЕ
  	             |
  	             |ВЫБРАТЬ
  	             |	NULL,
  	             |	NULL,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07"" ТОГДА ""Материалы в переработке""
  	             |			Когда ХозрасчетныйОстатки.Счет.Код = ""10.01""
  	             |			ТОГДА ""Материалы""
  	             |		ИНАЧЕ ""Товары""
  	             |	КОНЕЦ,
  	             |	NULL,
  	             |	ХозрасчетныйОстатки.Счет.Код,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1
  	             |	КОНЕЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2.ИД
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1.ИД
  	             |	КОНЕЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2.Наименование
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1.Наименование
  	             |	КОНЕЦ,
  	             |	ХозрасчетныйОстатки.СуммаОстаток,
  	             |	NULL,
  	             |	ХозрасчетныйОстатки.КоличествоОстаток,
  	             |	NULL,
  	             |	NULL,
  	             |	NULL
  	             |ИЗ
  	             |	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаС, Счет В (&Счета), ,"+УсловиеПоНоменклатуре+" ) КАК ХозрасчетныйОстатки
  	             |
  	             |ОБЪЕДИНИТЬ ВСЕ
  	             |
  	             |ВЫБРАТЬ
  	             |	NULL,
  	             |	NULL,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07"" ТОГДА ""Материалы в переработке""
  	             |			Когда ХозрасчетныйОстатки.Счет.Код = ""10.01""
  	             |			ТОГДА ""Материалы""
  	             |		ИНАЧЕ ""Товары""
  	             |	КОНЕЦ,
  	             |	NULL,
  	             |	ХозрасчетныйОстатки.Счет.Код,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1
  	             |	КОНЕЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2.ИД
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1.ИД
  	             |	КОНЕЦ,
  	             |	ВЫБОР
  	             |		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.07""
  	             |			ТОГДА ХозрасчетныйОстатки.Субконто2.Наименование
  	             |		ИНАЧЕ ХозрасчетныйОстатки.Субконто1.Наименование
  	             |	КОНЕЦ,
  	             |	NULL,
  	             |	ХозрасчетныйОстатки.СуммаОстаток,
  	             |	NULL,
  	             |	ХозрасчетныйОстатки.КоличествоОстаток,
  	             |	NULL,
  	             |	NULL
  	             |ИЗ
  	             |	РегистрБухгалтерии.Хозрасчетный.Остатки(ДобавитьКДате(&ДатаПо, Секунда,1), Счет В (&Счета), ,"+УсловиеПоНоменклатуре+" ) КАК ХозрасчетныйОстатки
  	             |;
  	             |
  	             |////////////////////////////////////////////////////////////////////////////////
  	             |ВЫБРАТЬ
  	             |	Выборка.ПериодДень,
  	             |	Представление(Выборка.Регистратор) КАК Регистратор,
  	             |	Выборка.РазделУчета,
  	             |	Выборка.ТипДокумента,
  	             |	Выборка.Счет,
  	             |	Выборка.ТМЦ,
  	             |	Выборка.ИД_ТМЦ,
  	             |	Выборка.Наименование_ТМЦ,
  	             |	СУММА(Выборка.БухСуммаНачало) КАК БухСуммаНачало,
  	             |	СУММА(Выборка.БухСуммаКонец) КАК БухСуммаКонец,
  	             |	СУММА(Выборка.БухКоличествоНачало) КАК БухКоличествоНачало,
  	             |	СУММА(Выборка.БухКоличествоКонец) КАК БухКоличествоКонец,
  	             |	СУММА(Выборка.БухСуммаОборот) КАК БухСуммаОборот,
  	             |	СУММА(Выборка.БухКоличествоОборот) КАК БухКоличествоОборот
  	             |ИЗ
  	             |	Выборка КАК Выборка      
  	             |
  	             |СГРУППИРОВАТЬ ПО
  	             |	Выборка.ПериодДень,
  	             |	Представление(Выборка.Регистратор),
  	             |	Выборка.РазделУчета,
  	             |	Выборка.ТипДокумента,
  	             |	Выборка.Счет,
  	             |	Выборка.ТМЦ,
  	             |	Выборка.Наименование_ТМЦ,
  	             |	Выборка.ИД_ТМЦ";

	
	Запрос.Текст=ТекстЗапроса;
		
    МассивСчетов=v82.NewObject("Массив");
	Если РазделУчета="Товары" Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
	ИначеЕсли РазделУчета="Материалы в переработке" Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку);
	ИначеЕсли РазделУчета="Материалы" Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
	Иначе
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку);
	КонецЕсли;	
	
	
	Запрос.УстановитьПараметр("Счета",МассивСчетов);
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	ДанныеБух=Новый ТаблицаЗначений;
	ДанныеБух.Колонки.Добавить("ПериодДень");
	//ДанныеБух.Колонки.Добавить("ПериодМесяц");
	ДанныеБух.Колонки.Добавить("Счет");
	ДанныеБух.Колонки.Добавить("ИД_ТМЦ");
	ДанныеБух.Колонки.Добавить("Наименование_ТМЦ");
	ДанныеБух.Колонки.Добавить("БухСуммаНачало");
	ДанныеБух.Колонки.Добавить("БухСуммаКонец");
	ДанныеБух.Колонки.Добавить("БухКоличествоНачало");
	ДанныеБух.Колонки.Добавить("БухКоличествоКонец");
	ДанныеБух.Колонки.Добавить("Регистратор");
	ДанныеБух.Колонки.Добавить("ТипДокумента");
	ДанныеБух.Колонки.Добавить("РазделУчета");
	ДанныеБух.Колонки.Добавить("БухСуммаОборот");
	ДанныеБух.Колонки.Добавить("БухКоличествоОборот");
	
	Пока Выборка.Следующий() Цикл
		НС=ДанныеБух.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		//Сообщить(НС.ПериодМесяц);
	КонецЦикла;	

	//Сообщить(ДанныеБух.Количество());
	
	//	//Получаем схему из макета
	//СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	                                        Настройки, ДанныеРасшифровки);

	ВнешниеНаборыДанных=Новый Структура;

	ВнешниеНаборыДанных.Вставить("ДанныеБух",ДанныеБух);										
											
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
	                                                   ДанныеРасшифровки);

	//Очищаем поле табличного документа

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	

КонецПроцедуры
