
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаПредЗаписи  =  ДатаНачалоДействия();
	Если ЗначениеЗаполнено(Запись.IDКамеры) = Ложь Тогда 
		Запись.IDКамеры = Этаформа.ВладелецФормы.Родитель.ОтборКамера;
		Запись.Магазин = Этаформа.ВладелецФормы.Родитель.ОтборМагазин;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ОбъектНаблюдения) = Ложь Тогда
	  Запись.ОбъектНаблюдения  = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДатаНачалоДействия()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.ОбъектНаблюдения,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.IDКамеры,
		|	АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АК_ПривязкаКамерыКОбъектуНаблюдения.СрезПоследних(
		|			&ДатаСреза,
		|			IDКамеры = &IDКамеры
		|				И ОбъектНаблюдения = &ОбъектНаблюдения) КАК АК_ПривязкаКамерыКОбъектуНаблюденияСрезПоследних";

	Запрос.УстановитьПараметр("IDКамеры", Запись.IDКамеры);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектНаблюдения", Запись.ОбъектНаблюдения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
     ДатаРез = Неопределено;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ДатаРез = ВыборкаДетальныеЗаписи.Период;
	КонецЕсли;;
   Возврат ДатаРез;
КонецФункции // ()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Запись.ОбъектНаблюдения) = Ложь Тогда 
		Сообщить("Заполните объект наблюдения.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНаблюденияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора =	ОбъектНаблюденияСервер(Текст)


КонецПроцедуры

&НаСервере
Функция ОбъектНаблюденияСервер(Текст)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МП_Ракурсы.Ссылка
	               |ИЗ
	               |	Справочник.МП_Ракурсы КАК МП_Ракурсы
	               |ГДЕ
	               |	МП_Ракурсы.Наименование ПОДОБНО &Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РабочиеМеста.Ссылка
	               |ИЗ
	               |	Справочник.РабочиеМеста КАК РабочиеМеста
	               |ГДЕ
	               |	РабочиеМеста.Наименование ПОДОБНО &Наименование";
				   
	Запрос.УстановитьПараметр("Наименование", "%" + Текст + "%");

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Пока вЫборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка,Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции
