
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не ПроверитьСуществованиеПроведенногоБюджета(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Движения.БюджетДоходовИРасходов.Записывать = Истина;
	Если ЗначениеЗаполнено(Подписант) Тогда
		Для Каждого Строка Из Расшифровка Цикл
			Если Строка.Доход <> 0 Тогда
				Движение = Движения.БюджетДоходовИРасходов.Добавить();
				Движение.Период = НачалоМесяца(ПериодРегистрации);
				Движение.СтруктурнаяЕдиница = ЦФО;
				Движение.СтатьяДР = Строка.СтатьяДР;
				Движение.Документ = Ссылка;
				Движение.Сумма = Строка.Доход;
			КонецЕсли;
			Если Строка.Расход <> 0 Тогда
				Движение = Движения.БюджетДоходовИРасходов.Добавить();
				Движение.Период = НачалоМесяца(ПериодРегистрации);
				Движение.СтруктурнаяЕдиница = ЦФО;
				Движение.СтатьяДР = Строка.СтатьяДР;
				Движение.Документ = Ссылка;
				Движение.Сумма = -Строка.Расход;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьСуществованиеПроведенногоБюджета(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЦФО);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФормированиеБюджетаДоходовИРасходов.Ссылка
	               |ИЗ
	               |	Документ.ФормированиеБюджетаДоходовИРасходов КАК ФормированиеБюджетаДоходовИРасходов
	               |ГДЕ
	               |	ФормированиеБюджетаДоходовИРасходов.Проведен
	               |	И ФормированиеБюджетаДоходовИРасходов.ПериодРегистрации = &ПериодРегистрации
	               |	И ФормированиеБюджетаДоходовИРасходов.ЦФО = &СтруктурнаяЕдиница
	               |	И ФормированиеБюджетаДоходовИРасходов.Ссылка <> &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка! Документ с указанными ЦФО и периодом уже существует (" + Выборка.Ссылка + ")");
		Отказ = Истина;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
