
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТоварыПриНачалеРедактированияНаСервере(НоваяСтрока, Элемент.ТекущаяСтрока, Копирование);	
	
КонецПроцедуры

&НаСервере
Процедура ТоварыПриНачалеРедактированияНаСервере(НоваяСтрока, НомСтр, Копирование)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(НомСтр);
	
	Если НоваяСтрока Тогда
		
		ТекСтрока.ТипЖалобы = Справочники.ТипыЖалоб.НайтиПоКоду("16");
		ТекСтрока.РезультатОбращения = Справочники.РезультатыРассмотренияОбращений.НайтиПоКоду("6");
		ТекСтрока.ТипОбращения = Справочники.ТипыОбращенийПокупателей.НайтиПоКоду("23");
		ТекСтрока.Продавец1 = Объект.Продавец1;
		ТекСтрока.ДатаСобытия = Объект.Дата;
		
	КонецЕсли;
	
	Если Копирование Тогда
		ТекСтрока.УИНСтроки = "";
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭлОтбора = ТаблицаОбращений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("GUID_Загрузки");
	ЭлОтбора.Использование = Истина;
	ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЗагруженПоНовойСистеме Тогда
		Элементы.ТорговаяТочка.Доступность = Ложь;
		Если (Объект.ТипОперацииЧека = Перечисления.ТипыОперацийЧеков.Тип201
			ИЛИ Объект.ТипОперацииЧека = Перечисления.ТипыОперацийЧеков.Тип211) Тогда
			Элементы.ТипОперацииЧека.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Массив101 = Новый Массив();
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип101);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип102);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип103);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип104);
	
	Массив111 = Новый Массив();
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип111);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип112);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип113);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип114);
	
	Элементы.ТипОперацииЧека.СписокВыбора.Добавить(Объект.ТипОперацииЧека);
	
	Если Массив101.Найти(Объект.ТипОперацииЧека) <> Неопределено Тогда
		Для Каждого ЭлМас Из Массив101 Цикл
			Если ЭлМас = Объект.ТипОперацииЧека Тогда
				Продолжить;
			КонецЕсли;	
			Элементы.ТипОперацииЧека.СписокВыбора.Добавить(ЭлМас);
		КонецЦикла;	
	КонецЕсли;
	
	Если Массив111.Найти(Объект.ТипОперацииЧека) <> Неопределено Тогда
		Для Каждого ЭлМас Из Массив111 Цикл
			Если ЭлМас = Объект.ТипОперацииЧека Тогда
				Продолжить;
			КонецЕсли;	
			Элементы.ТипОперацииЧека.СписокВыбора.Добавить(ЭлМас);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
