
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
//+++АК KOPA 2018.04.11 ИП-00018337
	Если Не ЭтотОбъект.Утверждено и ЗначениеЗаполнено(ЭтотОбъект.Утверждающий) и Не ЭтотОбъект.АК_ВыгруженоВЗУП Тогда
		ТелеграмТехБот.ЗарегистрироватьОбъектНаОтправкуВТелеграмТехБот(ЭтотОбъект.Ссылка, Отказ);
	Иначе 
		ТелеграмТехБот.СнятьРегистрациюОбъектаНаОтправкуВТелеграмТехБот(ЭтотОбъект.Ссылка, Отказ);
	КонецЕсли;
//---АК KOPA

	//
	Если НЕ ЭтотОбъект.Утверждено Тогда
		Возврат;
	КонецЕсли; 
	
	//
	Для Каждого СтрокаСостава Из Состав Цикл
		
		Запись = Движения.Премии.Добавить();
		Запись.Период 		= ЭтотОбъект.Дата;
		Запись.ФизЛицо 		= СтрокаСостава.ФизЛицо;
		Запись.Сумма 		= СтрокаСостава.Сумма;
		Запись.СуммаСНДФЛ 	= СтрокаСостава.Сумма/0.87;
		Запись.Комментарий  = СтрокаСостава.Комментарий;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Состав.Итог("Сумма");
	ВыплаченнаяСумма = Состав.Итог("ВыплаченнаяСумма");
	
	//
	//Если ЭтотОбъект.Состав.Количество() > 0 Тогда
	//	ЭтотОбъект.Комментарий = Состав[0].Комментарий;
	//КонецЕсли;
	
//+++АК KOPA 2018.04.11 ИП-00018337
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТелеграмТехБот.СнятьРегистрациюОбъектаНаОтправкуВТелеграмТехБот(ЭтотОбъект.Ссылка, Отказ);	
	КонецЕсли;
//---АК KOPA
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ВидПремии = Неопределено;
	ЭтотОбъект.Утверждено = Ложь;
	//+++ АК Pans 2017.11.09  ИП-00017174
	Для каждого СтрокаТЧ1 Из Состав Цикл
		СтрокаТЧ1.ВыплаченнаяСумма = 0;
		СтрокаТЧ1.ДатаВыплаты = Неопределено;
	КонецЦикла;
	//--- АК Pans 2017.11.09  ИП-00017174
	
КонецПроцедуры
