
&НаСервере
Функция Печать(ПараметрКоманды)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерСклад.Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерСклад КАК РасходныйОрдерСклад
		|ГДЕ
		|	РасходныйОрдерСклад.Проведен
		|	И РасходныйОрдерСклад.Основание = &Основание";

	Запрос.УстановитьПараметр("Основание", ПараметрКоманды);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Мас=Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Мас.Добавить(Документы.РасходныйОрдерСклад.ПечатьРасходныйОрдерРеклМатериалы_Товары(ВыборкаДетальныеЗаписи.Ссылка));
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//Если ПараметрКоманды.Склад.ЭтоСкладРеклМатериалов Тогда
		Возврат Мас;
	//ИначеЕсли ПараметрКоманды.ВидОперации = Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВПереработку Тогда
	//	Сообщить("При передаче в переработку необходимо печатать форму М-15 в 2-ух экземплярах");
	//	Возврат Неопределено;
	//ИначеЕсли ПараметрКоманды.ВидОперации = Перечисления.ВидыОперацийРасходСкладскойУчет.ПередачаОборудованияВТорговуюТочку Тогда
	//	Возврат Документы.РасходныйОрдерСклад.ПечатьРасходныйОрдер_Оборудование(ПараметрКоманды);
	//Иначе
	//	Возврат Документы.РасходныйОрдерСклад.ПечатьРасходныйОрдер_Товары(ПараметрКоманды);
	//КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МасТабДок = Печать(ПараметрКоманды);
 	Если МасТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	//ОповеститьОбИзменении(ПараметрКоманды);
	Для каждого Эл Из МасТабДок Цикл
		ТабДок=Эл;	
		ТабДок.ОтображатьСетку			= Ложь;
		ТабДок.Защита					= Ложь;
		ТабДок.ТолькоПросмотр			= Истина;
		ТабДок.ОтображатьЗаголовки		= Ложь;
		ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
		ТабДок.РазмерКолонтитулаСнизу	= 0;
		ТабДок.РазмерКолонтитулаСверху 	= 0;
		ТабДок.ПолеСверху 				= 5;
		ТабДок.ПолеСнизу 				= 5;
		ТабДок.ПолеСлева 				= 5;
		ТабДок.ПолеСправа 				= 5;
		ТабДок.АвтоМасштаб				= Истина;
		ТабДок.Показать();
		
	
	КонецЦикла; 
	
КонецПроцедуры
