//+++ АК LUZA 2017.10.25 ИП-00016964
&НаКлиенте
Процедура ДанныеПоВсемПользователямПриИзменении(Элемент)
	//
	ЗаполнитьТаблицуПриходныхОрдеровНаСервере();
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаКлиенте
Процедура ОткрытьФайл(Команда)
		
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяФайла(ТекущиеДанные.Файл, Команда.Имя);
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда	
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;

КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаКлиенте
Процедура Обновить(Команда)
	//
	ЗаполнитьТаблицуПриходныхОрдеровНаСервере();	
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаКлиенте
Процедура ИсключитьИзСписка(Команда)
	//
	ТекущиеДанные = Элементы.ТаблицаПриходныхОредров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;  	
	
	//
	ПроставитьОтметкуВРегистре(ТекущиеДанные.ПриходныйОрдер);
	
	//
	ИндексТекущейСтроки = ТаблицаПриходныхОредров.Индекс(ТекущиеДанные);
	ТаблицаПриходныхОредров.Удалить(ИндексТекущейСтроки);
	ТЗ_ПриходныхОрдеров_ТекущаяСтрока = 0;
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаСервере
Процедура ПроставитьОтметкуВРегистре(ПриходныйОрдер)
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АК_ОчередьРаспознаванияФайлов.Файл
	|ИЗ
	|	РегистрСведений.АК_ОчередьРаспознаванияФайлов КАК АК_ОчередьРаспознаванияФайлов
	|ГДЕ
	|	АК_ОчередьРаспознаванияФайлов.ОбъектСравнения = &ОбъектСравнения";
	Запрос.УстановитьПараметр("ОбъектСравнения", ПриходныйОрдер);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		Запись = РегистрыСведений.АК_ОчередьРаспознаванияФайлов.СоздатьМенеджерЗаписи();
		Запись.Файл = Стр.Файл;
		Запись.Прочитать();
		Если ЗначениеЗаполнено(Запись.Файл) = Истина Тогда
			Запись.РезультатСравнения = Истина;
			Запись.РаспознанНеКорректно = Истина;
			Запись.Записать();
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	ЗаполнитьТаблицуПриходныхОрдеровНаСервере();	
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаСервере
Процедура ЗаполнитьТаблицуПриходныхОрдеровНаСервере()
	//
	Если ДанныеПоВсемПользователям = Истина Тогда
		ТЗ = Обработки.АК_ИнформацияОРаспознаванииДокументовСклад.ПолучитьТаблицуПриходныхОрдеров();
	Иначе	
		ТЗ = Обработки.АК_ИнформацияОРаспознаванииДокументовСклад.ПолучитьТаблицуПриходныхОрдеров(ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	ТаблицаПриходныхОредров.Загрузить(ТЗ);
	
КонецПроцедуры	
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаКлиенте
Процедура ТаблицаПриходныхОредровПриАктивизацииСтроки(Элемент)
	//
	ТекущиеДанные = Элементы.ТаблицаПриходныхОредров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТаблицаФайлов.Очистить();
		Возврат;	
	КонецЕсли;
	
	//
	Если ТЗ_ПриходныхОрдеров_ТекущаяСтрока = Элементы.ТаблицаПриходныхОредров.ТекущаяСтрока И ЗначениеЗаполнено(ТЗ_ПриходныхОрдеров_ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ТЗ_ПриходныхОрдеров_ТекущаяСтрока = Элементы.ТаблицаПриходныхОредров.ТекущаяСтрока;

	ПолучитьТаблицуФайлов(ТекущиеДанные.ПриходныйОрдер);	
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964

//+++ АК LUZA 2017.10.25 ИП-00016964
&НаСервере
Процедура ПолучитьТаблицуФайлов(ПриходныйОрдер)
	//
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	|	ПриходныйОрдерСкладПрикрепленныеФайлы.Файл,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, """") КАК ИНН_В_Файле
	|ИЗ
	|	Документ.ПриходныйОрдерСклад.ПрикрепленныеФайлы КАК ПриходныйОрдерСкладПрикрепленныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПриходныйОрдерСкладПрикрепленныеФайлы.Файл = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Файлы_Склад_ПоставщикИНН))
	|ГДЕ
	|	ПриходныйОрдерСкладПрикрепленныеФайлы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПриходныйОрдер);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаФайлов.Загрузить(ТЗ);	
	
КонецПроцедуры
//--- АК LUZA 2017.10.25 ИП-00016964


//+++ АК LUZA 2017.10.25 ИП-00016964
&НаСервере
Функция ПолучитьИмяФайла(Файл, Команда)
	//
	Если Команда = "ОткрытьРаспознанныйТекст" Тогда
		Возврат Справочники.Файлы.ПолучитьИмяФайлаДляРаспознанногоОбъекта(Файл);
	Иначе
		Возврат Справочники.Файлы.ПолучитьИмяФайлаДляОбъекта(Файл);
	КонецЕсли;	
	
КонецФункции

//--- АК LUZA 2017.10.25 ИП-00016964






