
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаданиеТехнологаМагазинам = Объект.ДокументОснование.ДокументОснование;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если НЕ Отказ Тогда
		Оповестить("ЗаписатьЗаданиеТехнологаМагазинам");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвереноСПоставщикомПриИзменении(Элемент)
	
	Если Объект.СвереноСПоставщиком Тогда
		Объект.ДатаСверки = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаданияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗаданиеТехнологаМагазинам) Тогда
		Попытка
			ЗаданиеТехнологаМагазинамОбъект = ЗаданиеТехнологаМагазинам.ПолучитьОбъект();
			ЗаданиеТехнологаМагазинамОбъект.ОбновитьСуммыРеализованногоВозврата(Объект.Ссылка);
			ЗаданиеТехнологаМагазинамОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьСуммыРеализованногоВозврата",, Объект.Ссылка);
	
КонецПроцедуры
