&НаКлиенте
Процедура ПросмотрНаКарте(Команда)
	
	Если Элементы.ФормаПросмотрНаКарте.Пометка тогда
		//сбосим отбор
		
		Элементы.ФормаПросмотрНаКарте.Пометка=Ложь;
		
		Если НЕ ОтображениеСписком тогда
			ОтображениеСписком=Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок;
		КонецЕсли;
		Для Каждого ЭлементОтбора из Список.Отбор.Элементы цикл
			Если ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора и ЭлементОтбора.Использование и ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно тогда
				Список.Отбор.Элементы.Удалить(ЭлементОтбора);
				прервать;
			КонецЕсли;
		КонецЦикла;

	иначе
		
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Истина, Ложь);
		ПараметрыПодбора.Вставить("Режим",					"РежимВыборКонтрагента");
		
		ОткрытьФорму("Обработка.АК_ОтображениеНаКарте.Форма", ПараметрыПодбора, ЭтаФорма,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если (ТипЗнч(ИсточникВыбора)=Тип("УправляемаяФорма")) и (ИсточникВыбора.ИмяФормы="Обработка.АК_ОтображениеНаКарте.Форма.Форма") тогда
		
		ЗначениеОтбора=ВыбранноеЗначение.СсылкаНаОбъект;
		
		ОтображениеСписком=Элементы.Список.Отображение=ОтображениеТаблицы.Список;
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	    ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
		
		Элементы.ФормаПросмотрНаКарте.Пометка=Истина;
		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура УстановитьОтборПоСсылке(Ссылка)
КонецПроцедуры

Процедура ПоместитьКонтрагентаВАрхивНаСервере(Контрагент)
	
	Справочники.Контрагенты.ПоместитьКонтрагентаВАрхив(Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьКонтрагентаВАрхив(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		ПоместитьКонтрагентаВАрхивНаСервере(ТекСтрока);
		Элементы.Список.Обновить();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВосстановитьКонтрагентаИзАрхиваНаСервере(Контрагент)
	
	Справочники.Контрагенты.ВосстановитьИзАрхива(Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьКонтрагентаИзАрхива(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		ВосстановитьКонтрагентаИзАрхиваНаСервере(ТекСтрока);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

