
//+++АК LAGP 2018.11.29 ИП-00020291 Загрузка договоров депозита из pdf банка
Функция ПрочитатьPDFДепозит(ПутьДоФайла) Экспорт
	
	НашФайл = ПутьДоФайла;
	ПутьКPDFtoTEXT = "\\10.0.0.51\1c$\PDFtoTXT\";
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
	КопироватьФайл(НашФайл, ИмяВременногоФайла);
	
	pdf = ИмяВременногоФайла;
	txt = СтрЗаменить(pdf,"pdf","txt");
	Команд = ПутьКPDFtoTEXT +"pdftotext.exe " + "-enc UTF-8 " + pdf + " " + txt;
	ЗапуститьПриложение(Команд);	
	
	ДопМодульСервер.Пауза(4);
	
	мСтрокФайла = Новый Массив();
	Файл = Новый ЧтениеТекста(txt, КодировкаТекста.UTF8);
	
	ВесьТекст = Файл.Прочитать();
	
	Если Найти(ВесьТекст, "Банке ВТБ (ПАО)") > 0 Тогда
		
		ДатаДоговора = Дата('00010101');
		ВхождениеДатаДоговора = Найти(ВесьТекст, "3.Дата размещения депозита:");
		Если ВхождениеДатаДоговора > 0 Тогда
			СтрокаСДатойДоговора = Прав(ВесьТекст, СтрДлина(ВесьТекст) - ВхождениеДатаДоговора - 27);
			СтрокаСДатойДоговора = Лев(СтрокаСДатойДоговора, Найти(СтрокаСДатойДоговора, "."));
			СтрокаСДатойДоговора = СтрЗаменить(СтрокаСДатойДоговора, " ", "");
			
			ЧислоДоговора = Сред(СтрокаСДатойДоговора, Найти(СтрокаСДатойДоговора, "«") + 1, Найти(СтрокаСДатойДоговора, "»") - Найти(СтрокаСДатойДоговора, "«") - 1);
			
			СтрокаСДатойДоговора = Прав(СтрокаСДатойДоговора, СтрДлина(СтрокаСДатойДоговора) - Найти(СтрокаСДатойДоговора, "»"));
			МесяцДоговора = ВРЕГ(Лев(СтрокаСДатойДоговора, Найти(СтрокаСДатойДоговора, "2") - 1));
			
			Если МесяцДоговора = "ЯНВАРЯ" Тогда
				МесяцДоговора = "01";	
			ИначеЕсли МесяцДоговора = "ФЕВРАЛЯ" Тогда
				МесяцДоговора = "02";
			ИначеЕсли МесяцДоговора = "МАРТА" Тогда
				МесяцДоговора = "03";
			ИначеЕсли МесяцДоговора = "АПРЕЛЯ" Тогда
				МесяцДоговора = "04";
			ИначеЕсли МесяцДоговора = "МАЯ" Тогда
				МесяцДоговора = "05";
			ИначеЕсли МесяцДоговора = "ИЮНЯ" Тогда
				МесяцДоговора = "06";
			ИначеЕсли МесяцДоговора = "ИЮЛЯ" Тогда
				МесяцДоговора = "07";
			ИначеЕсли МесяцДоговора = "АВГУСТА" Тогда
				МесяцДоговора = "08";
			ИначеЕсли МесяцДоговора = "СЕНТЯБРЯ" Тогда
				МесяцДоговора = "09";
			ИначеЕсли МесяцДоговора = "ОКТЯБРЯ" Тогда
				МесяцДоговора = "10";
			ИначеЕсли МесяцДоговора = "НОЯБРЯ" Тогда
				МесяцДоговора = "11";
			ИначеЕсли МесяцДоговора = "ДЕКАБРЯ" Тогда
				МесяцДоговора = "12";
			Иначе
				Сообщить("Месяц договора не определен. Строка: " + СтрокаСДатойДоговора);		
			КонецЕсли;					
			
			ГодДоговора = Сред(СтрокаСДатойДоговора, Найти(СтрокаСДатойДоговора, "2"), 4);
			
			Попытка 
				ДатаДоговора = Дата("" + ГодДоговора + МесяцДоговора + ЧислоДоговора);
			Исключение	
				Сообщить("Месяц договора не определен. Строка: " + ГодДоговора + МесяцДоговора + ЧислоДоговора);
			КонецПопытки;	
			
		КонецЕсли;	
		
		НомерДоговора = "";
		
		СтавкаДоговораЧисло = 0;
		ВхождениеСтавкаДоговора = Найти(ВесьТекст, "6.Процентная ставка по депозиту:");
		Если ВхождениеСтавкаДоговора > 0 Тогда
			СтрокаСоСтавкойДоговора = Прав(ВесьТекст, СтрДлина(ВесьТекст) - ВхождениеСтавкаДоговора - 32);	
			СтрокаСоСтавкойДоговора = Лев(СтрЗаменить(СтрокаСоСтавкойДоговора, " ", ""), 6);
			СтрокаСоСтавкой = "";
			Для НомерСимвола = 1 По СтрДлина(СтрокаСоСтавкойДоговора) Цикл		
				Если Найти("0123456789,", Сред(СтрокаСоСтавкойДоговора, НомерСимвола, 1)) > 0 Тогда
					СтрокаСоСтавкой = СтрокаСоСтавкой + Сред(СтрокаСоСтавкойДоговора, НомерСимвола, 1);		
				КонецЕсли;	
			КонецЦикла
		КонецЕсли;	
		
		Попытка
			СтавкаДоговораЧисло = Число(СтрокаСоСтавкой);
		Исключение
			Сообщить("Не удалось расшифровать ставку договора. Строка: " + СтрокаСоСтавкой);
		КонецПопытки;	
		
		ВладелецДоговора = Справочники.Контрагенты.НайтиПоКоду("Т0002799"); //ВТБ					
		
		СтрокаСоСроком = 0;
		ВхождениеСрокаДепозита = Найти(ВесьТекст, "5.Срок депозита:");
		Если ВхождениеСрокаДепозита > 0 Тогда
			СтрокаСоСрокомДепозита = Прав(ВесьТекст, СтрДлина(ВесьТекст) - ВхождениеСрокаДепозита - 16);	
			СтрокаСоСрокомДепозита = Лев(СтрЗаменить(СтрокаСоСрокомДепозита, " ", ""), 7);
			СтрокаСоСроком = "";
			Для НомерСимвола = 1 По СтрДлина(СтрокаСоСрокомДепозита) Цикл		
				Если Найти("0123456789", Сред(СтрокаСоСрокомДепозита, НомерСимвола, 1)) > 0 Тогда
					СтрокаСоСроком = СтрокаСоСроком + Сред(СтрокаСоСрокомДепозита, НомерСимвола, 1);		
				КонецЕсли;	
			КонецЦикла;
			
			Если НЕ ЗначениеЗаполнено(СтрокаСоСроком) Тогда
				СтрокаСоСроком = 0;
				Сообщить("Не удалось расшифровать срок депозита. Строка: " + СтрокаСоСрокомДепозита);
			КонецЕсли;	
		КонецЕсли;
		
		СрокВДнях = Число(СтрокаСоСроком);
		ДатаДействияДоговора = НачалоДня(ДатаДоговора) + 86400 * СрокВДнях;
		
		СтрокаСумма = "";	
		ВхождениеСуммаДоговора = Найти(ВесьТекст, "2.Сумма депозита:");
		СуммаДоговора = Прав(ВесьТекст, СтрДлина(ВесьТекст) - ВхождениеСуммаДоговора - 17);
		СуммаДоговора = Лев(СтрЗаменить(СуммаДоговора, " ", ""), 15);
		ЧислоЗакончилось = Ложь;
		Для НомерСимвола = 1 По СтрДлина(СуммаДоговора) Цикл		
			Если Найти("0123456789", Сред(СуммаДоговора, НомерСимвола, 1)) > 0 И НЕ ЧислоЗакончилось Тогда
				СтрокаСумма = СтрокаСумма + Сред(СуммаДоговора, НомерСимвола, 1);	
			ИначеЕсли ЗначениеЗаполнено(СтрокаСумма) И НЕ ЧислоЗакончилось Тогда
				ЧислоЗакончилось = Истина;			
			КонецЕсли;	
		КонецЦикла;
		СуммаДоговора = Число(СтрокаСумма);
		
		ВалютаДоговора = Справочники.Валюты.ПустаяСсылка();
		ВхождениеВалютаДоговора = Найти(ВесьТекст, "1.Валюта депозита:");
		СтрокаВалютаДоговора = Прав(ВесьТекст, СтрДлина(ВесьТекст) - ВхождениеВалютаДоговора - 18);
		СтрокаВалютаДоговора = Лев(СтрЗаменить(СтрокаВалютаДоговора, " ", ""), 50);
		Если Найти(ВРег(СтрокаВалютаДоговора), "ЕВРО") Тогда
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("978");	
		ИначеЕсли Найти(ВРег(СтрокаВалютаДоговора), "ДОЛЛАР") Тогда	
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("840");
		Иначе 
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("643");		
		КонецЕсли;
		
		//Определение организации
		ВесьТекст = СтрЗаменить(ВесьТекст, " ", "");
		ЭтоВкусвилл = Найти(ВРег(ВесьТекст), "ВКУСВИЛЛ") > 0;                               
		ЭтоТилси = Найти(ВРег(ВесьТекст), "ТИЛСИ") > 0;
		ЭтоЛугДаПоле = Найти(ВРег(ВесьТекст), "ЛУГДАПОЛЕ") > 0;                               
		ЭтоПроектИзбёнка = Найти(ВРег(ВесьТекст), "ПРОЕКТИЗБ") > 0;
		
		ОрганизацияДоговора = Справочники.Контрагенты.ПустаяСсылка();
		Если ЭтоВкусвилл Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000006");
		ИначеЕсли ЭтоТилси Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000009");
		ИначеЕсли ЭтоЛугДаПоле Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000004");
		ИначеЕсли ЭтоПроектИзбёнка Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000005");	
		КонецЕсли;	
		
	Иначе	
		Файл = Новый ЧтениеТекста(txt, КодировкаТекста.UTF8);
		Строка = Файл.ПрочитатьСтроку();
		Если Строка <> Неопределено Тогда
			мСтрокФайла.Добавить(Строка);
		КонецЕсли;
		
		Пока Строка <> Неопределено Цикл
			Строка = Файл.ПрочитатьСтроку();
			Если Строка <> Неопределено Тогда
				мСтрокФайла.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		ДатаДоговора = Сред(СтрЗаменить(мСтрокФайла[3], " ", ""), 3, 10);
		
		ДатаДоговора = "" + Сред(ДатаДоговора, 7, 4) + Сред(ДатаДоговора, 4, 2) + Сред(ДатаДоговора, 1, 2);
		
		Попытка
			ДатаДоговора = Дата(ДатаДоговора);
		Исключение
			Сообщить("Дата договора не определена! Строка: " + мСтрокФайла[3]);
		КонецПопытки;	
		
		НомерДоговора =  Сред(СтрЗаменить(мСтрокФайла[3], " ", ""), 14, 14);
		СтавкаДоговора = СтрЗаменить(мСтрокФайла[20], " ", "");
		СтавкаДоговораЧисло = СтрЗаменить(СтавкаДоговора, "%", "");
		
		Попытка
			СтавкаДоговораЧисло = Число(СтавкаДоговораЧисло);
		Исключение
			Сообщить("Не удалось расшифровать ставку договора. Строка: " + мСтрокФайла[20]);
		КонецПопытки;	
		
		//Определение организации
		ЭтоВкусвилл = Найти(ВРег(СтрЗаменить(мСтрокФайла[4], "_", "")), "ВКУСВИЛЛ") > 0;                               
		ЭтоТилси = Найти(ВРег(СтрЗаменить(мСтрокФайла[4], "_", "")), "ТИЛСИ") > 0;
		ЭтоЛугДаПоле = Найти(ВРег(СтрЗаменить(мСтрокФайла[4], "_", "")), "ЛУГДАПОЛЕ") > 0;                               
		ЭтоПроектИзбёнка = Найти(ВРег(СтрЗаменить(мСтрокФайла[4], "_", "")), "ПРОЕКТИЗБ") > 0;
		
		ВладелецДоговора = Справочники.Контрагенты.НайтиПоКоду("000001506"); //СБЕРБАНК	
		
		ОрганизацияДоговора = Справочники.Контрагенты.ПустаяСсылка();
		Если ЭтоВкусвилл Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000006");
		ИначеЕсли ЭтоТилси Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000009");
		ИначеЕсли ЭтоЛугДаПоле Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000004");
		ИначеЕсли ЭтоПроектИзбёнка Тогда
			ОрганизацияДоговора = Справочники.Организации.НайтиПоКоду("000000005");	
		КонецЕсли;	
		
		СрокВДнях = СтрЗаменить(мСтрокФайла[18], " ", "");
		СрокВДнях = ?(СтрДлина(СрокВДнях) > 10, Прав(СрокВДнях, 5), 0);
		СтрокаДней = "";
		Для НомерСимвола = 1 По СтрДлина(СрокВДнях) Цикл		
			Если Найти("0123456789", Сред(СрокВДнях, НомерСимвола, 1)) > 0 Тогда
				СтрокаДней = СтрокаДней + Сред(СрокВДнях, НомерСимвола, 1);		
			КонецЕсли;	
		КонецЦикла;	
		
		СрокВДнях = Число(СтрокаДней); //исключения не может быть	
		ДатаДействияДоговора = НачалоДня(ДатаДоговора) + 86400 * СрокВДнях;
		
		СуммаДоговора = СтрЗаменить(мСтрокФайла[18], " ", "");
		СтрокаСумма = "";
		ЧислоЗакончилось = Ложь;
		Для НомерСимвола = 1 По СтрДлина(СуммаДоговора) Цикл		
			Если Найти("0123456789", Сред(СуммаДоговора, НомерСимвола, 1)) > 0 И НЕ ЧислоЗакончилось Тогда
				СтрокаСумма = СтрокаСумма + Сред(СуммаДоговора, НомерСимвола, 1);	
			ИначеЕсли ЗначениеЗаполнено(СтрокаСумма) И НЕ ЧислоЗакончилось Тогда
				ЧислоЗакончилось = Истина;			
			КонецЕсли;	
		КонецЦикла;	
		
		СуммаДоговора = Число(СтрокаСумма);
		
		ВалютаДоговора = Справочники.Валюты.ПустаяСсылка();
		Если Найти(ВРег(мСтрокФайла[4]), "ЕВРО") Тогда
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("978");	
		ИначеЕсли Найти(ВРег(мСтрокФайла[4]), "ДОЛЛАР") Тогда	
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("840");
		Иначе 
			ВалютаДоговора = Справочники.Валюты.НайтиПоКоду("643");		
		КонецЕсли;	
		
	КонецЕсли;
	
	Файл.Закрыть();
	
	//Далее вырезки из ТЗ
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	
	//Поле Владелец заполняется по значению поля "Сделки вклада(депозита) с банком" из файла.
	НовыйДоговор.Владелец = ВладелецДоговора;
	//Поле Организация значение поля "Клиент" из файла	
	НовыйДоговор.Организация = ОрганизацияДоговора;
	//Поле Номер значение поля "№" из файла	
	НомерДоговора = "" + ОпределитьНомерДоговора(ВладелецДоговора, ДатаДоговора) + "/" + Формат(ДатаДоговора, "ДФ=гг");
	НовыйДоговор.Номер = НомерДоговора; 	                              
	
	НовыйДоговор.Наименование = "Депозит " + НомерДоговора + " от " + Формат(ДатаДоговора, "ДФ=dd.MM.yyyy") + " (" + Окр(СуммаДоговора / 1000000, 2) + " млн." + СтавкаДоговора + ") " + СрокВДнях + " " + СокрЛП(Прав(ЧислоПрописью(СрокВДнях,, "день, дня, дней, М,,,,,0"), 4));
	//Поле Валюта значение поля "Вид валюты" из файла.
	НовыйДоговор.ВалютаВзаиморасчетов = ВалютаДоговора;
	//Поле в котором указана Дата договора это значение поля "От" из файла.
	НовыйДоговор.Дата = ДатаДоговора;
	//Поле "Срок действия договора" равен дате = Дата договора плюс количество дней, указанных в поле "Срок размещения вклада(депозита) (дней)" из файла.
	НовыйДоговор.СрокДействия = ДатаДействияДоговора;
	//Поле Вид договора Финансовый (всегда по умолчанию).
	НовыйДоговор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Финансовый"); //Перечисления.ВидыДоговоровКонтрагентов.Финансовый;
	//Поле Тип договора Депозит (всегда по умолчанию).
	НовыйДоговор.ТипДоговораФинансы = Перечисления.ТипыДоговоровФинансы.Депозит;
	//Поле Сумма значение поля Сумма депозита из файла.
	НовыйДоговор.СуммаДоговора = СуммаДоговора;
	//Поле Ставка (%) значение из поля Процентная ставка (%годовых).
	НовыйДоговор.ПроцентнаяСтавка = СтавкаДоговораЧисло;
	
	НовыйДоговор.СтатьяДвиженияДенежныхСредств = ОбщегоНазначенияПовтИсп.ВернутьСтатьюДДСПоУсловию("310310");		
	
	УдалитьФайлы(pdf);
	УдалитьФайлы(txt);
	
	Возврат НовыйДоговор;
	
КонецФункции

//+++АК LAGP 2018.11.29 ИП-00020291 Загрузка договоров депозита из pdf банка
Функция ОпределитьНомерДоговора(КонтрагентВладелец, ДатаДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДоговорыКонтрагентов.Владелец) КАК КоличествоДоговоровВГоду
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.Дата МЕЖДУ &НачалоГодаДата И &КонецГодаДата
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ТипДоговораФинансы = &ТипДоговораФинансы";
	
	Запрос.УстановитьПараметр("Владелец", КонтрагентВладелец);
	Запрос.УстановитьПараметр("КонецГодаДата", КонецГода(ДатаДоговора));
	Запрос.УстановитьПараметр("НачалоГодаДата", НачалоГода(ДатаДоговора));
	Запрос.УстановитьПараметр("ТипДоговораФинансы", Перечисления.ТипыДоговоровФинансы.Депозит);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 	ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.КоличествоДоговоровВГоду;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции	