
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	Сообщить("Справочник можно редактировать только в бухгалтерской базе");
	Отказ = Истина;
    Возврат;
	//Если Не ЭтоГруппа Тогда
	//	
	//	ЭтоОсновнаяСистема = (ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПредпринимательскаяДеятельностьНеОблагаемаяЕНВД
	//					  Или ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам);
	//	
	//	Если ВидРасходовНУ.Пустая() И ЭтоОсновнаяСистема Тогда
	//		Сообщить("Укажите вид расхода!", СтатусСообщения.Важное);
	//		Отказ = Истина;
	//	КонецЕсли;
	//
	//КонецЕсли;
	
КонецПроцедуры
