
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	Отчёт.Магазин = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	НомерТочкиПоАйпи = ПараметрыСеанса.НомерТочкиПоАйпи;
	ЭтоПродавецТолькоПросмотр = РольДоступна("ПродавецТолькоПросмотр");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ПользПоле Из Отчёт.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПользПоле) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ИмяПараметра = Строка(ПользПоле.Параметр);
			Если ИмяПараметра = "Магазин" Тогда
				ПользПоле.Значение = Отчёт.Магазин;
				ПользПоле.Использование = ЗначениеЗаполнено(Отчёт.Магазин);
				РежимОтображенияПараметра = ?(ЗначениеЗаполнено(Отчёт.Магазин) И НомерТочкиПоАйпи <> 999 И НЕ ЭтоПродавецТолькоПросмотр, "Недоступный", "БыстрыйДоступ");
				ПользПоле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных[РежимОтображенияПараметра];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
