
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Документы.Очистить();
	
	Для каждого Строка из ТаблицаТиповДокументов Цикл
		
		Если НЕ Строка.Флаг Тогда 
			Продолжить;	
		КонецЕсли;	
		
		МассивДокументов = ПолучитьМассивДокументов(Строка.ИмяДокумента);
		
		Для каждого Документ ИЗ МассивДокументов Цикл
			ПеренестиРеквизитыВТаблицу(Документ);
		КонецЦикла;
		
	КонецЦикла;	
	
	ТаблицаИтого = Объект.Документы.Выгрузить();
	ТаблицаИтого.Колонки.Добавить("Реквизитов");
	Для каждого строка из ТаблицаИтого Цикл
		строка.Реквизитов = 1;			
	КонецЦикла;	
	ТаблицаИтого.Свернуть("Ответственный,Документ","Реквизитов");
	ТаблицаИтого.Колонки.Добавить("Документов");
	Для каждого строка из ТаблицаИтого Цикл
		строка.Документов = 1;			
	КонецЦикла;	
	ТаблицаИтого.Свернуть("Ответственный","Реквизитов,Документов");
	ДокументыИОтветственные.Загрузить(ТаблицаИтого);
	ВсегоДокументов = ТаблицаИтого.Итог("Документов");
	ВсегоРеквизитов = ТаблицаИтого.Итог("Реквизитов");
КонецПроцедуры

Процедура  ПеренестиРеквизитыВТаблицу(Документ)
	
	МассивПоиска = Новый Массив;
	
	МассивПоиска.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	МассивПоиска.Добавить(Тип("СправочникСсылка.СтатьиДоходовРасходов"));
	
	Реквизиты = Документ.Метаданные().Реквизиты;	
	Для каждого Реквизит из Реквизиты Цикл
		
		ТипРеквизита = ТипЗнч(Документ[Реквизит.Имя]);
		ТипПроверка = МассивПоиска.Найти(ТипРеквизита) <> Неопределено;	
		Если ТипПроверка тогда
			Если Документ[Реквизит.Имя].ПометкаУдаления Тогда
				
				НоваяСтрока = Объект.Документы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Документ);
				НоваяСтрока.Документ = Документ;
				НоваяСтрока.ТипРеквизита = ПредставлениеТипа(ТипРеквизита);
				НоваяСтрока.ИмяРеквизита = Реквизит.Имя;
				НоваяСтрока.ЗначениеРеквизита = Документ[Реквизит.Имя];
				
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	
	ТабличныеЧасти = Документ.Метаданные().ТабличныеЧасти;	
	Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		Реквизиты = ТабличнаяЧасть.Реквизиты;
		Для каждого СтрокаТЧ из Документ[ТабличнаяЧасть.Имя] Цикл	
			Для каждого Реквизит из Реквизиты Цикл	
				ТипРеквизита = ТипЗнч(СтрокаТЧ[Реквизит.Имя]);
				ТипПроверка = МассивПоиска.Найти(ТипРеквизита) <> Неопределено;	
				Если ТипПроверка тогда
					Если СтрокаТЧ[Реквизит.Имя].ПометкаУдаления Тогда
						НоваяСтрока = Объект.Документы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,Документ);
						НоваяСтрока.Документ = Документ;
						НоваяСтрока.ТипРеквизита = ПредставлениеТипа(ТипРеквизита);
						НоваяСтрока.ИмяРеквизита = ТабличнаяЧасть.Имя + "." +Реквизит.Имя;
						НоваяСтрока.ЗначениеРеквизита = СтрокаТЧ[Реквизит.Имя];
						
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры	

Функция ПредставлениеТипа(ТипРеквизита)
	
	Если ТипРеквизита = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
		Возврат "Статья ДДС";
	ИначеЕсли  ТипРеквизита = Тип("СправочникСсылка.СтатьиДоходовРасходов") Тогда	
	    Возврат "Статья ДР";
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	


Функция ПолучитьМассивДокументов(ИмяДокумента)
	
	БазовыйЗапрос = Новый Запрос;
	
	БазовыйЗапрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИмяДокумента.Ссылка КАК Документ
	|ИЗ
	|	Документ.ИмяДокумента КАК ИмяДокумента
	|ГДЕ
	|   ИмяДокумента.Ссылка.Проведен = Истина И
	|	(ИмяДокумента.Ссылка.Дата >=&ДатаНачала И 
	|   ИмяДокумента.Ссылка.Дата <=&ДатаОкончания)";
	
	БазовыйЗапрос.Текст = СтрЗаменить(БазовыйЗапрос.Текст,"ИмяДокумента",ИмяДокумента);
	БазовыйЗапрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала);
	БазовыйЗапрос.УстановитьПараметр("ДатаОкончания",КонецДня(Объект.ДатаОкончания));
	
	ЭтоПервый = Истина;
	БазовыйЗапрос.Текст = БазовыйЗапрос.Текст + " И (";
	ДополнитьЗапросРеквизиты(ИмяДокумента,БазовыйЗапрос.Текст,ЭтоПервый,"Справочник.СтатьиДвиженияДенежныхСредств");
	ДополнитьЗапросРеквизиты(ИмяДокумента,БазовыйЗапрос.Текст,ЭтоПервый,"Справочник.СтатьиДоходовРасходов");	
	БазовыйЗапрос.Текст = БазовыйЗапрос.Текст + ")";
	
	РезультатЗапроса = БазовыйЗапрос.Выполнить().Выгрузить();
	
	Возврат  РезультатЗапроса.ВыгрузитьКолонку("Документ");
	
КонецФункции	

Процедура  ЗаполнитьТаблицуДокументов()
		
	ТаблицаТиповДокументов.Очистить();
	ДобавитьСтроку("ПоступлениеТоваровУслуг");
	ДобавитьСтроку("ПоступлениеДопРасходов");
	ДобавитьСтроку("РасходИзБанка");
	ДобавитьСтроку("ПоступлениеВБанк");
	ДобавитьСтроку("ЗаявкаНаУслугиМатериалы");
	ДобавитьСтроку("ПоступлениеВКассу");
	ДобавитьСтроку("РасходИзКассы");
	ДобавитьСтроку("КорректировкаВзаиморасчетов");
	
КонецПроцедуры


Функция ЗаполнитьМассивРеквизитов(ИмяДокумента,ТипРеквизита)
	
	Реквизиты = Новый Массив;
	
	
	Если ТипРеквизита = "Справочник.СтатьиДвиженияДенежныхСредств" Тогда
		
		Если ИмяДокумента = "ПоступлениеТоваровУслуг" Тогда	
			Реквизиты.Добавить("СтатьяДДС");
			Реквизиты.Добавить("Услуги.Субконто2");
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеДопРасходов" Тогда	
			Реквизиты.Добавить("СтатьяДДС");
		КонецЕсли;	
		
		Если ИмяДокумента = "РасходИзБанка" Тогда	
			Реквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
			Реквизиты.Добавить("СубконтоДт2");
			Реквизиты.Добавить("СубконтоДт3");
			Реквизиты.Добавить("ПеречислениеЗаработнойПлаты.СтатьяДвиженияДенежныхСредств");
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеВБанк" Тогда	
			Реквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
			Реквизиты.Добавить("СубконтоКт2");
			Реквизиты.Добавить("СубконтоКт3");
		КонецЕсли;	
		
		
		Если ИмяДокумента = "ЗаявкаНаУслугиМатериалы" Тогда	
			Реквизиты.Добавить("СтатьяДДС");
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеВКассу" Тогда	
			Реквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
			Реквизиты.Добавить("СубконтоКт2");
			Реквизиты.Добавить("СубконтоКт3");

		КонецЕсли;	
		
		Если ИмяДокумента = "РасходИзКассы" Тогда	
			Реквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
			Реквизиты.Добавить("СубконтоДт2");
			Реквизиты.Добавить("СубконтоДт3");
		КонецЕсли;	
		
		Если ИмяДокумента = "КорректировкаВзаиморасчетов" Тогда	
			
			Реквизиты.Добавить("Субкотно2");
			Реквизиты.Добавить("Субкотно3");
			Реквизиты.Добавить("Документы.СубконтоДт2");			
			Реквизиты.Добавить("Документы.СубконтоДт3");
			Реквизиты.Добавить("Документы.СубконтоКт2");
			Реквизиты.Добавить("Документы.СубконтоКт3");
			
		КонецЕсли;		
		
	КонецЕсли;		
	
	Если ТипРеквизита = "Справочник.СтатьиДоходовРасходов" Тогда
		
		Если ИмяДокумента = "ПоступлениеТоваровУслуг" Тогда	
			Реквизиты.Добавить("СтатьяЗатрат");
			Реквизиты.Добавить("Услуги.Субконто2");
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеДопРасходов" Тогда	
			
		КонецЕсли;
		
		Если ИмяДокумента = "РасходИзБанка" Тогда	
			Реквизиты.Добавить("СубконтоДт2");
			Реквизиты.Добавить("СубконтоДт3");
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеВБанк" Тогда	
			Реквизиты.Добавить("СубконтоКт2");
			Реквизиты.Добавить("СубконтоКт3");
		КонецЕсли;	
		
		Если ИмяДокумента = "ЗаявкаНаУслугиМатериалы" Тогда	
			
		КонецЕсли;	
		
		Если ИмяДокумента = "ПоступлениеВКассу" Тогда	
			Реквизиты.Добавить("СубконтоКт2");
			Реквизиты.Добавить("СубконтоКт3");
		КонецЕсли;	
		
		Если ИмяДокумента = "РасходИзКассы" Тогда	
			Реквизиты.Добавить("СубконтоДт2");
			Реквизиты.Добавить("СубконтоДт3");
		КонецЕсли;	
		
		Если ИмяДокумента = "КорректировкаВзаиморасчетов" Тогда	
			Реквизиты.Добавить("КорСтатьяДР");
			Реквизиты.Добавить("Документы.СтатьяДР");;
			Реквизиты.Добавить("Субкотно2");
			Реквизиты.Добавить("Субкотно3");
			Реквизиты.Добавить("Документы.СубконтоДт2");			
			Реквизиты.Добавить("Документы.СубконтоДт3");
			Реквизиты.Добавить("Документы.СубконтоКт2");
			Реквизиты.Добавить("Документы.СубконтоКт3");

		КонецЕсли;	
				
	КонецЕсли;	
	
	Возврат Реквизиты;
	
КонецФункции	



Процедура ДополнитьЗапросРеквизиты(ИмяДокумента,ТекстЗапроса,ЭтоПервый,ТипРеквизита)
	
	Реквизиты = ЗаполнитьМассивРеквизитов(ИмяДокумента,ТипРеквизита);
	
	Для Каждого реквизит из Реквизиты Цикл
		
		Если не ЭтоПервый Тогда
			ТекстЗапроса = ТекстЗапроса + " ИЛИ";
		КонецЕсли;			
		ТекстЗапроса = ТекстЗапроса + " Выразить(" + ИмяДокумента + "." + реквизит + " КАК "+ ТипРеквизита+").ПометкаУдаления";		
		ЭтоПервый= Ложь;
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуДокументов();
	Объект.ДатаНачала    = НачалоМесяца(ТекущаяДата());
	Объект.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	
КонецПроцедуры


Процедура ДобавитьСтроку(ИмяДокумента)
	
	НоваяСтрока=ТаблицаТиповДокументов.Добавить();
	НоваяСтрока.Флаг=Истина;
	НоваяСтрока.ИмяДокумента = ИмяДокумента;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	ТекущаяСтрока = Элементы.Документы.ТекущиеДанные;
	Если  ТекущаяСтрока <> Неопределено Тогда 
		ОткрытьЗначение(ТекущаяСтрока.документ);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьЗамену(Команда)
	
	ВыбратьЗаменуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаменуНаКлиенте()
	
	ТекущаяСтрока = Элементы.Документы.ТекущиеДанные;
	Если  ТекущаяСтрока <> Неопределено Тогда
		
		Значение = ТекущаяСтрока.ЗначениеРеквизита;
		ТипРеквизита = типЗнч(Значение); 
		
		Если ТипРеквизита = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
		
			ФормаВыбора = ПолучитьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаВыбора");
		    
		ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.СтатьиДоходовРасходов") Тогда	
			
			ФормаВыбора = ПолучитьФорму("Справочник.СтатьиДоходовРасходов.ФормаВыбора");;
			
		КонецЕсли;
			
		результат = ФормаВыбора.ОткрытьМодально();	
		
		
		Если результат <> Неопределено Тогда
			ПроверкаПометка =  ПроверкаПометка(результат);
			Если НЕ ПроверкаПометка Тогда
				Для каждого Строка из Объект.Документы Цикл
					
					Если Строка.ЗначениеРеквизита = Значение Тогда
						Строка.Заменить = результат;
					КонецЕсли;	
							
				КонецЦикла;	
			Иначе 
				Сообщить("Нельзя выбирать элемент, помеченный на удаление");
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПроверкаПометка(ЭлементСправочника)
	Возврат ЭлементСправочника.ПометкаУдаления;	
КонецФункции	

&НаСервере
Процедура ЗаменитьНаСервере()
	
	ТаблицаДокументов = Объект.Документы.Выгрузить();
	ТаблицаДокументов.Колонки.Добавить("Заполнен");
	
	Для каждого строка из ТаблицаДокументов Цикл
		
		Если ЗначениеЗаполнено(строка.Заменить) Тогда
			строка.Заполнен = Истина;
		КонецЕсли;	
			
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Заполнен",Истина);
	
	ДокументыЗамена = ТаблицаДокументов.Скопировать(Отбор);
	
	ДокументыБезПовторов = ДокументыЗамена.Скопировать(,"Документ");
	ДокументыБезПовторов.Свернуть("Документ");
		
	Для Каждого документ из ДокументыБезПовторов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Документ",документ.Документ);
		
		РеквизитыДляЗамены = ДокументыЗамена.НайтиСтроки(Отбор);
		
		ДокументОбъект = документ.Документ.ПолучитьОбъект();
		
		Для каждого Строка из РеквизитыДляЗамены Цикл
		
			МассивРазложения = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка.ИмяРеквизита,".");
			
			Если МассивРазложения.Количество() = 1 Тогда
				ДокументОбъект[Строка.ИмяРеквизита]=Строка.Заменить;						
			КонецЕсли;	
			
			Если МассивРазложения.Количество() = 2 Тогда
				Для каждого СтрокаТЧ из ДокументОбъект[МассивРазложения[0]] Цикл		
					Если СтрокаТЧ[МассивРазложения[1]] =Строка.ЗначениеРеквизита тогда 	
					
						СтрокаТЧ[МассивРазложения[1]]= Строка.Заменить;
						
					КонецЕсли;
				 КонецЦикла;	
			КонецЕсли;	
			
		КонецЦикла;	
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Перепроведен документ: "+ ДокументОбъект.Ссылка);
		
	КонецЦикла;	
	
	ЗаполнитьНаСервере();	
	
КонецПроцедуры


&НаКлиенте
Процедура Заменить(Команда)
	
	РезультатВопроса = Новый ОписаниеОповещения("РезультатВопроса",ЭтаФорма);
	ПоказатьВопрос(РезультатВопроса,"Документы с выбранной заменой будут перепроведены, продолжить?",РежимДиалогаВопрос.ДаНет);		
	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВопроса(Результат,Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда		
		ЗаменитьНаСервере();						
	КонецЕсли;	
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ДокументыЗначениеРеквизитаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыЗаменитьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыбратьЗаменуНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьЗаменуНаКлиенте();
КонецПроцедуры

