
Функция ПроверитьНаВхождениеВХолдинг()
	
	Перем Запрос, РезультатЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийКонтрагент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрКонтрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК СпрКонтрагенты
	|ГДЕ
	|	СпрКонтрагенты.ГоловнойКонтрагент = &ТекущийКонтрагент
	|	И НЕ СпрКонтрагенты.Ссылка = &ТекущийКонтрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции	

Процедура ПроверитьХарактеристикиНоменклатур(Отказ)
	
	Если ЭтотОбъект.ГоловнойКонтрагент.Пустая() Тогда // нет холдинга
		Возврат;
	КонецЕсли;
	
	мСвойствоПроизводитель = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000001");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СвойствоПроизводитель"	, мСвойствоПроизводитель);
	Запрос.УстановитьПараметр("ТекПроизводитель"		, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Холдинг"					, ЭтотОбъект.ГоловнойКонтрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(ЗначенияСвойствОбъектов.Объект) КАК Кол
	|ПОМЕСТИТЬ ВТОсновная
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоПроизводитель
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК Справочник.Контрагенты).ГоловнойКонтрагент = &Холдинг
	|	И НЕ (ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК Справочник.Контрагенты)) = &ТекПроизводитель
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).СтатусАктивностиХарактеристики В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Новая), ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Активна))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).Владелец,
	|	КОЛИЧЕСТВО(ЗначенияСвойствОбъектов.Объект)
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоПроизводитель
	|	И (ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК Справочник.Контрагенты)) = &ТекПроизводитель
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).СтатусАктивностиХарактеристики В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Новая), ЗНАЧЕНИЕ(Перечисление.СтатусыАктивностиХарактеристик.Активна))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновная.Номенклатура,
	|	СУММА(ВТОсновная.Кол) КАК Кол
	|ИЗ
	|	ВТОсновная КАК ВТОсновная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОсновная.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТОсновная.Кол) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновная";
	    
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("Для номенклатуры """ + Выборка.Номенклатура + """ более одной характеристики с производителем, входящим в холдинг """ + ЭтотОбъект.ГоловнойКонтрагент + """!");
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры
	


Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ОсновноеКонтактноеЛицо 		= Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка();
	ЭтотОбъект.ОсновнойБанковскийСчет 		= Справочники.БанковскиеСчета.ПустаяСсылка();
	ЭтотОбъект.ОсновнойДоговорКонтрагента 	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ЭтотОбъект.ОсновнойМенеджерПокупателя	= Справочники.Пользователи.ПустаяСсылка();
	ЭтотОбъект.ОсновнойБухгалтерПокупателя	= Справочники.Пользователи.ПустаяСсылка();
	ЭтотОбъект.ИНН 			= "";
	ЭтотОбъект.КПП 			= "";
	ЭтотОбъект.ИД 			= 0;
	ЭтотОбъект.КодПоОКПО 	= "";
	
	НеАрхивироватьАвтоматически = Ложь;
	ВАрхиве = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	//+++АК MIND 2017.11.21 если обмен данными, то отключаем вообще все проверки, такой режим ставится всегда осознано и принудительно
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//+++АК LAGP 2017.12.04 ИП-00017389 Открываем всем пользователям доступ до части контактной информации, а значит и запись объекта становится возможной
	////+++ak ziga ИП-00015987 2017111201
	//
	Аренда=ЯвляетсяАрендодателем;	
	//НаименованиеДопПрава="Полный доступ к договорам аренды";	
	МассивПраваАренда=УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ПолныйДоступКДоговорамАренды,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ПравоАренда=МассивПраваАренда[0];
	//НаименованиеДопПрава="Полный доступ к договорам, кроме аренды";	
	МассивПраваНеАренда=УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ПолныйДоступКДоговорамКромеАренды,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ПравоНеАренда=МассивПраваНеАренда[0];
	//
	//Если не РольДоступна("ПолныеПрава") Тогда
	//	Если Аренда Тогда
	//		Если Не ПравоАренда Тогда
	//			Сообщить("Нет прав на изменение контрагентов с договором типа Аренда");
	//		КонецЕсли;
	//		Отказ=Не ПравоАренда;
	//	Иначе
	//		Если Не ПравоНеАренда Тогда 
	//			Сообщить("Нет прав на изменение контрагентов с договором типа не Аренда");
	//		КонецЕсли;
	//		Отказ=Не ПравоНеАренда;
	//	КонецЕсли;
	//	Если Не РольДоступна("УчетДоговоров") Тогда
	//		Если Не ПравоАренда и (Не ПравоНеАренда) Тогда
	//			//ЭтаФорма.ТолькоПросмотр=Истина;
	//			Отказ=Истина;
	//			Сообщить("Нет доп прав на изменение контрагентов");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	////---ak ziga ИП-00015987 2017111201
	
	//+++АК LAGP 2017.12.15 ИП-00017434.02
	МассивДопПравоФункцРолиХолдинг=УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьРедактироватьПоля_ФункциональныеРоли_Холдинг_ИНН999,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ДопПравоФункцРолиХолдинг=МассивДопПравоФункцРолиХолдинг[0];  

	Если НЕ (СтрДлина(ЭтотОбъект.ИНН) > 3 И Лев(ЭтотОбъект.ИНН,3) = "999" И ДопПравоФункцРолиХолдинг) Тогда
 	//---АК LAGP 2017.12.15
	
		Если ЭтоНовый() И НЕ ЭтоГруппа И НЕ РольДоступна("ПолныеПрава") Тогда
			Если РольДоступна("УчетДоговоров") Тогда	
				Если Аренда И НЕ ПравоАренда Тогда
					Сообщить("Нет доп.прав на создание контрагентов типа Аренда");
					Отказ = Истина;
				ИначеЕсли НЕ Аренда И НЕ ПравоНеАренда Тогда
					Сообщить("Нет доп.прав на создание контрагентов типа не Аренда");
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Сообщить("Нет роли на создание контрагентов.");
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	//---АК LAGP 2017.12.04

	//+++АК VERN 2016.07.26 12873 
	Если ОбменДанными.Загрузка тогда
		возврат;
	КонецЕсли;
	//---АК VERN
	
	//mind 2017-03-26
	Если НЕ ЭтоГруппа
		И ВАрхиве Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.ЭтоГруппа
			И НЕ ЗначениеЗаполнено(ЭтотОбъект.ИД) Тогда
		ЭтотОбъект.ИД = ОбщегоНазначенияСервер.ПолучитьНовыйУникальныйИдентификатор("Контрагенты", "ИД");
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		СсылкаОбъект = ЭтотОбъект.ПолучитьСсылкуНового();
		Если НЕ ЗначениеЗаполнено(СсылкаОбъект) Тогда
			СсылкаОбъект = Справочники.Контрагенты.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаОбъект);
		КонецЕсли;
	Иначе
		СсылкаОбъект = ЭтотОбъект.Ссылка;
		Если НЕ ЭтотОбъект.ЭтоГруппа
				И НЕ ЭтотОбъект.ГоловнойКонтрагент.Пустая()
				И НЕ ЭтотОбъект.ГоловнойКонтрагент = СсылкаОбъект
				И ПроверитьНаВхождениеВХолдинг()
				И НЕ ЭтотОбъект.ОбменДанными.Загрузка Тогда
			Сообщить("Контрагент является холдингом для других контрагентов и не может входить в холдинг");
			Отказ = Истина;
		КонецЕсли;
		Если ИНН<>Ссылка.ИНН и СокрЛП(Ссылка.ИНН)<>"" Тогда//ИНН изменился
			Спис=Новый Массив;
			Спис.Добавить(Ссылка);
			УстановитьПривилегированныйРежим(истина);
			Нашли=НайтиПоСсылкам(Спис);
			Для каждого Эл из Нашли Цикл
				Если Метаданные.Документы.Содержит(Эл.Метаданные) Тогда
					Если Эл.Данные.Проведен Тогда
						Сообщить("Существуют проведенные документы по этому контрагенту! Изменение ключевых реквизитов недопустимо!",СтатусСообщения.Важное);
						Если не РольДоступна("ПолныеПрава") Тогда
							Отказ = Истина;
						КонецЕсли;
						прервать;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		Если НЕ ЭтотОбъект.ГоловнойКонтрагент.ГоловнойКонтрагент.Пустая()
				И НЕ ЭтотОбъект.ГоловнойКонтрагент.ГоловнойКонтрагент = ЭтотОбъект.ГоловнойКонтрагент
				И НЕ ЭтотОбъект.ОбменДанными.Загрузка Тогда
			Сообщить("Головной контрагент входит в холдинг и не может являться головным");
			Отказ = Истина;
		КонецЕсли;
		
		ПроверитьХарактеристикиНоменклатур(Отказ);
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Производитель) Тогда
			ЭтотОбъект.Производитель = СсылкаОбъект;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Поставщик) Тогда
			ЭтотОбъект.Поставщик = СсылкаОбъект;
		КонецЕсли;
	
	КонецЕсли;
	
	//ОбщегоНазначения.ПроверитьКонтрагентаПередЗаписью(ЭтотОбъект,Отказ); //+++АК LAGP 2017.12.04 ИП-00017336 Утратило актуальность
	
	//+++АК SHEP 20170309 ИП-00014350
	//Если НЕ Отказ Тогда
	//	Если НЕ ПустаяСтрока(ИНН) И Найти(ИНН, "9999999999") = 0 И (ЭтотОбъект.ЭтоНовый() ИЛИ ПустаяСтрока(Ссылка.ИНН)) Тогда
	//		
	//		МинимальнаяДлинаПароля = Макс(8, ПолучитьМинимальнуюДлинуПаролейПользователей());
	//	    ПараметрыПароля = ПользователиПолныеПрава.ПараметрыПароля(МинимальнаяДлинаПароля, Истина);
	//	    НовыйПароль = ПользователиПолныеПрава.СоздатьПароль(ПараметрыПароля);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//---АК SHEP 20170309
	
	//++++ АК AZAP 24.03.2017 ИП-00015381
	//Отбор = Новый Структура;
	//Отбор.Вставить("Контрагент", ЭтотОбъект.Ссылка);
	// ОснДоговор = РегистрыСведений.ОсновныеДоговораКонтрагентов.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	////если это основной договор и ставка ндс не равна ставке контрагента
	//Если ЗначениеЗаполнено(ОснДоговор.ДоговорКонтрагента) И ЭтотОбъект.СтавкаНДС <> ОснДоговор.ДоговорКонтрагента.СтавкаНДС Тогда
	//	ЭтотОбъект.СтавкаНДС = ОснДоговор.ДоговорКонтрагента.СтавкаНДС;
	//КонецЕсли;
	//---- АК AZAP
	//++++ АК БЕЛН 19.07.2017
	ДополнительныеСвойства.Вставить("НовыйЭлемент",ЭтоНовый() И Не ЭтоГруппа);
	Если Не ЭтоНовый() И НЕ ЭтоГруппа Тогда
		Поставщик=Справочники.ПоставщикиАналогов.НайтиПоРеквизиту("Контрагент",Ссылка);
		Если ЗначениеЗаполнено(Поставщик) И Поставщик.Наименование<>Наименование Тогда
			ОбСпр=Поставщик.ПолучитьОбъект();
			ОбСпр.Наименование=Наименование;
			ОбСпр.Записать();
		КонецЕсли; 
	КонецЕсли; 
	//---- АК БЕЛН 19.07.2017
	
	
	//++ АК LUZA 13.02.2018 ИП-00017717 
	//Запись автора и даты комментария по ЭДО при изменении
	Если ЭтоНовый() = Ложь Тогда
		Если ЭтотОбъект.КомментарийЭДО <> ЭтотОбъект.Ссылка.КомментарийЭДО Тогда
			ЭтотОбъект.КомментарийЭДОАвтор = ПараметрыСеанса.ТекущийПользователь;
			ЭтотОбъект.КомментарийЭДОДата = ТекущаяДата();
		КонецЕсли;	
		
		Если ЭтотОбъект.ЭДО <> ЭтотОБъект.Ссылка.ЭДО Тогда
			Если ЭтотОбъект.ЭДО = Истина Тогда
				ЭтотОбъект.ДатаПодключенияКЭДО = ТекущаяДата();
			Иначе
				ЭтотОбъект.ДатаПодключенияКЭДО = Дата(1,1,1);				
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект.КомментарийЭДО) = Истина Тогда
			ЭтотОбъект.КомментарийЭДОАвтор = ПараметрыСеанса.ТекущийПользователь;
			ЭтотОбъект.КомментарийЭДОДата = ТекущаяДата();
		КонецЕсли;	
		
		Если ЭтотОбъект.ЭДО = Истина Тогда
			ЭтотОбъект.ДатаПодключенияКЭДО = ТекущаяДата();			
		КонецЕсли;	
	КонецЕсли;	
	//++ АК LUZA 13.02.2018 ИП-00017717 	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтотОбъект.ИНН="9999999999" И (ЭтотОбъект.ГоловнойКонтрагент=ЭтотОбъект.Ссылка Или ЭтотОбъект.ГоловнойКонтрагент=Справочники.Контрагенты.ПустаяСсылка()) Тогда
		Отказ = Истина;
		Сообщить("Если ИНН=9999999999, то должен быть заполнен головной контрагент")
	КонецЕсли;
КонецПроцедуры
//++++ АК БЕЛН 19.07.2017
Процедура ПриЗаписи(Отказ)
	//+++АК MIND 2017.11.21 если обмен данными, то отключаем вообще все проверки, такой режим ставится всегда осознано и принудительно
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НовыйЭлемент") Тогда
		Если ДополнительныеСвойства.НовыйЭлемент И Ссылка.ПринадлежитЭлементу(Справочники.Контрагенты.НайтиПоКоду("000000452")) И НЕ ЭтоГруппа Тогда
			ОбСпр=Справочники.ПоставщикиАналогов.СоздатьЭлемент();
			ОбСпр.Наименование=Наименование;
			ОбСпр.Контрагент=Ссылка;
			ОбСпр.Записать();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
//----АК БЕЛН 19.07.2017
