
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода) Тогда
	//	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода")).ИдентификаторПользовательскойНастройки;
	//	//ЗначениеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение;
	//	//Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
	//	КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение = ЭтотОбъект.НачалоПериода;
	//	//КонецЕсли;
	//КонецЕсли; 
	//
	//Если ЗначениеЗаполнено(ЭтотОбъект.КонецПериода) Тогда
	//	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).ИдентификаторПользовательскойНастройки;
	//	//ЗначениеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение;
	//	//Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
	//	КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение = ЭтотОбъект.КонецПериода;
	//	//КонецЕсли;
	//КонецЕсли; 

	//Если НЕ ЭтотОбъект.ТорговаяТочка.Пустая() Тогда
	//	ПолеКомпоновкиТТ = Новый ПолеКомпоновкиДанных("ТТ");
	//	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиТТ Тогда
	//			ЭлементНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	//			//Если НЕ ЗначениеЗаполнено(ЭлементНастройки.ПравоеЗначение) Тогда
	//				ЭлементНастройки.ПравоеЗначение = ЭтотОбъект.ТорговаяТочка;
	//				ЭлементНастройки.Использование 	= Истина;
	//			//КонецЕсли;
	//		КонецЕсли; 
	//	КонецЦикла;  
	//КонецЕсли; 

КонецПроцедуры
