
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КоллекцияПечатныхФорм, ПараметрыВывода;
	
	ЭкземпляровКомплекта = 1;
	ПечатьИзМаршрутногоЛиста = Параметры.ПечатьИзМаршрутногоЛиста;
	
	Если Не ПечатьИзМаршрутногоЛиста Тогда
		
		ИмяМенеджераПечати = Параметры.СписокПараметров.Получить(0).Значение;
		ИменаМакетов       = Параметры.СписокПараметров.Получить(1).Значение;
		ПараметрКоманды    = Параметры.СписокПараметров.Получить(2).Значение;
		ПараметрыПечати    = Параметры.СписокПараметров.Получить(3).Значение;
		
		ПараметрыВывода = Неопределено;
		УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати, 
		КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
		ДоступнаПечатьПоКомплектно = ПараметрыВывода.ДоступнаПечатьПоКомплектно;
		
	Иначе
		
		КоллекцияПечатныхФорм = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
		ОбъектыПечатиПакетнаяПечатьПорядок = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилищеСпискаПоПорядку);
		ТаблицаОтправленныхСертификатов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыСертификатов));
		ДоступнаПечатьПоКомплектно = Ложь;
		
	КонецЕсли;	
		
	НеРазрешеноРедактированиеТаблиц = УправлениеДопПравамиПользователей.ЗащитаТаблиц();
	
	Колво = КоллекцияПечатныхФорм.Количество();
	Для Сч = 1 По 5 Цикл
		Если Сч > Колво Тогда
			ЭтаФорма["Таб" + Сч] = Неопределено;
			Элементы["Группа" + Сч].Видимость = Ложь;
			Элементы["Копии"  + Сч].Видимость = Ложь;
			
		Иначе
			СтрМакета = КоллекцияПечатныхФорм[Сч-1];  	
			
			Если СтрМакета.СинонимМакета = "Сертификаты" Тогда
				Если ЗначениеЗаполнено(СтрМакета.ТекстHTML) Тогда
					ЭтаФорма.HTML = СтрМакета.ТекстHTML;
					Элементы.ГруппаHTML.Видимость = Истина;
					Элементы.ГруппаHTML.Заголовок = "Сертификаты";
					Элементы["Группа" + Сч].Видимость = Ложь;			
					Продолжить;
				Иначе
					Элементы["Группа" + Сч].Видимость = Ложь;			
					Продолжить; 	
				КонецЕсли;
			Иначе
				ЭтаФорма["Таб" + Сч] = СтрМакета.ТабличныйДокумент;	
			КонецЕсли;
			Элементы["Таб" + Сч].Защита = НеРазрешеноРедактированиеТаблиц;
			Элементы["Группа" + Сч].Видимость = Истина;
			Элементы["Группа" + Сч].Заголовок = СтрМакета.СинонимМакета;
			Элементы["Копии"  + Сч].Видимость = Истина;
			Элементы["Копии"  + Сч].Заголовок = СтрМакета.СинонимМакета;
			
			ЭтаФорма["Копии" + Сч] = СтрМакета.Экземпляров;
			
			ИменаТабДокументов.Добавить(Сч, СтрМакета.СинонимМакета);
			
		КонецЕсли;
	КонецЦикла;
	
	Если Колво = 1 Тогда
		Элементы.ГруппаКопии.Видимость = Ложь;
		Элементы.Копии.Видимость = Истина;
		Копии = КоллекцияПечатныхФорм[0].Экземпляров;
	Иначе
		Элементы.Копии.Видимость = Ложь;
		Элементы.ГруппаКопии.Видимость = Истина;
	КонецЕсли;

	
	// Видимость кнопок
	Элементы.Перейти.Видимость = ДоступнаПечатьПоКомплектно И (ТипЗнч(ПараметрКоманды) = Тип("Массив")) И (ПараметрКоманды.Количество() > 1);
	
	Если Колво <= 1 Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	Если ТекущийРежимЗапуска() <> РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение 
		И Элементы.Найти("ОтправитьПоПочте") <> Неопределено Тогда
		
		Элементы.ОтправитьПоПочте.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПечатьВыполнить()
	
    ТабличныеДокументы = Новый СписокЗначений;
	
	// Подменим печатки для печати из маршрутного листа
	Если ПечатьИзМаршрутногоЛиста Тогда
		МассивУдаленияСтрок = Новый Массив;
		Для Каждого Строка Из ОбъектыПечатиПакетнаяПечатьПорядок Цикл
			Если Строка.Представление = "Сертификаты" Тогда
				МассивУдаленияСтрок.Добавить(Строка);
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлМассива Из МассивУдаленияСтрок Цикл
			ОбъектыПечатиПакетнаяПечатьПорядок.Удалить(ЭлМассива);
		КонецЦикла;
		
		ТабличныеДокументы = ОбъектыПечатиПакетнаяПечатьПорядок;
		
	Иначе
		
		Для Каждого ТабДокумент Из ИменаТабДокументов Цикл
			ТабличныеДокументы.Добавить(ЭтаФорма["Таб" + ТабДокумент.Значение], ТабДокумент.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, ДоступнаПечатьПоКомплектно, ОбъектыПечати);

	Если Элементы.ГруппаHTML.Видимость Тогда
		
		//Элементы.ПолеHTML.Документ.ExecCommand("print");

		//ЗаписатьОтправленныеСертификатыСервер();
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КопииПриИзменении(Элемент)
	
	Копий = ЭтаФорма[Элемент.Имя];
	ИмяТабДока = "Таб" + ?(Элемент.Имя = "Копии", "1", Сред(Элемент.Имя, 6));
	ТабДок = ЭтаФорма[ИмяТабДока];
	ТабДок.КоличествоЭкземпляров = Копий;

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВыполнить()

	спсВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из ОбъектыПечати Цикл
		спсВыбора.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Элемент = спсВыбора.ВыбратьЭлемент("Перейти к");
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ОбъектыПечати.НайтиПоЗначению(Элемент.Значение);
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбласти = Элемент.Представление;
	Для Каждого ТабДокумент Из ИменаТабДокументов Цикл
		
		ИмяЭлемента = "Таб" + ТабДокумент.Значение;
		Таб = ЭтаФорма[ИмяЭлемента];
		Область = Таб.Области.Найти(ИмяОбласти);
		Если Область = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть = Таб.Область(Область.Верх, , Область.Верх);
		Элементы[ИмяЭлемента].ТекущаяОбласть = ТекущаяОбласть;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочтеВыполнить(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		УправлениеОтчетами.ОтправитьДокументПоЭлектроннойПочте(Таб1, Элементы.Группа1.Заголовок, ОбъектыПечати);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
		УдалитьФайлы(ИмяФайлаПечати);
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтправленныеСертификатыСервер()
	
	Если ТаблицаОтправленныхСертификатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОтправленныеСертификаты.СоздатьНаборЗаписей();
	НЗ.Прочитать();
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Для Каждого Строка Из ТаблицаОтправленныхСертификатов Цикл
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.ДатаОтправки  = ТекущаяДата(); 
		Запись.Ответственный = ТекущийПользователь;
	КонецЦикла;
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНовая(Команда)
	
	ТабличныеДокументы = Новый СписокЗначений;
	
	// Подменим печатки для печати из маршрутного листа
	Если ПечатьИзМаршрутногоЛиста Тогда
		
		ТабличныеДокументы = ОбъектыПечатиПакетнаяПечатьПорядок;
		
	Иначе
		
		Для Каждого ТабДокумент Из ИменаТабДокументов Цикл
			ТабличныеДокументы.Добавить(ЭтаФорма["Таб" + ТабДокумент.Значение], ТабДокумент.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, ДоступнаПечатьПоКомплектно, ОбъектыПечати);

	Если Элементы.ГруппаHTML.Видимость Тогда
		
		//Элементы.ПолеHTML.Документ.ExecCommand("print");

		ЗаписатьОтправленныеСертификатыСервер();
			
	КонецЕсли;	
	
КонецПроцедуры
