&НаКлиенте
Процедура ПриложенныеФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенныеФайлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.ПриложенныеФайлы.ТекущиеДанные.УинСтроки = Строка(Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаВКаталогеХранения(РасширениеФайла, УинСтроки)
	
	Возврат Константы.КаталогХраненияФайлов.Получить() + УинСтроки + РасширениеФайла;
	
КонецФункции	

&НаКлиенте
Процедура ПриложенныеФайлыФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОтключитьФильтр",Истина);
	//ПараметрыФормы = Новый Структура("Параметры",Новый Структура("ОтключитьФильтр",Истина));
	
	СтруктураВозврат = ОткрытьФормуМодально("Справочник.Номенклатура.Форма.ФормаВыбораФайлаКартинки",ПараметрыФормы);
	Если СтруктураВозврат <> Неопределено
		И СтруктураВозврат.БылВыборФайла Тогда
		ФайлКартинки = Новый Файл(СтруктураВозврат.ИмяФайла);
		Элементы.ПриложенныеФайлы.ТекущиеДанные.Файл = ФайлКартинки.ИмяБезРасширения;
		Элементы.ПриложенныеФайлы.ТекущиеДанные.Расширение = ФайлКартинки.Расширение;
		КопироватьФайл(ФайлКартинки.ПолноеИмя, ПолучитьИмяФайлаВКаталогеХранения(ФайлКартинки.Расширение, Элементы.ПриложенныеФайлы.ТекущиеДанные.УинСтроки));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСохраненияКартинки(УинСтроки, Расширение)
	
	Картинка = Новый Картинка(Константы.КаталогХраненияФайлов.Получить() + УинСтроки + Расширение);
	Возврат Новый Структура("АдресКартинки, Расширение", ПоместитьВоВременноеХранилище(Картинка), Расширение);
	
КонецФункции

&НаКлиенте
Процедура Просмотреть(Команда)
	
	Если Элементы.ПриложенныеФайлы.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ПриложенныеФайлы.ДанныеСтроки(Элементы.ПриложенныеФайлы.ТекущаяСтрока);
	
	СтруктураКартинки = ПолучитьРеквизитыСохраненияКартинки(ДанныеСтроки.УинСтроки, ДанныеСтроки.Расширение);
	ИмяФайла = ПолучитьИмяВременногоФайла(СтруктураКартинки.Расширение);
	Если ПолучитьФайл(СтруктураКартинки.АдресКартинки, ИмяФайла, Ложь) = Истина Тогда
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	Если Элементы.ПриложенныеФайлы.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ПриложенныеФайлы.ДанныеСтроки(Элементы.ПриложенныеФайлы.ТекущаяСтрока);
	
	СтруктураКартинки = ПолучитьРеквизитыСохраненияКартинки(ДанныеСтроки.УинСтроки, ДанныеСтроки.Расширение);
	ИмяФайла = ПолучитьИмяВременногоФайла(СтруктураКартинки.Расширение);
	ПолучитьФайл(СтруктураКартинки.АдресКартинки, ИмяФайла, Истина);
	
КонецПроцедуры
