&НаКлиенте
Процедура ВвестиШтрихКод(Команда)
	ШтрихКод = ОткрытьФормуМодально("ОбщаяФорма.ФормаВводаШтрихкода");
	Если ЗначениеЗаполнено(ШтрихКод) Тогда
		СсылкаНаДок = ВнешниеДанные.ПолучитьДокументПоШтрихКоду(ШтрихКод);
		Если СсылкаНаДок<>неопределено Тогда
			ОткрытьЗначение(СсылкаНаДок);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "KeyboardHook" Тогда
		Если Данные = "00122" Тогда
			ШтрихКодОбработанФормой = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
