
&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ОткрытьФорму("РегистрСведений.ДолиРезервовВФОТ.Форма.ФормаИмпортаДанныхИзЗУП",,ЭтаФорма);
	ЗаполнитьДанныеСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСервер()
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьРегистрСервер(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрСервер(ТЗ)
	//ТЗОтборов=ТЗ.Выгрузить();
	//ТЗОтборов.Свернуть("Период,Организация");
	ТЗ.Сортировать("Период,Организация");
	Период="";
	Организация="";
	Набор=РегистрыСведений.ДолиРезервовВФОТ.СоздатьНаборЗаписей();
	Для Каждого Стр Из ТЗ Цикл
		Если Стр.Период<>Период ИЛИ Стр.Организация<>Организация Тогда
			Если Период <> "" И Организация <>"" Тогда
				Если Набор.Количество()>0 Тогда
					Набор.Записать();
				КонецЕсли;	
			КонецЕсли;	
			Период=Стр.Период;
			Организация=Стр.Организация;
			Набор.Отбор.Период.Установить(Стр.Период);
			Набор.Отбор.Организация.Установить(Стр.Организация);
			Набор.Прочитать();
			Набор.Очистить();
		КонецЕсли;	
		НД=Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НД,Стр);
	КонецЦикла;	
	Если Набор.Количество()>0 Тогда
		Набор.Записать();
	КонецЕсли;	
КонецПроцедуры	
