
Функция ПечатьТовары(ПараметрКоманды)
	
	Возврат Документы.АктПеревозчика.ПечатьРасходныйОрдер_Товары(ПараметрКоманды);
	
КонецФункции

Функция ПечатьОборудование(ПараметрКоманды)
	
	Возврат Документы.АктПеревозчика.ПечатьРасходныйОрдер_Оборудование(ПараметрКоманды);
	
КонецФункции

Функция ПроверитьСервер(ПараметрКоманды)
	
	Возврат (ПараметрКоманды.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ДоставкаНаСклад);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПроверитьСервер(ПараметрКоманды) Тогда
		Сообщить("Печать расходных ордеров не предусмотрена для вида операции ""Доставка на склад""!");
		Возврат;
	КонецЕсли;
	
	// для товаров
	ТабДокумент = ПечатьТовары(ПараметрКоманды);

	Если НЕ ТабДокумент = Неопределено Тогда
		ОповеститьОбИзменении(ПараметрКоманды);
	
		ТабДокумент.Показать("Печать расходных ордеров");
	КонецЕсли;
	
	// для оборудования
	ТабДокумент = ПечатьОборудование(ПараметрКоманды);

	Если НЕ ТабДокумент = Неопределено Тогда
		ОповеститьОбИзменении(ПараметрКоманды);
	
		ТабДокумент.Показать("Печать расходных ордеров");
	КонецЕсли;
	
КонецПроцедуры
