
//+++АК Susk (Суслин К.В.) 2018.12.03 ИП-00020496
Процедура ВыполнитьВыгрузкуМодульОбъекта(ПараметрОрганизация) Экспорт
	
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию("Выгрузка упаковки в бухгалтерию");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);	
		
	Обр = ОбменСБП2_0.ИнициализироватьОбработкуОбмена();
	Обр.ДатаНачала = ДатаНачала;
	Обр.ДатаОкончания = ДатаОкончания;
	Обр.Параметры.Вставить("Организация", ПараметрОрганизация);
			
	СтрокиДереваПравилВыгрузки = Обр.ТаблицаПравилВыгрузки.Строки;
	
	Для Каждого СтрокаДерева из СтрокиДереваПравилВыгрузки Цикл
		Если СтрокаДерева.Имя = "Документы"	Тогда
			СтрокаДерева.Включить = 1;
			ПравилаВсе = СтрокаДерева.Строки;
		Иначе
			СтрокаДерева.Включить = 0;
		КонецЕсли;
	КонецЦикла;
	
	// документы	
	Для каждого Правило Из ПравилаВсе Цикл
		ИмяПравила = Правило.Имя;
		Если ИмяПравила = "ТребованиеНакладнаяИзПоступленияТоваровУслуг" И ВыгружатьТребованиеНакладнаяИзПоступленияТоваровУслуг Тогда
			Правило.Включить = 1;		
		ИначеЕсли ИмяПравила = "ИнвентаризацияСкладСторонниеПереработчики" И СозданиеИнвентаризацииЭтикеткиУпаковки Тогда
			Правило.Включить = 1;
		Иначе	
			Правило.Включить = 0;
		КонецЕсли;	
	КонецЦикла;	
	
	Обр.ВыполнитьВыгрузку();
		
	Описание = "Выгрузка упаковки ""Выгрузка ТН из ПТУ"" по организации " + Строка(ПараметрОрганизация) + 
		". Выгрузка ТН из ПТУ: " + Строка(ВыгружатьТребованиеНакладнаяИзПоступленияТоваровУслуг) + 
		". Создание инвентаризации: " + Строка(СозданиеИнвентаризацииЭтикеткиУпаковки);
	
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, Описание);
	
КонецПроцедуры