
&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	ЗаполнитьТЧСделкиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСделкиСервер()
	Объект.ГрафикОплат.Очистить();
	Для каждого Стр Из Объект.Сделка.ГрафикОплат Цикл
		
		НС = Объект.ГрафикОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		Если НС.Количество<>0 И НС.Цена <>0 Тогда
			НС.ПроцентЭтапа = НС.СуммаОплаты/НС.Цена/НС.Количество*100;
		КонецЕсли; 	
	КонецЦикла; 
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПредпоступлениеПоКомплектацииТовары.Ссылка КАК Предпоступление
	|ИЗ
	|	Документ.ПредпоступлениеПоКомплектации.Товары КАК ПредпоступлениеПоКомплектацииТовары
	|ГДЕ
	|	ПредпоступлениеПоКомплектацииТовары.Сделка = &Сделка
	|	И ПредпоступлениеПоКомплектацииТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредпоступлениеПоКомплектацииТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеСредствТорговыеТочки.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеСредств.ТорговыеТочки КАК ЗаявкаНаРасходованиеСредствТорговыеТочки
	|ГДЕ
	|	ЗаявкаНаРасходованиеСредствТорговыеТочки.Сделка = &Сделка
	|	И ЗаявкаНаРасходованиеСредствТорговыеТочки.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеСредствТорговыеТочки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОборудование.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугОборудование.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Сделка = &Сделка
	|	И ПоступлениеТоваровУслугОборудование.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ПоступлениеТоваровУслугОборудование.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка,
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеДопРасходов.НоменклатураДопОборудование КАК ПоступлениеДопРасходовНоменклатураДопОборудование
	|ГДЕ
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Сделка = &Сделка
	|	И ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка,
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка КАК Платёжка
	|ИЗ
	|	Документ.РасходИзБанка.СтруктурныеЕдиницы КАК РасходИзБанкаСтруктурныеЕдиницы
	|ГДЕ
	|	РасходИзБанкаСтруктурныеЕдиницы.Сделка = &Сделка
	|	И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Сделка",Объект.Сделка);
	Результат = Запрос.ВыполнитьПакет();
	ТЗ = Результат[0].Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"Предпоступления");
	
	ТЗ = Результат[1].Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"Поступления");
	
	ТЗ = Результат[2].Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"Оплаты");
КонецПроцедуры	

&НаСервере
Процедура ГрафикОплатЦенаПриИзмененииНаСервере(ТД)
	
	ЭтапыПоСтроке = Объект.ГрафикОплат.НайтиСтроки(Новый Структура("УИН_ПервойСтроки",ТД.УИН_ПервойСтроки));
	Для каждого Этап  Из ЭтапыПоСтроке Цикл
		
		Этап.Цена = ТД.Цена;
		Этап.СуммаОплаты = Этап.Цена*Этап.Количество*Этап.ПроцентЭтапа/100;
		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОплатЦенаПриИзменении(Элемент)
	ТД = Элементы.ГрафикОплат.ТекущиеДанные;
	ГрафикОплатЦенаПриИзмененииНаСервере(Новый Структура("Цена,УИН_ПервойСтроки",ТД.Цена,ТД.УИН_ПервойСтроки));
КонецПроцедуры

&НаСервере
Процедура ОбработатьПредпоступленияНаСервере()
	Для каждого Стр Из Предпоступления Цикл
		
		Док = Стр.Предпоступление.ПолучитьОбъект();
		Для каждого СтрокаДока Из Док.Товары Цикл
			Если СтрокаДока.Сделка<>Объект.Сделка Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокиСделки = Объект.ГрафикОплат.НайтиСтроки(Новый Структура("УИН_Строки",СтрокаДока.УИН_СтрокиСделки));
			Если СтрокиСделки.Количество() = 0 Тогда
				
				Сообщить("В сделке нет строки "+СтрокаДока.УИН_СтрокиСделки);// возможно надо будет удалять
			Иначе
				СтрокаСделки = СтрокиСделки[0];
				СтрокаДока.Цена = СтрокаСделки.Цена;
				СтрокаДока.Сумма = СтрокаДока.Цена*СтрокаДока.Количество;
				СтрокаДока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаДока.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(СтрокаДока.СтавкаНДС));
				СтрокаДока.Номенклатура = СтрокаСделки.Номенклатура;
			КонецЕсли; 
			
		КонецЦикла; 
		//+++АК POZM 2017.11.22 ИП-00017139
		Если ПроводитьВЗакрытомПериоде Тогда
			Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
		КонецЕсли;	
		//---АК POZM 
		Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
		Сообщить("Обработан "+Док);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПредпоступления(Команда)
	ОбработатьПредпоступленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСделкуНаСервере()
	Док = Объект.Сделка.ПолучитьОбъект();
	Док.ГрафикОплат.Очистить();
	Для каждого Стр Из Объект.ГрафикОплат Цикл
		
		НС = Док.ГрафикОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла; 
	//+++АК POZM 2017.11.22 ИП-00017139
	Если ПроводитьВЗакрытомПериоде Тогда
		Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
	КонецЕсли;	
	//---АК POZM 
	Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСделку(Команда)
	ЗаписатьСделкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОплатыНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОплаты(Команда)
	ОбработатьОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОплатКоличествоПриИзменении(Элемент)
	ТД = Элементы.ГрафикОплат.ТекущиеДанные;
	ГрафикОплатКоличествоПриИзмененииНаСервере(Новый Структура("Цена,УИН_ПервойСтроки,Количество",ТД.Цена,ТД.УИН_ПервойСтроки,ТД.Количество));
КонецПроцедуры
&НаСервере
Процедура ГрафикОплатКоличествоПриИзмененииНаСервере(ТД)
	
	ЭтапыПоСтроке = Объект.ГрафикОплат.НайтиСтроки(Новый Структура("УИН_ПервойСтроки",ТД.УИН_ПервойСтроки));
	Для каждого Этап  Из ЭтапыПоСтроке Цикл
		
		Этап.Количество = ТД.Количество;
		
		Этап.СуммаОплаты = Этап.Цена*Этап.Количество*Этап.ПроцентЭтапа/100;
		
	КонецЦикла; 
КонецПроцедуры


&НаСервере
Процедура ГрафикОплатНоменклатураПриИзмененииНаСервере(ТД)
	ЭтапыПоСтроке = Объект.ГрафикОплат.НайтиСтроки(Новый Структура("УИН_ПервойСтроки",ТД.УИН_ПервойСтроки));
	Для каждого Этап  Из ЭтапыПоСтроке Цикл
		
		Этап.Номенклатура = ТД.Номенклатура;
		
		
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ГрафикОплатНоменклатураПриИзменении(Элемент)
	ТД = Элементы.ГрафикОплат.ТекущиеДанные;
	ГрафикОплатНоменклатураПриИзмененииНаСервере(Новый Структура("УИН_ПервойСтроки,Номенклатура",ТД.УИН_ПервойСтроки,ТД.Номенклатура));
КонецПроцедуры


&НаСервере
Процедура ПредпоступлениеПриИзмененииНаСервере()
	Объект.ТоварыПредпоступления.Очистить();
	Для каждого Стр Из Объект.Предпоступление.Товары Цикл
		
		НС = Объект.ТоварыПредпоступления.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		//Если НС.Количество<>0 И НС.Цена <>0 Тогда
		//    НС.ПроцентЭтапа = НС.СуммаОплаты/НС.Цена/НС.Количество*100;
		//КонецЕсли; 	
	КонецЦикла; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОборудование.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугОборудование.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Предпоступление = &Предпоступление
	|	И ПоступлениеТоваровУслугОборудование.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ПоступлениеТоваровУслугОборудование.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка,
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеДопРасходов.НоменклатураДопОборудование КАК ПоступлениеДопРасходовНоменклатураДопОборудование
	|ГДЕ
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Предпоступление = &Предпоступление
	|	И ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка,
	|	ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка КАК Платёжка
	|ИЗ
	|	Документ.РасходИзБанка.СтруктурныеЕдиницы КАК РасходИзБанкаСтруктурныеЕдиницы
	|ГДЕ
	|	РасходИзБанкаСтруктурныеЕдиницы.Комплектация = &Предпоступление
	|	И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	Документ.РасходИзБанка.СтруктурныеЕдиницы КАК РасходИзБанкаСтруктурныеЕдиницы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|		ПО РасходИзБанкаСтруктурныеЕдиницы.Комплектация = ПоступлениеТоваровУслугОборудование.Ссылка
	|ГДЕ
	|	РасходИзБанкаСтруктурныеЕдиницы.Комплектация ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен
	|	И ПоступлениеТоваровУслугОборудование.Предпоступление = &Предпоступление
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	Документ.РасходИзБанка.СтруктурныеЕдиницы КАК РасходИзБанкаСтруктурныеЕдиницы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов.НоменклатураДопОборудование КАК ПоступлениеДопРасходовНоменклатураДопОборудование
	|		ПО РасходИзБанкаСтруктурныеЕдиницы.Комплектация = ПоступлениеДопРасходовНоменклатураДопОборудование.Ссылка
	|ГДЕ
	|	РасходИзБанкаСтруктурныеЕдиницы.Комплектация ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен
	|	И ПоступлениеДопРасходовНоменклатураДопОборудование.Предпоступление = &Предпоступление
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Предпоступление",Объект.Предпоступление);
	Результат = Запрос.ВыполнитьПакет();
	
	ТЗ = Результат[0].Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"ПоступленияПоПредпоступлению");
	
	ТЗ = Результат[1].Выгрузить();
	ЗначениеВРеквизитФормы(ТЗ,"ОплатыПоПредпоступлению");
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПредпоступлениеПриИзменении(Элемент)
	ПредпоступлениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаписатьПредпоступлениеНаСервере()
	Док = Объект.Предпоступление.ПолучитьОбъект();
	Док.Товары.Очистить();
	Для каждого Стр Из Объект.ТоварыПредпоступления Цикл
		
		НС = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла;
	//+++АК POZM 2017.11.22 ИП-00017139
	Если ПроводитьВЗакрытомПериоде Тогда
		Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
	КонецЕсли;	
	//---АК POZM 
	Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьПредпоступление(Команда)
	ЗаписатьПредпоступлениеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПредпоступленияКоличествоПриИзменении(Элемент)
	ТД = Элементы.ТоварыПредпоступления.ТекущаяСтрока;
	ТоварыПредпоступленияКоличествоПриИзмененииНаСервере(ТД);
КонецПроцедуры

&НаСервере
Процедура ТоварыПредпоступленияКоличествоПриИзмененииНаСервере(ТекущаяСтрока)
	ТС = Объект.ТоварыПредпоступления.НайтиПоИдентификатору(ТекущаяСтрока);
	ТС.Сумма = ТС.Количество * ТС.Цена;
	ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
КонецПроцедуры	


&НаСервере
Процедура ОбработатьПоступленияПопредпоступлениюНаСервере()
	Для каждого СтрокаПоступления Из ПоступленияПоПредпоступлению Цикл
		
		Если СтрокаПоступления.Поступление.Проведен Тогда
			ДокПост = СтрокаПоступления.Поступление.ПолучитьОбъект();
			//+++АК POZM 2017.11.22 ИП-00017139
			Если ПроводитьВЗакрытомПериоде Тогда
				ДокПост.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
				
			КонецЕсли;	
			//---АК POZM 
			ДокПост.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Проведен "+ДокПост.Ссылка);
		КонецЕсли;	
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПоступленияПопредпоступлению(Команда)
	ОбработатьПоступленияПопредпоступлениюНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПредпоступленияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	
КонецПроцедуры


&НаСервере
Процедура ТоварыПредпоступленияНоменклатураПриИзмененииНаСервере(ТекСтрока)
	ТС = Объект.ТоварыПредпоступления.НайтиПоИдентификатору(ТекСтрока);
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(СделкаСПоставщикомГрафикОплат.СуммаОплаты) КАК СуммаОплаты,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена,
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка = &Ссылка
	|	И СделкаСПоставщикомГрафикОплат.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ТС.Сделка);
	Запрос.УстановитьПараметр("Номенклатура",ТС.Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТС.УИН_СтрокиСделки = Выборка.УИН_ПервойСтроки;
		ТС.Цена = Выборка.Цена;
		ТС.Сумма = ТС.Количество * ТС.Цена;
		ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПредпоступленияНоменклатураПриИзменении(Элемент)
	ТоварыПредпоступленияНоменклатураПриИзмененииНаСервере(Элементы.ТоварыПредпоступления.ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПредпоступленияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		Элементы.ТоварыПредпоступления.ТекущиеДанные.УИН_Строки="";
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура РасходИзБанкаПриИзмененииНаСервере()
	Объект.СтруктурныеЕдиницы.Очистить();
	Для каждого Стр Из Объект.РасходИзБанка.СтруктурныеЕдиницы Цикл
		
		НС = Объект.СтруктурныеЕдиницы.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		//Если НС.Количество<>0 И НС.Цена <>0 Тогда
		//    НС.ПроцентЭтапа = НС.СуммаОплаты/НС.Цена/НС.Количество*100;
		//КонецЕсли; 	
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура РасходИзБанкаПриИзменении(Элемент)
	РасходИзБанкаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ТоварыПредпоступленияСделкаПриИзмененииНаСервере(ТекСтрока)
	ТС = Объект.ТоварыПредпоступления.НайтиПоИдентификатору(ТекСтрока);
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(СделкаСПоставщикомГрафикОплат.СуммаОплаты) КАК СуммаОплаты,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена,
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка = &Ссылка
	|	И СделкаСПоставщикомГрафикОплат.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ТС.Сделка);
	Запрос.УстановитьПараметр("Номенклатура",ТС.Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТС.УИН_СтрокиСделки = Выборка.УИН_ПервойСтроки;
		ТС.Цена = Выборка.Цена;
		ТС.Сумма = ТС.Количество * ТС.Цена;
		ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПредпоступленияСделкаПриИзменении(Элемент)
	ТоварыПредпоступленияСделкаПриИзмененииНаСервере(Элементы.ТоварыПредпоступления.ТекущаяСтрока);
КонецПроцедуры


&НаСервере
Процедура ЗаписатьРасходБанкаНаСервере()
	Док = Объект.РасходИзБанка.ПолучитьОбъект();
	Док.СтруктурныеЕдиницы.Очистить();
	Для каждого Стр Из Объект.СтруктурныеЕдиницы Цикл
		
		НС = Док.СтруктурныеЕдиницы.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла;
	//+++АК POZM 2017.11.22 ИП-00017139
	Если ПроводитьВЗакрытомПериоде Тогда
		Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
	КонецЕсли;	
	//---АК POZM 
	Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьРасходБанка(Команда)
	ЗаписатьРасходБанкаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ГрафикОплатПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		
		ТД = Элементы.ГрафикОплат.ТекущаяСтрока;
		ОбработатьСтрокуСделкиСервер(ТД);
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуСделкиСервер(ТС)
	ТД = Объект.ГрафикОплат.НайтиПоИдентификатору(ТС);
	Если Не ЗначениеЗаполнено(ТД.УИН_Строки) Тогда
		ТД.УИН_Строки = Новый УникальныйИдентификатор();
		Если ТД.НомерСтрокиГрафика = 1 Тогда
			ТД.УИН_ПервойСтроки = ТД.УИН_Строки;
		Иначе
			ПерваяСтрокаНоменклатуры = Объект.ГрафикОплат.НайтиСтроки(Новый Структура("Номенклатура,НомерСтрокиГрафика",ТД.Номенклатура,1));
			Если ПерваяСтрокаНоменклатуры.Количество()>0 Тогда
				ТД.УИН_ПервойСтроки = ПерваяСтрокаНоменклатуры[0].УИН_Строки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	


&НаСервере
Процедура ЗаписатьДопРасходыНаСервере()
	Док = Объект.ПоступлениеДопРасходов.ПолучитьОбъект();
	Док.НоменклатураДопОборудование.Очистить();
	Для каждого Стр Из Объект.НоменклатураДопОборудование Цикл
		
		НС = Док.НоменклатураДопОборудование.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла; 
	//+++АК POZM 2017.11.22 ИП-00017139
	Если ПроводитьВЗакрытомПериоде Тогда
		Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
	КонецЕсли;	
	//---АК POZM 
	Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьДопРасходы(Команда)
	ЗаписатьДопРасходыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПоступлениеДопРасходовПриИзмененииНаСервере()
	Объект.НоменклатураДопОборудование.Очистить();
	Для каждого Стр Из Объект.ПоступлениеДопРасходов.НоменклатураДопОборудование Цикл
		
		НС = Объект.НоменклатураДопОборудование.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеДопРасходовПриИзменении(Элемент)
	ПоступлениеДопРасходовПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбработатьПоступленияПоПредпоступлениямНаСервере()
	
	Для каждого СтрокаПоступления Из Поступления Цикл
		
		Если СтрокаПоступления.Поступление.Проведен Тогда
			ДокПост = СтрокаПоступления.Поступление.ПолучитьОбъект();
			//+++АК POZM 2017.11.22 ИП-00017139
			Если ПроводитьВЗакрытомПериоде Тогда
				ДокПост.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
			КонецЕсли;	
			//---АК POZM 
			ДокПост.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Проведен "+ДокПост.Ссылка);
		КонецЕсли;	
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПоступленияПоПредпоступлениям(Команда)
	ОбработатьПоступленияПоПредпоступлениямНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОборудованиеНоменклатураПриИзмененииНаСервере(ИС)
	ТС = Объект.Оборудование.НайтиПоИдентификатору(ИС);
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(СделкаСПоставщикомГрафикОплат.СуммаОплаты) КАК СуммаОплаты,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена,
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка = &Ссылка
	|	И СделкаСПоставщикомГрафикОплат.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ТС.Сделка);
	Запрос.УстановитьПараметр("Номенклатура",ТС.Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТС.Сумма = Выборка.Цена;
		ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеНоменклатураПриИзменении(Элемент)
	ТД = Элементы.Оборудование.ТекущаяСтрока;
	ОборудованиеНоменклатураПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура ОборудованиеСуммаПриИзмененииНаСервере(ИС)
	ТС = Объект.Оборудование.НайтиПоИдентификатору(ИС);
	ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеСуммаПриИзменении(Элемент)
	ТД = Элементы.Оборудование.ТекущаяСтрока;
	ОборудованиеСуммаПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура ОборудованиеСтавкаНДСПриИзмененииНаСервере(ИС)
	ТС = Объект.Оборудование.НайтиПоИдентификатору(ИС);
	ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеСтавкаНДСПриИзменении(Элемент)
	ТД = Элементы.Оборудование.ТекущаяСтрока;
	ОборудованиеСтавкаНДСПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура ОборудованиеСуммаНДСПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеСуммаНДСПриИзменении(Элемент)
	ОборудованиеСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОборудованиеСделкаПриИзмененииНаСервере(ИС)
	ТС = Объект.Оборудование.НайтиПоИдентификатору(ИС);
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(СделкаСПоставщикомГрафикОплат.СуммаОплаты) КАК СуммаОплаты,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена,
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка = &Ссылка
	|	И СделкаСПоставщикомГрафикОплат.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ТС.Сделка);
	Запрос.УстановитьПараметр("Номенклатура",ТС.Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТС.Сумма = Выборка.Цена;
		ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеСделкаПриИзменении(Элемент)
	ТД = Элементы.Оборудование.ТекущаяСтрока;
	ОборудованиеСделкаПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура ОборудованиеПредпоступлениеПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОборудованиеПредпоступлениеПриИзменении(Элемент)
	ОборудованиеПредпоступлениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаписатьПоступлениеТоваровУслугНаСервере()
	Док = Объект.ПоступлениеОборудования.ПолучитьОбъект();
	Док.Оборудование.Очистить();
	Для каждого Стр Из Объект.Оборудование Цикл
		
		НС = Док.Оборудование.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла;
	//+++АК POZM 2017.11.22 ИП-00017139
	Если ПроводитьВЗакрытомПериоде Тогда
		Док.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
		//+++АК POZM 2018.06.28 ИП-00019107
		Док.Движения.Финансовый.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
		Док.Движения.РасчетыПоСделкамСПоставщиками.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
		Док.Движения.РасчетыСКонтрагентами.ДополнительныеСвойства.Вставить("ПроводитьВЗакрытомПериоде",Истина);
		//---АК POZM 
	КонецЕсли;	
	//---АК POZM 
	Док.Записать(?(Док.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьПоступлениеТоваровУслуг(Команда)
	ЗаписатьПоступлениеТоваровУслугНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПоступлениеОборудованияПриИзмененииНаСервере()
	Объект.Оборудование.Очистить();
	Для каждого Стр Из Объект.ПоступлениеОборудования.Оборудование Цикл
		
		НС = Объект.Оборудование.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеОборудованияПриИзменении(Элемент)
	ПоступлениеОборудованияПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеНоменклатураПриИзмененииНаСервере(ИС)
	ТС = Объект.НоменклатураДопОборудование.НайтиПоИдентификатору(ИС);
	Если Не (ЗначениеЗаполнено(ТС.Сделка) И ЗначениеЗаполнено(ТС.Номенклатура)) Тогда
		Возврат;
	КонецЕсли;	
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(СделкаСПоставщикомГрафикОплат.СуммаОплаты) КАК СуммаОплаты,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена,
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки
	|ИЗ
	|	Документ.СделкаСПоставщиком.ГрафикОплат КАК СделкаСПоставщикомГрафикОплат
	|ГДЕ
	|	СделкаСПоставщикомГрафикОплат.Ссылка = &Ссылка
	|	И СделкаСПоставщикомГрафикОплат.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСПоставщикомГрафикОплат.ДатаГотовности,
	|	СделкаСПоставщикомГрафикОплат.Номенклатура,
	|	СделкаСПоставщикомГрафикОплат.ДатаПлатежа,
	|	СделкаСПоставщикомГрафикОплат.УИН_ПервойСтроки,
	|	СделкаСПоставщикомГрафикОплат.Количество,
	|	СделкаСПоставщикомГрафикОплат.Цена";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ТС.Сделка);
	Запрос.УстановитьПараметр("Номенклатура",ТС.Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТС.Цена = Выборка.Цена;
		ТС.Сумма = Выборка.Цена*ТС.Количество;
		ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеНоменклатураПриИзменении(Элемент)
	ТД = Элементы.НоменклатураДопОборудование.ТекущаяСтрока;
	НоменклатураДопОборудованиеНоменклатураПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеКоличествоПриИзмененииНаСервере(ИС)
	ТС = Объект.НоменклатураДопОборудование.НайтиПоИдентификатору(ИС);
	
	ТС.Сумма = ТС.Цена*ТС.Количество;
	ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеКоличествоПриИзменении(Элемент)
	ТД = Элементы.НоменклатураДопОборудование.ТекущаяСтрока;
	НоменклатураДопОборудованиеКоличествоПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеЦенаПриИзмененииНаСервере(ИС)
	ТС = Объект.НоменклатураДопОборудование.НайтиПоИдентификатору(ИС);
	
	ТС.Сумма = ТС.Цена*ТС.Количество;
	ТС.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТС.Сумма,Истина, Истина,УчетНДС.ПолучитьСтавкуНДС(ТС.СтавкаНДС));
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеЦенаПриИзменении(Элемент)
	ТД = Элементы.НоменклатураДопОборудование.ТекущаяСтрока;
	НоменклатураДопОборудованиеЦенаПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеСтавкаНДСПриИзменении(Элемент)
	ТД = Элементы.НоменклатураДопОборудование.ТекущаяСтрока;
	НоменклатураДопОборудованиеЦенаПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеСуммаНДСПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеСуммаНДСПриИзменении(Элемент)
	НоменклатураДопОборудованиеСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеСуммаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеСуммаПриИзменении(Элемент)
	НоменклатураДопОборудованиеСуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура НоменклатураДопОборудованиеСделкаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураДопОборудованиеСделкаПриИзменении(Элемент)
	ТД = Элементы.НоменклатураДопОборудование.ТекущаяСтрока;
	НоменклатураДопОборудованиеНоменклатураПриИзмененииНаСервере(ТД);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьПравоКорректировкиПоСделкам = УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.КорректировкиПоСделкам, Ложь);
	Если Не ЕстьПравоКорректировкиПоСделкам Тогда
		Сообщить("Нет прав работы с корректировками");
		Отказ = истина;
	КонецЕсли;	
КонецПроцедуры

