
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	
	Отбор = Новый Структура;
	//Отбор.Вставить("ПериодОтчета",Новый СтандартныйПериод(ПараметрКоманды.Дата,ПараметрКоманды.Дата));
	Отбор.Вставить("СтруктурнаяЕдиница",ТочкиДокументаСервер(ПараметрКоманды));
	
	
	ПараметрыФормы = Новый Структура("Отбор,СФормироватьПриОткрытии",Отбор,Истина );
	
	
	ОткрытьФорму("Отчет.ЛимитыРасходовНаСтруктурныеЕдиницы.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция ТочкиДокументаСервер(Заявка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗаявкаНаУслугиМатериалыУслуги.СтруктурнаяЕдиница
	               |ИЗ
	               |	Документ.ЗаявкаНаУслугиМатериалы.Услуги КАК ЗаявкаНаУслугиМатериалыУслуги
	               |ГДЕ
	               |	ЗаявкаНаУслугиМатериалыУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаявкаНаУслугиМатериалыУслуги.СтруктурнаяЕдиница
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПредпоступлениеПоКомплектации.Магазин
	               |ИЗ
	               |	Документ.ПредпоступлениеПоКомплектации КАК ПредпоступлениеПоКомплектации
	               |ГДЕ
	               |	ПредпоступлениеПоКомплектации.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции	