
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент   = Параметры.Контрагент;
	Договор      = Параметры.Договор;
	ДатаПроверки = Параметры.ДатаПроверки;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ПроверкаСрокДействия = ПроверкаРеквизитов.ПроверитьСрокДоговора(Договор,ДатаПроверки);
		ПроверятьСрокДействияДоговора = Истина;
		СрокДействияДоговора = ПроверкаСрокДействия.СрокДействия;
		ОшибкаСрокДействияДоговора = ПроверкаСрокДействия.ОшибкаСрокДоговора;
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПроверкаРекомендаций = ПроверкаРеквизитов.ПроверитьРекомендацииКонтрагента(Контрагент,ДатаПроверки);
		ПроверятьРекомендации = Истина;
		РекомендацияУФК = ПроверкаРекомендаций.РекомендацияУФК;
		Рекомендация1cont = ПроверкаРекомендаций.Рекомендация1cont;
		ОшибкаРекомендация1Cont = Рекомендация1cont.Отрицательная ИЛИ Рекомендация1cont.ЗавершениеСотрудничества;
		ОшибкаРекомендацияУФК   = РекомендацияУФК.Отрицательная ИЛИ РекомендацияУФК.ЗавершениеСотрудничества;
		
		ПроверкаСтопОплата = ПроверкаРеквизитов.ПроверитьСтопОплату(Контрагент,ДатаПроверки);
		ПроверятьСтопОплату = Истина;
		СостояниеСтопОплата = ПроверкаСтопОплата.СостояниеСтопОплата;
		ОшибкаСтопОплата =    ПроверкаСтопОплата.ОшибкаСтопОплата;		
		
	КонецЕсли;		
	
	УстановитьОформление();
	
КонецПроцедуры

Процедура УстановитьОформление()
	
	Элементы.ГруппаСрокДействия.Видимость = ПроверятьСрокДействияДоговора;
	
	Если Не ЗначениеЗаполнено(СрокДействияДоговора) Тогда
		СостояниеСрокДействия = "Не заполнен срок действия договора";
	Иначе
		Если СрокДействияДоговора < ДатаПроверки Тогда
			СостояниеСрокДействия = "Срок действия договора окончен! Дата окончания " + Формат(СрокДействияДоговора,"ДФ='dd MMMM yyyy'") + "г.";	
		Иначе 
			СостояниеСрокДействия = "Договор действует";
		КонецЕсли;	
	КонецЕсли;
	
	Элементы.УспехСрокДействия.Видимость = НЕ ОшибкаСрокДействияДоговора;
	Элементы.ОтказСрокДействия.Видимость = ОшибкаСрокДействияДоговора;	
	Если НЕ ОшибкаСрокДействияДоговора Тогда
		Элементы.СостояниеСрокДействия.ЦветТекста = WebЦвета.ТемноЗеленый;
	Иначе 
		Элементы.СостояниеСрокДействия.ЦветТекста = WebЦвета.Красный;		
	КонецЕсли;	
		
	Элементы.ГруппаРекомендации.Видимость = ПроверятьРекомендации;
	
	Элементы.УспехРекомендация1Cont.Видимость = Не ОшибкаРекомендация1Cont;
	Элементы.ОтказРекомендация1Cont.Видимость = ОшибкаРекомендация1Cont;
	Элементы.УспехРекомендацияУФК.Видимость = Не ОшибкаРекомендацияУФК;
	Элементы.ОтказРекомендацияУФК.Видимость = ОшибкаРекомендацияУФК;
	
	Элементы.Рекомендация1Cont.Видимость = ЗначениеЗаполнено(Рекомендация1Cont);
	Элементы.РекомендацияУФК.Видимость = ЗначениеЗаполнено(РекомендацияУФК);
	
	Элементы.Рекомендация1ContНеЗаполнена.Видимость = НЕ ЗначениеЗаполнено(Рекомендация1Cont);
	Элементы.РекомендацияУФКtНеЗаполнена.Видимость = НЕ ЗначениеЗаполнено(РекомендацияУФК);
	
	Если НЕ ОшибкаРекомендация1Cont Тогда
		Элементы.Рекомендация1Cont.ЦветТекста = WebЦвета.ТемноЗеленый;
	Иначе 
		Элементы.Рекомендация1Cont.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;	
		
	Если НЕ ОшибкаРекомендацияУФК Тогда
		Элементы.РекомендацияУФК.ЦветТекста = WebЦвета.ТемноЗеленый;
	Иначе 
		Элементы.РекомендацияУФК.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;	
	
	Элементы.ГруппаСтопОплата.Видимость = ПроверятьСтопОплату;
	Элементы.УспехСтопОплата.Видимость = НЕ ОшибкаСтопОплата;
	Элементы.ОтказСтопОплата.Видимость = ОшибкаСтопОплата;	
	
	Если НЕ ОшибкаСтопОплата Тогда
		Элементы.СостояниеСтопОплата.ЦветТекста = WebЦвета.ТемноЗеленый;
	Иначе 
		Элементы.СостояниеСтопОплата.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;	
	
	
	
КонецПроцедуры	


