
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаПериодНаСервере(ДатаС,ДатаПо,Пользователь)
	Набор = РегистрыСведений.Дежурные.СоздатьНаборЗаписей();
	ТекДата = ДатаС;
	Пока ТекДата <= ДатаПо Цикл
		НЗ = Набор.Добавить();
		НЗ.Дежурный = Пользователь;
		НЗ.Период = ТекДата;
		ТекДата = ТекДата+60*60*24;
	КонецЦикла;	
	Набор.Записать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериод(Команда)
	ДатаС = ТекущаяДата();
	ДатаПо = ТекущаяДата();
	//+++АК mika 2018.10.17 Без задачи. Исправление ошибки работы в упр. приложении
	//Пользователь = ПараметрыСеанса.ТекущийПользователь; 
	//ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьЗаПериодЗавершение2", ЭтаФорма, Новый Структура("ДатаПо, Пользователь, ДатаС", ДатаПо, Пользователь, ДатаС)), ДатаС,"Начало периода",ЧастиДаты.Дата);
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьЗаПериодЗавершение2", ЭтаФорма, Новый Структура("ДатаПо, Пользователь, ДатаС", ДатаПо, ТекущийПользователь, ДатаС)), ДатаС,"Начало периода",ЧастиДаты.Дата);
	//---АК mika
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериодЗавершение2(Дата, ДополнительныеПараметры) Экспорт
	
	ДатаПо = ДополнительныеПараметры.ДатаПо;
	Пользователь = ДополнительныеПараметры.Пользователь;
	ДатаС = ?(Дата = Неопределено, ДополнительныеПараметры.ДатаС, Дата);
	
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьЗаПериодЗавершение1", ЭтаФорма, Новый Структура("ДатаС, Пользователь, ДатаПо", ДатаС, Пользователь, ДатаПо)), ДатаПо,"Конец периода",ЧастиДаты.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериодЗавершение1(Дата, ДополнительныеПараметры) Экспорт
	
	ДатаС = ДополнительныеПараметры.ДатаС;
	Пользователь = ДополнительныеПараметры.Пользователь;
	ДатаПо = ?(Дата = Неопределено, ДополнительныеПараметры.ДатаПо, Дата);
	
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
	ОписаниеТипа = Новый ОписаниеТипов(Массив);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗаполнитьЗаПериодЗавершение", ЭтаФорма, Новый Структура("ДатаПо, ДатаС, Пользователь", ДатаПо, ДатаС, Пользователь)), Пользователь,"Дежурный",ОписаниеТипа);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериодЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ДатаПо = ДополнительныеПараметры.ДатаПо;
	ДатаС = ДополнительныеПараметры.ДатаС;
	Пользователь = ?(Значение = Неопределено, ДополнительныеПараметры.Пользователь, Значение);
	
	
	Если ЗначениеЗаполнено(ДатаС) И ЗначениеЗаполнено(ДатаПо) И ЗначениеЗаполнено(Пользователь) Тогда
		ЗаполнитьЗаПериодНаСервере(ДатаС,ДатаПо,Пользователь);
	КонецЕсли;	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура Дежурные(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаДежурные");
КонецПроцедуры



