
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ Тогда
		Если ЗначениеЗаполнено(ОтносительноеИмяФайла) Тогда
			Набор = РегистрыСведений.ПрикрепленныеФотоКОбъектам.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(Ссылка);
			Запись = Набор.Добавить();
			Запись.Номенклатура = Номенклатура;
			Запись.Характеристика = ХарактеристикаНоменклатуры;
			Запись.ТипЗаписи = Перечисления.ТипыЗаписейПриложенныхКартинок.ИнвентаризацияУпаковки;
			Запись.ОтносительноеИмяФайла = ОтносительноеИмяФайла;
			Запись.Расширение = РасширениеФайла;
			Запись.УинЗаписи = Строка(Ссылка.УникальныйИдентификатор());
			Запись.Объект = Ссылка;
			Запись.ДатаДобавления = Дата;
			Набор.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
