
&НаКлиенте
Процедура КомандаОк(Команда)
		
	ПарамВозврат = Новый Структура;
	ПарамВозврат.Вставить("ДатаНач",ПериодВыборки.ДатаНачала);
	ПарамВозврат.Вставить("ДатаКон",ПериодВыборки.ДатаОкончания);
	ПарамВозврат.Вставить("ТипПокупателя", ТипАбонемента);
	
	ЭтаФорма.Закрыть(ПарамВозврат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипАбонемента = 0 Тогда
		 ТипАбонемента = 1;
	КонецЕсли;	
КонецПроцедуры
