
&НаКлиенте
Процедура ГенерироватьШтрихКод(Команда)
	ГенерироватьШтрихКодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГенерироватьШтрихКодНаСервере()
	Запись.ШтрихКод=ГенерироватьНовыйШтрихКод(Запись.Номенклатура);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Запись.ЕдиницаИзмерения.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	ЕдиницыИзмерения.Ссылка
						   |ИЗ
						   |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
						   |ГДЕ
						   |	ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
						   |	И ЕдиницыИзмерения.Владелец = &Владелец";
			Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Запись.Номенклатура.БазоваяЕдиницаИзмерения);
			Запрос.УстановитьПараметр("Владелец",Запись.Номенклатура);
			
			ВыборкаЕИ = Запрос.Выполнить().Выбрать();
			Если ВыборкаЕИ.Следующий() Тогда			
				Запись.ЕдиницаИзмерения = ВыборкаЕИ.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
	Элементы.ХарактеристикаПартия.ОграничениеТипа = ДопустимыеТипы;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГенерироватьНовыйШтрихКод(Номенклатура) Экспорт
	Возврат РегистрыСведений.ШтриховыеКоды.ГенерироватьНовыйШтрихКод(Номенклатура);
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСлева(Строка1,Длина,Строка2) Экспорт
	Возврат РегистрыСведений.ШтриховыеКоды.ДобавитьСлева(Строка1,Длина,Строка2);
КонецФункции


&НаКлиенте
Процедура ХарактеристикаПартияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКС(Команда)
	ЗаполнитьКонтрольнуюЦифру();
КонецПроцедуры

// Функция вычисляет контрольный символ кода EAN
//
// Параметры:
//  ШтрихКод     - штрихкод (без контрольной цифры)
//  Тип          - тип штрихкода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрихкода
//
&НаКлиенте
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКонтрольнуюЦифру()
	ШК12 = Лев(Запись.ЛожныйШтрихКод,12);
	Если СтрДлина(ШК12) = 0 Тогда 
		Возврат
	ИначеЕсли СтрДлина(ШК12)<12 тогда
		ШК12 = ШК12 + Лев("000000000000",12-СтрДлина(ШК12));
	КонецЕсли;
	Запись.ЛожныйШтрихКод = ШК12 + КонтрольныйСимволEAN(ШК12, 13);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьКонтрольнуюЦифру();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос();
	//Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	//Запрос.УстановитьПараметр("Характеристика", Запись.Характеристика);
	//Запрос.УстановитьПараметр("ШтрихКод", Запись.ШтрихКод);
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ШтриховыеКоды.ШтрихКод,
	//			   |	ШтриховыеКоды.Номенклатура,
	//			   |	ШтриховыеКоды.Характеристика
	//			   |ИЗ
	//			   |	РегистрСведений.ШтриховыеКоды КАК ШтриховыеКоды
	//			   |ГДЕ
	//			   |	ШтриховыеКоды.Номенклатура <> &Номенклатура
	//			   |	И ШтриховыеКоды.Характеристика <> &Характеристика
	//			   |	И ШтриховыеКоды.ШтрихКод = &ШтрихКод";
	//			   
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Отказ = Истина;
	//	Сообщить("Данный штрих-код уже присвоен по товару: " + Выборка.Номеклатура + " и характеристике: " + Выборка.Характеристика);
	//КонецЕсли;	
	
КонецПроцедуры

