////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет необходимост закрытия потребности и закрывает потребность в персонале 
//
// Параметры:
//  Организация  - <Тип.СправочникСсылка.Организации> - Организация
//  Сотрудник  - <Тип.СправочникСсылка.ФизическиеЛица> - Физическое лицо
//
Процедура ПроверитьНеобходимостьЗакрытияПотребностиВСотрудниках(Организация, Сотрудник) Экспорт

	

КонецПроцедуры // ПроверитьНеобходимостьЗакрытияПотребностиВСотрудниках()
