
Функция ПолучитьОписаниеДняНедели(мДеньНедели)
	
	Если мДеньНедели = Перечисления.ДниНедели.Понедельник Тогда
		Возврат "ПН";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Вторник Тогда
		Возврат "ВТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Среда Тогда
		Возврат "СР";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Четверг Тогда
		Возврат "ЧТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Пятница Тогда
		Возврат "ПТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Суббота Тогда
		Возврат "СБ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Воскресенье Тогда
		Возврат "ВС";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНаименование(График) Экспорт
	
	ТекПредставление = "";
	Для Каждого СтрокаТЧ Из График Цикл
		
		ТекПредставление = ТекПредставление + ?(ЗначениеЗаполнено(ТекПредставление), ", ", "") +
										ПолучитьОписаниеДняНедели(СтрокаТЧ.ДеньЗаказа) + "->" + ПолучитьОписаниеДняНедели(СтрокаТЧ.ДеньПоставки);
		
	КонецЦикла;
	
	Возврат ТекПредставление;
	
КонецФункции