//+++АК KIRN 2018.03.02 ИП-00017976.01    
Функция ПолучитьТипЦены(ТорговаяМарка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТипыЦен.Ссылка КАК ТипЦены
	               |ИЗ
	               |	Справочник.ТипыЦен КАК ТипыЦен
	               |ГДЕ
	               |	ТипыЦен.ТорговаяМарка = &ТорговаяМарка";
	Запрос.УстановитьПараметр("ТорговаяМарка", ТорговаяМарка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ТипыЦен.ПустаяСсылка();
	КонецЕСли;
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипЦены;
	КонецЕСли;
	
	Возврат Справочники.ТипыЦен.ПустаяСсылка();
КонецФункции
//---АК KIRN 