
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Тип = "Жалобы" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбращенияПокупателей.ДатаДок КАК ДатаДок,
		               |	ОбращенияПокупателей.ТипОбращения,
		               |	ОбращенияПокупателей.Производитель,
		               |	ОбращенияПокупателей.Номенклатура,
		               |	ОбращенияПокупателей.ТипЖалобы,
		               |	ОбращенияПокупателей.ИсточникОбращения,
		               |	ОбращенияПокупателей.Примечание,
		               |	ОбращенияПокупателей.ОтветПокупателю,
		               |	ОбращенияПокупателей.id_OK,
		               |	ОбращенияПокупателей.GUID_Загрузки
		               |ИЗ
		               |	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
		               |ГДЕ
		               |	ОбращенияПокупателей.ДатаДок МЕЖДУ &ДатаНач И &ДатаКон
		               |	И (ОбращенияПокупателей.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)
		               |	И (ВЫБОР
		               |				КОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент
		               |				ИНАЧЕ ОбращенияПокупателей.Производитель
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И ОбращенияПокупателей.ТипЖалобы.СчитатьЖалобойНаТовар = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаДок";
					   
		Выборка = Запрос.Выполнить().Выбрать(); 
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("ЖалобыРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Дата = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yy");
			Область.Параметры.ТипЖалобы = Выборка.ТипЖалобы;
			Область.Параметры.Товар = Выборка.Номенклатура;
			Область.Параметры.Поставщик = Выборка.Производитель;
			Область.Параметры.Источник = Выборка.ИсточникОбращения;
			Область.Параметры.Суть = Выборка.Примечание;
			Область.Параметры.Ответ = Выборка.ОтветПокупателю;
			Область.Параметры.Ключ = РегистрыСведений.ОбращенияПокупателей.СоздатьКлючЗаписи(Новый Структура("id_OK, GUID_Загрузки, ДатаДок", Выборка.id_OK, Выборка.GUID_Загрузки, Выборка.ДатаДок));
			ТабДокумент.Вывести(Область);
		КонецЦикла;
	ИначеЕсли Параметры.Тип = "Включения" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбращенияПокупателей.ДатаДок КАК ДатаДок,
		               |	ОбращенияПокупателей.ТипОбращения,
		               |	ОбращенияПокупателей.Производитель,
		               |	ОбращенияПокупателей.Номенклатура,
		               |	ОбращенияПокупателей.ТипЖалобы,
		               |	ОбращенияПокупателей.ИсточникОбращения,
		               |	ОбращенияПокупателей.Примечание,
		               |	ОбращенияПокупателей.ОтветПокупателю,
		               |	ОбращенияПокупателей.id_OK,
		               |	ОбращенияПокупателей.GUID_Загрузки
		               |ИЗ
		               |	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
		               |ГДЕ
		               |	ОбращенияПокупателей.ДатаДок МЕЖДУ &ДатаНач И &ДатаКон
		               |	И (ОбращенияПокупателей.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)
		               |	И (ВЫБОР
		               |				КОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент
		               |				ИНАЧЕ ОбращенияПокупателей.Производитель
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И ОбращенияПокупателей.ТипЖалобы.СчитатьЖалобойНаТовар = ИСТИНА
		               |	И ОбращенияПокупателей.ТипЖалобы.ЭтоВключениеВПродукт = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаДок";
					   
		Выборка = Запрос.Выполнить().Выбрать(); 
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("ЖалобыРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка1");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Дата = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yy");
			Область.Параметры.ТипЖалобы = Выборка.ТипЖалобы;
			Область.Параметры.Товар = Выборка.Номенклатура;
			Область.Параметры.Поставщик = Выборка.Производитель;
			Область.Параметры.Источник = Выборка.ИсточникОбращения;
			Область.Параметры.Суть = Выборка.Примечание;
			Область.Параметры.Ответ = Выборка.ОтветПокупателю;
			Область.Параметры.Ключ = РегистрыСведений.ОбращенияПокупателей.СоздатьКлючЗаписи(Новый Структура("id_OK, GUID_Загрузки, ДатаДок", Выборка.id_OK, Выборка.GUID_Загрузки, Выборка.ДатаДок));
			ТабДокумент.Вывести(Область);
		КонецЦикла;	
	ИначеЕсли Параметры.Тип = "Нарушения" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Номенклатура,
		               |	ВЫБОР
		               |		КОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент
		               |		ИНАЧЕ ЗначенияСвойствОбъектов.Значение
		               |	КОНЕЦ КАК Поставщик,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Дата,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Показатель,
		               |	ПроверкаКачестваТоваровСоставПоказателей.НормаОт,
		               |	ПроверкаКачестваТоваровСоставПоказателей.НормаДо,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Результат,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Нарушение,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка
		               |ИЗ
		               |	Документ.ПроверкаКачестваТоваров.СоставПоказателей КАК ПроверкаКачестваТоваровСоставПоказателей
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		               |		ПО ПроверкаКачестваТоваровСоставПоказателей.Ссылка.ХарактеристикаНоменклатуры = ЗначенияСвойствОбъектов.Объект
		               |			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		               |ГДЕ
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Проведен = ИСТИНА
		               |	И ПроверкаКачестваТоваровСоставПоказателей.Нарушение = ИСТИНА
		               |	И (ВЫБОР
		               |				КОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент
		               |				ИНАЧЕ ЗначенияСвойствОбъектов.Значение
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И (ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("НарушенияРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(Область);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("РегистрСведенийКлючЗаписи.ОбращенияПокупателей") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("РегистрСведений.ОбращенияПокупателей.ФормаЗаписи", Новый Структура("Ключ", Расшифровка));
	КонецЕсли;	
	
КонецПроцедуры
