
&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	Для Каждого СтрТз из ТаблицаТаблиц Цикл
		СтрТз.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	Для Каждого СтрТз из ТаблицаТаблиц Цикл
		СтрТз.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтаФорма.Закрыть(ТаблицаТаблиц);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтмена(Команда)
	ЭтаФОрма.Закрыть(Неопределено);
КонецПроцедуры
