Функция ПроверитьСрокДоговора(Договор,Дата) Экспорт
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОшибкаСрокДоговора",Ложь);
	СтруктураРезультат.Вставить("СрокДействия",Дата(1,1,1));
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат СтруктураРезультат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентов.СрокДействия < &Дата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаСрокДоговора,
		|	ДоговорыКонтрагентов.СрокДействия
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("Дата",Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,ВыборкаДетальныеЗаписи);
		Возврат СтруктураРезультат;
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

//+++АК sils 03.09.2018 ИП-00019634
//Функция ПроверитьСтопОплату(Контрагент,Дата) Экспорт
Функция ПроверитьСтопОплату(Контрагент, Дата, Организация = "") Экспорт
//---АК	
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОшибкаСтопОплата",Ложь);
	СтруктураРезультат.Вставить("СостояниеСтопОплата","Не в стоп оплате");
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат СтруктураРезультат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СведенияОСтопОплатеСрезПоследних.СтопОплата = ИСТИНА
		|				ИЛИ СведенияОСтопОплатеСрезПоследних.Подтверждено = ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаСтопОплата,
		|	СведенияОСтопОплатеСрезПоследних.СтопОплата,
		|	СведенияОСтопОплатеСрезПоследних.Подтверждено,
		//+++АК sils 07.09.2018 ИП-00019634
		|	СведенияОСтопОплатеСрезПоследних.Организация,
		//---АК
		|	ВЫБОР
		|		КОГДА СведенияОСтопОплатеСрезПоследних.СтопОплата = ИСТИНА
		|				И СведенияОСтопОплатеСрезПоследних.Подтверждено <> ИСТИНА
		|			ТОГДА ""Заявка на стоп оплату""
		|		КОГДА СведенияОСтопОплатеСрезПоследних.СтопОплата = ИСТИНА
		|				И СведенияОСтопОплатеСрезПоследних.Подтверждено = ИСТИНА
		|			ТОГДА ""Подтверждена стоп оплата""
		|		КОГДА СведенияОСтопОплатеСрезПоследних.СтопОплата <> ИСТИНА
		|				И СведенияОСтопОплатеСрезПоследних.Подтверждено = ИСТИНА
		|			ТОГДА ""Заявка на отмену стоп оплаты""
		|		КОГДА СведенияОСтопОплатеСрезПоследних.СтопОплата <> ИСТИНА
		|				И СведенияОСтопОплатеСрезПоследних.Подтверждено <> ИСТИНА
		|			ТОГДА ""Не в стоп оплате""
		|	КОНЕЦ КАК СостояниеСтопОплата
		|ИЗ
		//+++АК sils 03.09.2018 ИП-00019634
		//|	РегистрСведений.СведенияОСтопОплате.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК СведенияОСтопОплатеСрезПоследних";
		|	РегистрСведений.СведенияОСтопОплате.СрезПоследних(
		|			&Дата,
		//+++АК sils 09.11.2018 ИП-00019634.02
		//|			Контрагент = &Контрагент" + ?(Организация = "", "", " И (Организация = &Организация ИЛИ
		//|			Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))") + ") КАК СведенияОСтопОплатеСрезПоследних";
		|			Контрагент = &Контрагент" + ?(Организация = "", "", " 
		|				И (Организация = &Организация
		|					ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|						И НЕ Контрагент В
		|								(ВЫБРАТЬ
		|									СведенияОСтопОплатеСрезПоследних.Контрагент КАК Контрагент
		|								ИЗ
		|									РегистрСведений.СведенияОСтопОплате.СрезПоследних(&Дата, Контрагент = &Контрагент
		|										И Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК СведенияОСтопОплатеСрезПоследних))") + ") КАК СведенияОСтопОплатеСрезПоследних";
		//---АК
		//---АК
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//+++АК sils 03.09.2018 ИП-00019634
	Если Организация <> "" Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	//---АК
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//+++АК sils 07.09.2018 ИП-00019634
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ЗаполнитьЗначенияСвойств(СтруктураРезультат,ВыборкаДетальныеЗаписи);
	//КонецЦикла;
	флНайденаЗапись = Ложь;
	Если Организация <> "" и ЗначениеЗаполнено(Организация) Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураРезультат,ВыборкаДетальныеЗаписи);
				флНайденаЗапись = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если не флНайденаЗапись Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураРезультат,ВыборкаДетальныеЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//---АК
	
	Возврат СтруктураРезультат;										
	
КонецФункции



Функция ПроверитьРекомендацииКонтрагента(Контрагент,Дата) Экспорт
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОшибкаРекомендации",Ложь);
	СтруктураРезультат.Вставить("РекомендацияУФК",Справочники.Рекомендации.ПустаяСсылка());
	СтруктураРезультат.Вставить("Рекомендация1cont",Справочники.Рекомендации.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат СтруктураРезультат;
	КонецЕсли;
	
	СтруктураРекомендации = РегистрыСведений.СведенияОПроверкеКонтрагентов.ПолучитьРекомендацииИПояснения(Контрагент,Дата);	
	
	ЗаполнитьЗначенияСвойств(СтруктураРезультат,СтруктураРекомендации);
		
	СтруктураРезультат.ОшибкаРекомендации = ОшибкаРекомендация(СтруктураРезультат.РекомендацияУФК) ИЛИ
			                                ОшибкаРекомендация(СтруктураРезультат.Рекомендация1cont);
											
	Возврат СтруктураРезультат;										
	
КонецФункции

Функция ОшибкаРекомендация(Рекомендация)
	
	Если ТипЗнч(Рекомендация) <> Тип("СправочникСсылка.Рекомендации") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Рекомендация.Отрицательная ИЛИ Рекомендация.ЗавершениеСотрудничества;
	
КонецФункции	


Функция СтруктураОшибокРеквизитов() Экспорт
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОшибкаСрокДоговора",Ложь);
	СтруктураРезультат.Вставить("ОшибкаРекомендации",Ложь);	
	СтруктураРезультат.Вставить("ОшибкаСтопОплата",Ложь);
	
	Возврат СтруктураРезультат;
		
КонецФункции	
	
	
Функция ЕстьОшибки(СтруктураОшибок) Экспорт 
	
	Результат = СтруктураОшибокРеквизитов(); 	
	ЗаполнитьЗначенияСвойств(Результат,СтруктураОшибок);
	Если Результат.ОшибкаСрокДоговора = Истина Тогда
		Возврат Истина;	
	КонецЕсли;	
	Если Результат.ОшибкаРекомендации = Истина Тогда
		Возврат Истина;	
	КонецЕсли;	
	Если Результат.ОшибкаСтопОплата = Истина Тогда
		Возврат Истина;	
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции	
	
	
