Процедура ОтобразитьСостояние(ТекстСообщения)  Экспорт
#Если Клиент Тогда
		Состояние(ТекстСообщения);
#КонецЕсли
КонецПроцедуры
	
#Если Клиент Тогда
Процедура ДобавитьРеквизитыСайтаНаФормуЗаказа(ЭтаФорма) Экспорт
	СтруктураДопРеквизитов = РегистрыСведений.CMS1C_ДополнительныеРеквизитыЗаказа.Получить(Новый Структура("Заказ",ЭтаФорма.Ссылка));
	ЭлементыФормы = ЭтаФорма.ЭлементыФОрмы;
	ДобСтраница = ЭлементыФОрмы.ОсновнаяПанель.Страницы.Добавить("ИзменениеСтатусов","История статусов заказа");
	БылаТекСтраница = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ДобСтраница;
	КоманднаяПанель = ЭлементыФормы.Добавить(Тип("КоманднаяПанель"),"КоманднаяПанельИзменениеСтатусов",Истина,ЭлементыФормы.ОсновнаяПанель);
	КоманднаяПанель.Лево = 6;
	КоманднаяПанель.Верх = 0;
	КоманднаяПанель.Ширина = 736;
	КоманднаяПанель.Высота = 24;
	
	ТабличноеПоле = ЭлементыФормы.Добавить(Тип("ТабличноеПоле"),"ИзмененияСтатусов",Истина,ЭлементыФормы.ОсновнаяПанель);
	ТабличноеПОле.Данные = "ИзмененияСтатусов";
	//ТабличноеПоле.Значение = ИзмененияСтатусов;
	//ТабличноеПоле.ТипЗначения = Новый ОПисаниеТИпов("РегистрСведенийНаборЗаписей.CMS1C_ИзмененияСтатусовЗаказов");
	КоманднаяПанель.ИсточникДействий = ЭлементыФормы.ИзмененияСтатусов;
	КоманднаяПанель.Автозаполнение = Ложь;
	КоманднаяПанель.Автозаполнение = Истина;
	ТабличноеПоле.Лево = 6;
	ТабличноеПОле.Верх = 24;
	ТабличноеПОле.Ширина = 867;
	ТабличноеПоле.Высота = 196;
	ТабличноеПОле.ТолькоПросмотр = Ложь;
	ТабличноеПОле.СоздатьКОлонки();
	ТабличноеПОле.АвтоВводНовойСтроки = Ложь;
	ТабличноеПОле.ИзменяетДанные = Истина;
	
	ТабличноеПОле.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	ТабличноеПОле.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Право);
	ТабличноеПОле.УстановитьПривязку(ГраницаЭлементаУправления.Верх,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Верх);
	ТабличноеПОле.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Низ);
	
	
	ТабличноеПОле.УстановитьДействие("ПередНачаломДобавления",Новый действие("ИзмененияСтатусовПередНачаломДобавления"));
	ТабличноеПОле.УстановитьДействие("ПередНачаломИзменения",Новый действие("ИзмененияСтатусовПередНачаломИзменения"));
	ТабличноеПОле.УстановитьДействие("ПередОкончаниемРедактирования",Новый действие("ИзмененияСтатусовПередОкончаниемРедактирования"));
	
	ТабличноеПоле.Колонки.Заказ.Видимость = Ложь;
	ТабличноеПоле.Колонки.СинхронизироватьССайтом.Видимость = Ложь;
	ТабличноеПоле.Колонки.ОтправлятьПоПочтеКлиенту.Видимость = Ложь;
	ТабличноеПоле.Колонки.Сдвинуть(ТабличноеПоле.Колонки.Статус,-3);
	
	НС  = 0;
	Для Каждого ТекКнопка из КоманднаяПанель.Кнопки.Подменю.Кнопки Цикл
		НС = НС + 1;
		Если НС > 5 Тогда
			Прервать;
		КонецЕсли;
		
		НоваяКнопка = КоманднаяПанель.Кнопки.Добавить("НоваяКнопка"+НС,ТипКнопкиКоманднойПанели.Действие,ТекКнопка.Текст,ТекКнопка.Действие);
	Конеццикла;
	НоваяКнопка = КоманднаяПанель.Кнопки.Добавить("НоваяКнопка"+(НС+1),ТипКнопкиКоманднойПанели.Действие,КоманднаяПанель.Кнопки.Действие.Текст,КоманднаяПанель.Кнопки.Действие.Действие);
	//КолонкаПериод = ТабличноеПоле.Колонки.Добавить("Период");
	КоманднаяПанель.Автозаполнение = Ложь;


	ТекстоваяНадпись = ЭлементыФормы.Добавить(Тип("Надпись"),"НадписьНомерСайта",Истина);
	ТекстоваяНадпись.Лево = 455;
	ТекстоваяНадпись.Верх = 32;
	ТекстоваяНадпись.Ширина = 91;
	ТекстоваяНадпись.Высота = 15;
	ТекстоваяНадпись.Заголовок = "№ на сайте:";
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ЭлементыФормы.Организация,ГраницаЭлементаУправления.Право);
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭлементыФормы.Организация,ГраницаЭлементаУправления.Право);
	
	ТекстоваяНадпись = ЭлементыФормы.Добавить(Тип("Надпись"),"НомерСайта",Истина);
	ТекстоваяНадпись.Лево = 555;
	ТекстоваяНадпись.Верх = 32;
	ТекстоваяНадпись.Ширина = 69;
	ТекстоваяНадпись.Высота = 15;
	ТекстоваяНадпись.Заголовок = Формат(СтруктураДопРеквизитов.Номер,"ЧН=' '");
	ТекстоваяНадпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ЭлементыФормы.НадписьНомерСайта,ГраницаЭлементаУправления.Право);
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Право);
	
	/////////////////////////////////////////////////////////
	ТекстоваяНадпись = ЭлементыФормы.Добавить(Тип("Надпись"),"НадписьТипОплатыСайта",Истина);
	ТекстоваяНадпись.Лево = 455;
	ТекстоваяНадпись.Верх = 56;
	ТекстоваяНадпись.Ширина = 91;
	ТекстоваяНадпись.Высота = 19;
	ТекстоваяНадпись.Заголовок = "Тип оплаты сайта:";
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ЭлементыФормы.Организация,ГраницаЭлементаУправления.Право);
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭлементыФормы.Организация,ГраницаЭлементаУправления.Право);
	
	ТекстоваяНадпись = ЭлементыФормы.Добавить(Тип("Надпись"),"ТипОплатыСайта",Истина);
	ТекстоваяНадпись.Лево = 555;
	ТекстоваяНадпись.Верх = 56;
	ТекстоваяНадпись.Ширина = 285;
	ТекстоваяНадпись.Высота = 19;
	ТекстоваяНадпись.Заголовок = СтруктураДопРеквизитов.ТипОплаты;
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ЭлементыФормы.НадписьТипОплатыСайта,ГраницаЭлементаУправления.Право);
	ТекстоваяНадпись.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭлементыФормы.ОсновнаяПанель,ГраницаЭлементаУправления.Право);
	
	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = БылаТекСтраница;
	
	ЭтаФорма.УстановитьДействие("ПередЗакрытием",Новый Действие("ПередЗакрытием"));
КонецПроцедуры

Процедура ДобавитьКнопкиНаФормуНоменклатуры(ЭтаФорма) Экспорт
	ЭлементыФормы = ЭтаФОрма.ЭлементыФормы;
	Выб = Справочники.CMS1C_НастройкиСайтов.Выбрать();
	Нс = 0;
	Пока ВЫб.Следующий() Цикл
		Если Выб.ПометкаУдаления Тогда
			Продолжить;
		КонецЕСли;
		
		НС = НС + 1;
		ФорматНС = Формат(НС,"ЧГ=");
		ЭлементыФормы.ДействияФормы.Кнопки.Добавить("РазделительСайта"+ФорматНС);
		ЭлементыФормы.ДействияФормы.Кнопки.Добавить("ПодменюСайта"+ФорматНС,ТипКнопкиКоманднойПанели.Подменю,""+Выб.Ссылка);
		ЭлементыФормы.ДействияФормы.Кнопки["ПодменюСайта"+ФорматНС].Кнопки.Добавить("CMS1C_Номенклатура"+НС,ТипКнопкиКоманднойПанели.Действие,"Карточка товара на сайте",Новый Действие("ДопДанные"));
		//ЭлементыФормы.ДействияФормы.Кнопки["ПодменюСайта"+ФорматНС].Кнопки.Добавить("СоответствияПапокСайта"+НС,ТипКнопкиКоманднойПанели.Действие,"Соответствия папок 1С и категорий на сайте ",Новый Действие("СоответствиеКатегорийИПапок"));
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьКнопкиИКолонкиНаФормуСпискаЗаказов(ЭтаФОрма) Экспорт 
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
Колонка = ЭлементыФормы.Список.Колонки.Вставить(3,"Номер сайта");
Колонка.Имя = "НомерСайта";

Колонка = ЭлементыФормы.Список.Колонки.Вставить(5,"Оплата сайта");
Колонка.Имя = "ТипОплатыСайта";

Колонка = ЭлементыФормы.Список.Колонки.Вставить(3,"Настройка сайта");
Колонка.Имя = "НастройкаСайта";

Колонка = ЭлементыФормы.Список.Колонки.Вставить(3,"Статус сайта");
Колонка.Имя = "СтатусСайта";
ЭлементыФормы.Список.УстановитьДействие("ПриВыводеСтроки",Новый Действие("СписокПриВыводеСтроки"));
ЭлементыФормы.Список.УстановитьДействие("Выбор",Новый Действие("СписокВыбор"));
ЭлементыФормы.Список.УстановитьДействие("ПередНачаломДобавления",Новый Действие("СписокПередНачаломДобавления"));

ЭлементыФормы.ДействияФормы.Кнопки.Добавить("РазделительСайта",ТипКнопкиКоманднойПанели.Разделитель);
КнопкаЗагрузитьЗаказы = ЭлементыФормы.ДействияФормы.Кнопки.Добавить("ЗагрузитьЗаказы",ТипКнопкиКоманднойПанели.Действие,"Загрузить заказы",Новый Действие("ДействияФормыЗагрузитьЗаказы"));
КнопкаЗагрузитьЗаказы.Картинка = БиблиотекаКартинок.CMS1C_ДействиеЗагрузка;
КнопкаЗагрузитьЗаказы.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
КонецПроцедуры


Процедура ДопДанные(Кнопка,ЭтаФОрма,ИмяСписка = Неопределено) Экспорт
	Если ИмяСписка <> Неопределено Тогда
		ТекСтрока = ЭтаФорма.ЭлементыФОрмы[ИмяСписка].ТекущаяСтрока;
		Если ТекСтрока = Неопределено Тогда
			Возврат;
		Конецесли;
		
		ТекНоменклатура = ТекСтрока.Ссылка;
	Иначе
		Если ЭтаФорма.ЭтотОБъект.ЭтоНовый() Тогда
			Предупреждение("Перед добавлением данных номенклатуры для сайта необходимо записать номенклатуру");
			Возврат;
		Конецесли;
		ТекНоменклатура = ЭтаФорма.Ссылка;
	КонецЕсли;
	
	Выб = Справочники.CMS1C_НастройкиСайтов.Выбрать();
	НС = 0;
	ИщемНомерСайта = СТрЗаменить(Кнопка.Имя,"CMS1C_Номенклатура","");
	Пока ВЫб.Следующий() Цикл
		Если Выб.ПометкаУдаления Тогда
			ПРодолжить;
		КонецЕсли;
		
		НС = НС+1;
		ТекСайт = Выб.Ссылка;
		Если Формат(НС,"ЧГ=")= ИщемНомерСайта Тогда
			ПРервать;
		КонецЕсли;
	КонецЦикла;
	
	
	
	Если ТекНоменклатура.ЭтоГруппа Тогда
		ОткрытьПомощникСопоставления(ТекНоменклатура,ТекСайт);
	Иначе
		ОткрытьДопДанные(ТекНОменклатура,ТекСайт);
	КонецЕсли;
КонецПроцедуры

Процедура СоответствиеКатегорийИПапок(Кнопка,ЭтаФОрма,ИмяСписка) Экспорт
	
КонецПроцедуры

Процедура ОткрытьДопДанные(ТекНОменклатура,ТекСайт)
	з = Новый Запрос();
	з.Текст = "ВЫБРАТЬ
	|	CMS1C_Номенклатура.Ссылка
	|ИЗ
	|	Справочник.CMS1C_Номенклатура КАК CMS1C_Номенклатура
	|ГДЕ
	|	CMS1C_Номенклатура.Владелец = &Владелец
	|	И CMS1C_Номенклатура.НастройкаСайта = &НастройкаСайта";
	з.УстановитьПараметр("Владелец",ТекНоменклатура);
	з.УстановитьПараметр("НастройкаСайта",ТекСайт);
	Выб = з.Выполнить().Выбрать();
	Если ВЫб.Следующий() Тогда
		//ф = выб.Ссылка.ПолучитьФорму();
		//ф.Открыть();
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Ключ",Выб.Ссылка);
		ОткрытьФорму("Справочник.CMS1C_Номенклатура.Форма.ФормаЭлемента",СтруктураПараметров);
		
		Возврат;
	КонецЕсли;
	Если Вопрос("Карточка товара для сайта ещё не создана. Создать карточку сайта?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Об= Справочники.CMS1C_Номенклатура.СоздатьЭлемент();
	Об.Владелец = ТекНоменклатура;
	Об.НастройкаСайта = ТекСайт;
	Об.Наименование = ТекНоменклатура.Наименование;
	Об.Статус = Истина;
	
	Если ЗначениеЗаполнено(ТекНоменклатура.Родитель) Тогда
		з = Новый Запрос();
		з.Текст = "ВЫБРАТЬ
		|	CMS1C_Категории.Категория
		|ИЗ
		|	РегистрСведений.CMS1C_Категории КАК CMS1C_Категории
		|ГДЕ
		|	CMS1C_Категории.НастройкаСайта = &НастройкаСайта
		|	И CMS1C_Категории.ГруппаНоменклатуры = &ГруппаНоменклатуры";
		з.УстановитьПараметр("НастройкаСайта",ТекСайт);
		з.УстановитьПараметр("ГруппаНоменклатуры",ТекНОменклатура.Родитель);
		ВЫб = з.Выполнить().Выбрать();
		Если выб.Следующий() Тогда
			Об.Категория = ВЫб.Категория;
		КОнецЕсли;
	КонецЕсли;
	
	Об.Заполнить(Неопределено);
	//Ф = Об.ПолучитьФорму("ФормаЭлементаУправляемая");
	Структура = Новый сТруктура();
	Структура.Вставить("Ключ",Об);
	Структура.Вставить("НастройкаСайта",ТекСайт);
	Ф = ПолучитьФорму("Справочник.CMS1C_Номенклатура.ФормаОбъекта",Структура);
	ЗаполнитьЗначенияСвойств(Ф.Объект,Об,"Категория,Владелец,НастройкаСайта,Наименование,Статус,Налог,ТипТоваров");
	Ф.Открыть();
КонецПроцедуры

Процедура ОткрытьПомощникСопоставления(ТекНОменклатура,ТекСайт)
	ф = РегистрыСведений.CMS1C_Категории.ПолучитьФорму("ПомощникСопоставленияКатегорий");
	ф.НастройкаСайта = ТекСайт;
	Ф.ГруппаНоменклатуры = ТекНоменклатура;
	Ф.Открыть();
КонецПроцедуры

Процедура ЗаказыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоследнегоСтатуса = РегистрыСведений.CMS1C_ИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("Заказ",ДанныеСтроки.Ссылка));
	структураДопРеквизитовЗАказа = РегистрыСВедений.CMS1C_ДополнительныеРеквизитыЗаказа.Получить(Новый Структура("Заказ",ДанныеСтроки.Ссылка));
	СтатусСайта = СтруктураПоследнегоСтатуса.Статус;
	
	Если НЕ СтатусСайта.Пустая() Тогда 
		Цвет = СтатусСайта.ОсновнойЦвет.Получить();
		Если ТипЗнч(Цвет) = Тип("Цвет") Тогда 
		ОформлениеСтроки.ЦветФона = Цвет;	
		КонецЕсли;		
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.НомерСайта.УстановитьТекст(Формат(структураДопРеквизитовЗАказа.Номер,"ЧН=' '"));
	ОформлениеСтроки.Ячейки.ТипОплатыСайта.УстановитьТекст(структураДопРеквизитовЗАказа.ТипОплаты);
	ОформлениеСтроки.Ячейки.СтатусСайта.УстановитьТекст(СтатусСайта);
	ОформлениеСтроки.Ячейки.НастройкаСайта.УстановитьТекст(структураДопРеквизитовЗАказа.НастройкаСайта);
КонецПроцедуры
#КонецЕсли

Процедура ОткрытьФормуЗаказа(Элемент,ВыбраннаяСтрока) Экспорт
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Лев(Метаданные.Версия,2) = "10" Тогда
		ФормаЗаказа = Обработки.CMS1C_ОбработкаОбмена.ПолучитьФорму("ФормаЗаказа");
	Иначе
		ФормаЗаказа = Обработки.CMS1C_ОбработкаОбмена.ПолучитьФорму("ФормаЗаказа2_3");
	Конецесли;
	
	ФормаЗаказа.ДокументОбъект = ВыбраннаяСтрока.Ссылка.ПолучитьОбъект();
	ФормаЗаказа.Открыть();
КонецПроцедуры

Процедура ОткрытьФормуНовогоЗаказа(Элемент,ТекущаяСтрока,Копирование) Экспорт 
	ФормаЗаказа = Обработки.CMS1C_ОбработкаОбмена.ПолучитьФорму("ФормаЗаказа");
	
	Если Копирование Тогда
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ЗаказСКоторогоКопировать = ТекущаяСтрока.Ссылка;
		НовыйСкопированныйОбъект = ЗаказСКоторогоКопировать.Скопировать();
		ФормаЗаказа.ДокументОбъект = НовыйСкопированныйОбъект;
	Конецесли;
	ФормаЗаказа.Открыть();
КонецПроцедуры

Процедура УправлениеДоступностьюID(ЭлементыФормы) Экспорт
	Если Не CMS1C_ПроцедурыОбменаССайтом.УПользователяРольДоступна("ПолныеПрава") Тогда
		ЭлементыФормы.ID.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбменССайтомОткрытьНоменклатуру() Экспорт
	Форма = Обработки.CMS1C_ОбработкаОбмена.ПолучитьФорму("ФормаСпискаНоменклатуры");
	Форма.Открыть();
КонецПроцедуры

Процедура ОбменССайтомОткрытьФормуСпискаЗаказов() Экспорт
	Форма = Обработки.CMS1C_ОбработкаОбмена.ПолучитьФорму("ФормаСпискаЗаказов");
	Форма.Открыть();
КонецПроцедуры

Процедура ВывестиСообщение(IDСообщения,ТекстСообщения,Статус) Экспорт
	
КонецПроцедуры

Процедура ОбработатьИсключение(IDИсключения,ТекстСообщения) Экспорт
	
КонецПроцедуры
