
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++AK BATG 2018.12.12
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("Открытие формы Справочник.АК_ГруппыРассылки.ФормаЭлемента");
	//---AK BATG

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Пользователь=глЗначениеПеременной("глТекущийПользователь");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Попытка
		ВладелецФормы.Родитель.УстановитьОтбор();
	Исключение
	
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+++AK BATG 2018.12.12
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени("Открытие формы Справочник.АК_ГруппыРассылки.ФормаЭлемента", Объект.Наименование);
	//---AK BATG
КонецПроцедуры
