
Перем СтатьяДРАренда;
Перем масДокументовДляПерепроведения, бПроведение;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.НачислениеАренды Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипАренднойПлаты) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке № " + СтрокаТЧ.НомерСтроки + " не заполнен реквизит <Тип арендной платы>", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	ПроцедурыНачисления.ПроверитьЛимитыПоАрендеНачислениеАренднойПлаты(ЭтотОбъект.Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//+++АК ZICD 28.12.2016 ИП-00014363
	НачалоУчётаМСФО = АК_УчетМСФОПривилегированный.ПолучитьДатуНачалаУчетаМСФО();
	//---АК
	
	Движения.Финансовый.Записывать = Истина;
	
	ОрганизацияДляОплатыНаличными = Константы.ОрганизацияДляОплатыНаличными.Получить();
	
	НастройкаОтраженияОперацииВУчетеНДС = ОбщегоНазначенияСервер.ПолучитьНастройкиОтраженияОперацийВУчете(Перечисления.ВидыОперацийВУчете.НДС_НачислениеАренднойПлатыОтАрендодателей, Дата);
	Для Каждого Строка Из НачислениеАренды Цикл
		СуммаНДСПоСтроке = 0;
		СуммаВсего = 0;
		СуммаВсего = Строка.Сумма;
		Проводка = Движения.Финансовый.Добавить();
		Проводка.Период = Дата;
		//+++АК ZICD 28.12.2016 ИП-00014363
		Проводка.Организация = АК_УчетМСФО.ПолучитьОрганизациюПоДоговору(Строка.Договор, Проводка.Период, НачалоУчётаМСФО);
		//---АК
		Проводка.СчетДт = ПланыСчетов.Финансовый.ЗатратыТочекДляРаспределения;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ТорговыеТочки", Строка.СтруктурнаяЕдиница);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходовРасходов", СтатьяДРАренда);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ЦФО", Строка.ЦФО);
		Проводка.СчетКт = ПланыСчетов.Финансовый.РасчетыПоАренде;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Организации", ?(ФормаОплаты = Перечисления.ФормыОплаты.Наличные, ОрганизацияДляОплатыНаличными, Строка.Организация));
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Строка.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ТорговыеТочки", Строка.СтруктурнаяЕдиница);
		Часть=?(Строка.ТипАренднойПлаты=Перечисления.ТипыАренднойПлаты.ПостояннаяЧасть," постоянная часть "," переменная часть ");
		Проводка.Содержание = "НДФЛ "+Часть+" аренда за период с " + Формат(НачалоМесяца(Строка.ПериодРегистрации), "ДФ=dd.MM.yyyy") + " по " + Формат(КонецМесяца(Строка.ПериодРегистрации), "ДФ=dd.MM.yyyy");
		Проводка.Содержание = Проводка.Содержание + ?(СокрЛП(Проводка.Содержание) <> "" И СокрЛП(Строка.Описание) <> "", ". ", "") + СокрЛП(Строка.Описание);
		Проводка.Сумма = СуммаВсего;
	КонецЦикла;	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НачислениеАренды.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры


СтатьяДРАренда = Справочники.СтатьиДоходовРасходов.НайтиПоКоду("31010");

масДокументовДляПерепроведения = Новый Массив();
