
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если не ТекущиеДанные = Неопределено Тогда
		ПодключитьОбработчикОжидания("ЗаполнениеПредпросмотрФоторграфий",0.1,Истина);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПредпросмотрФоторграфий()
	ПредпросмотрФоторграфий = ЗаполнитьХМТЛ(Элементы.Список.ТекущиеДанные.ИдентификаторРаботы);	
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрФоторграфийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка 
		Если ДанныеСобытия.Element.name = "picture" Тогда
			ИндексСтроки = Число(ДанныеСобытия.Element.id);
			пИмяФайла = ТаблицаФотографий[ИндексСтроки].ПутьКФайлу;
			попытка
				ЗапуститьПриложение(пИмяФайла);
			исключение
				Картинка = Новый Картинка(пИмяФайла);
				АдресКартинки = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
				ПараметрыФормы = Новый Структура("КартинкаСсылка", АдресКартинки); 
				ОткрытьФорму("ОбщаяФорма.Фото", ПараметрыФормы);	
			КонецПопытки;
		КонецЕсли;
	Исключение
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьХМТЛ(ИдентификаторРаботы) Экспорт
	ПерезаполнитьТаблицуФотографий(ИдентификаторРаботы);
	ИндексСтрокиКартики = 0;	
	ПолныйТекстHTML = "
	|<html><body>
	|<table name = ""PictView"" scroling = ""no"">";	
	Для Каждого стр из ТаблицаФотографий Цикл
		ПолныйТекстHTML = ПолныйТекстHTML + "
		|<tr>";
		ИмяФайла = стр.ПутьКФайлу;
		ПолныйТекстHTML = ПолныйТекстHTML+ "
		|<td><table id=""" + ИндексСтрокиКартики + "_T" + """ border=""2"" cellpadding=""0"" bordercolor=#ffffff cellspacing=""0""><tr><td><img name=""picture"" width = 150 height=150 style = ""cursor: pointer"" id = """  + ИндексСтрокиКартики  + """ src = ""file:///" + СтрЗаменить(ИмяФайла, "\", "/") + """></td></tr></table></td>";	
		ПолныйТекстHTML = ПолныйТекстHTML + "
		|</tr>";
		ИндексСтрокиКартики = ИндексСтрокиКартики + 1;
	КонецЦикла;		
	ПолныйТекстHTML = ПолныйТекстHTML + "</body></html>";
	возврат ПолныйТекстHTML;
КонецФункции

&НаСервере
Процедура ПерезаполнитьТаблицуФотографий(ИдентификаторРаботы)
	ТаблицаФотографий.Очистить();
	КаталогХраненияФайловКартинок = Константы.МП_КаталогХраненияФайловЗадачМП.Получить();
	Если Прав(КаталогХраненияФайловКартинок, 1) <> "\" Тогда
		КаталогХраненияФайловКартинок = КаталогХраненияФайловКартинок + "\";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрикрепленныеФотоКОбъектам.ОтносительноеИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.ПрикрепленныеФотоКОбъектам КАК ПрикрепленныеФотоКОбъектам
	|ГДЕ
	|	ПрикрепленныеФотоКОбъектам.Объект = &УИН
	|	И ПрикрепленныеФотоКОбъектам.ТипЗаписи = ЗНАЧЕНИЕ(перечисление.ТипыЗаписейПриложенныхКартинок.РегламентнаяРабота)";
	Запрос.УстановитьПараметр("УИН",строка(ИдентификаторРаботы));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Файл = Новый Файл(КаталогХраненияФайловКартинок+Выборка.ИмяФайла);
		Если не Файл.Существует() Тогда 
		иначе
			стр = ТаблицаФотографий.Добавить();
			стр.ПутьКФайлу = КаталогХраненияФайловКартинок + Выборка.ИмяФайла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


