
Функция ПолучитьМассивЭлАдресовПоГруппеРассылки(АК_ГруппаРассылки) Экспорт
	
	МассивАдресов = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АК_ГруппыРассылки.Емейл КАК ЭлАдрес
		|ИЗ
		|	РегистрСведений.АК_ГруппыРассылки КАК АК_ГруппыРассылки
		|ГДЕ
		|	АК_ГруппыРассылки.Группа = &Группа
		|	И АК_ГруппыРассылки.Емейл <> """"");
	
	Запрос.УстановитьПараметр("Группа", АК_ГруппаРассылки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивАдресов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЭлАдрес");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивАдресов;
	
КонецФункции
