
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) //+++АК mika 2018.11.01 ИП-00019964
	
	СтрокаУведомления = "";
	
	СнятиеОжидаемогоПриходаЗапускРаспределенияСервер(ПараметрКоманды, СтрокаУведомления);
	
	Если ЗначениеЗаполнено(СтрокаУведомления) Тогда
		ПоказатьПредупреждение(, СтрокаУведомления);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СнятиеОжидаемогоПриходаЗапускРаспределенияСервер(МассивДокументов, СтрокаУведомления) //+++АК mika 2018.11.01 ИП-00019964 
	
	Обработки.РаспределениеТоваровПоТорговымТочкамПлюс.СнятиеОжидаемогоПриходаЗапускРаспределения(МассивДокументов, СтрокаУведомления);
	
КонецПроцедуры
