
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Холдинг = НайтиХолдинг();
	Если ЗначениеЗаполнено(Холдинг)Тогда
		Ответ = Вопрос("Контрагент " + Строка(Запись.Производитель) + " входит в холдинг " + Строка(Холдинг) + "." + Символы.ПС
				+ "Необходимо заменить производителя на " + Строка(Холдинг) + ". Заменить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Запись.Производитель = Холдинг;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиХолдинг()
	
	Холдинг = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СпрКонтрагенты.ГоловнойКонтрагент
	|ИЗ
	|	Справочник.Контрагенты КАК СпрКонтрагенты
	|ГДЕ
	|	СпрКонтрагенты.ГоловнойКонтрагент <> &ТекущийКонтрагент
	|	И СпрКонтрагенты.Ссылка = &ТекущийКонтрагент");
	
	Запрос.УстановитьПараметр("ТекущийКонтрагент", Запись.Производитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Холдинг = Выборка.ГоловнойКонтрагент;
	КонецЕсли;	
	
	Возврат Холдинг;
	
КонецФункции