////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьСтраницНаСервере();
	СтрукПараметры=Параметры.СтрукПараметры;
	Для каждого Эл Из СтрукПараметры Цикл
	    Попытка
		    ЭтаФорма[Эл.Ключ]=Эл.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницНаСервере()
	
	//// т.к. Расшифровка платежа теперь есть у многих видов операций,
	//// сначала отработаем формы-исключения
	//МассивСтраниц = Новый Массив;
	//МассивСтраниц.Добавить(Элементы.ГруппаПлатежПрочие);
	//МассивСтраниц.Добавить(Элементы.ГруппаПереводНаДругойСчет);
	//МассивСтраниц.Добавить(Элементы.ГруппаПеречислениеПодотчетномуЛицу);
	//МассивСтраниц.Добавить(Элементы.ГруппаПеречислениеЗарплатыСводно);
	//МассивСтраниц.Добавить(Элементы.ГруппаПеречислениеЗарплаты);
	//МассивСтраниц.Добавить(Элементы.ГруппаРасчетыСКонтрагентами);
	//МассивСтраниц.Добавить(Элементы.ГруппаВыплатаДепонентов);
	//МассивСтраниц.Добавить(Элементы.ГруппаВыдачаЗаймаРаботнику);
	//
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПлатежПрочие;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПлатежПрочие;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПереводНаДругойСчет;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПеречислениеПодотчетномуЛицу;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП Тогда
	//	Элементы.ГруппаВыплатаЗарплатыОперацииСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаЗарплатыПоВедомостям;
	//	Если ВедетсяУчетРасчетовПоЗарплатеСводно И УчетЗарплатыИКадровВоВнешнейПрограмме Тогда
	//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПеречислениеЗарплатыСводно;
	//	Иначе
	//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПеречислениеЗарплаты;
	//		Элементы.ГруппаВыплатаЗарплатыОперацииСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаЗарплатыПоВедомостям;
	//	КонецЕсли;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику Тогда
	//	Элементы.ГруппаВыплатаЗарплатыОперацииСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаЗарплатыПоОдномуРаботнику;
	//	Если ВедетсяУчетРасчетовПоЗарплатеСводно И УчетЗарплатыИКадровВоВнешнейПрограмме Тогда
	//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПеречислениеЗарплатыСводно;
	//	Иначе
	//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПеречислениеЗарплаты;
	//		Элементы.ГруппаВыплатаЗарплатыОперацииСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаЗарплатыПоОдномуРаботнику;
	//	КонецЕсли;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДепонентов Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаДепонентов;
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВыдачаЗаймаРаботнику Тогда
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыдачаЗаймаРаботнику;
	//Иначе
	//	// а затем тех, кто использует основную форму Расшифровки платежа
	//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРасчетыСКонтрагентами;
	//КонецЕсли;
	//
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику Тогда
	//	Если УчетЗарплатыИКадровВоВнешнейПрограмме И ИспользоватьФорматОбменаЗУП25 Тогда
	//		Элементы.ГруппаПеречислениеЗарплатыСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	//	Иначе
	//		Элементы.ГруппаПеречислениеЗарплатыСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДепонентов Тогда
	//	Если УчетЗарплатыИКадровВоВнешнейПрограмме И ВедетсяУчетРасчетовПоЗарплатеСводно Тогда
	//		Элементы.ГруппаВыплатаДепонентовСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаДепонентовПустая;
	//	Иначе
	//		Элементы.ГруппаВыплатаДепонентовСтраницы.ТекущаяСтраница = Элементы.ГруппаВыплатаДепонентовВедомость;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Для каждого ТекСтраница Из МассивСтраниц Цикл
	//	Если ТекСтраница <> Элементы.ГруппаСтраницы.ТекущаяСтраница Тогда
	//		Если ТекСтраница.Видимость Тогда
	//			ТекСтраница.Видимость = Ложь;
	//		КонецЕсли;
	//	Иначе
	//		Если НЕ ТекСтраница.Видимость Тогда
	//			ТекСтраница.Видимость = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры
