&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.НачалоМероприятия = Период.ДатаНачала;
	Объект.КонецМероприятия = Период.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Период.ДатаНачала = Объект.НачалоМероприятия;
	Период.ДатаОкончания = Объект.КонецМероприятия;
	ПериодОтчет.ДатаНачала = Объект.НачалоМероприятияОтчет;
	ПериодОтчет.ДатаОкончания = Объект.КонецМероприятиОтчет;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОрганизацииПриИзменении(Элемент)
	//СотрудникиОрганизацииПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СотрудникиОрганизацииПриИзмененииНаСервере()

	//Объект.ТабельныйНомер = Объект.СотрудникиОрганизации.Код;
	//Объект.ПодразделениеОрганизации = Объект.СотрудникиОрганизации.ПодразделениеОрганизации;
	//
	//Если Объект.СотрудникиОрганизации.Организация <> Объект.Организация Тогда
	//
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Внимание! Данный сотрудник  является работником другой организации!";
	//	Сообщение.Сообщить();
	//
	//КонецЕсли;

КонецПроцедуры // СотрудникиОрганизацииПриИзменении()

&НаСервере
Процедура ПроверитьОрганизацию()

	//Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.СотрудникиОрганизации)
	//	И Объект.СотрудникиОрганизации.Организация <> Объект.Организация 
	//	Тогда
	//
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Внимание! Данный сотрудник  является работником другой организации!";
	//	Сообщение.Сообщить();
	//
	//КонецЕсли;

КонецПроцедуры // ПроверитьОрганизацию()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//ПроверитьОрганизацию();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//ФормаВыбора = ПолучитьФорму("Справочник.Организации.ФормаВыбора",,Элемент);
	//
	//ФормаВыбора.Отбор.Ссылка.Использование = Истина;
	//ФормаВыбора.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	//ФормаВыбора.Отбор.Ссылка.Значение = ПолучитьСписокОрганизаций();
	//
	//ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОрганизаций()

	//Список = Новый СписокЗначений;
	//
	//Список.Добавить(Справочники.Организации.НайтиПоКоду("000000004"));
	//Список.Добавить(Справочники.Организации.НайтиПоКоду("000000006"));
	//Список.Добавить(Справочники.Организации.НайтиПоКоду("000000005"));
	//
	//Возврат Список;
	
КонецФункции // ПолучитьСписокОрганизаций()

&НаКлиенте
Процедура ПериодОтчетПриИзменении(Элемент)
	Объект.НачалоМероприятияОтчет = ПериодОтчет.ДатаНачала;
	Объект.КонецМероприятиОтчет = ПериодОтчет.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	
	Объект.ЦельОтчет = Объект.Цель;	
	Объект.НачалоМероприятияОтчет = Объект.НачалоМероприятия;	
	Объект.КонецМероприятиОтчет = Объект.КонецМероприятия;	
	Объект.МестоОтчет = Объект.Место;	
	Объект.СотрудникиОрганизацииОтчет = Объект.СотрудникиОрганизации;	
	Объект.ДолжностьОтчет = Объект.Должность;	
	Объект.ВидОтчет = Объект.Вид;	
	Объект.МестоСпискомОтчет = Объект.МестоСписком;	
	Объект.ОписаниеОтчет = Объект.Описание;	
	
	ПериодОтчет.ДатаНачала = Объект.НачалоМероприятияОтчет;
	ПериодОтчет.ДатаОкончания = Объект.КонецМероприятиОтчет;
	
	ЗаполнитьТЧНАСервере();
	УстановитьВидимость();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНАСервере()
	
	Объект.СписокМестОтчет.Загрузить(Объект.СписокМест.Выгрузить());
	
КонецПроцедуры // ()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.МестоПроведения.Видимость = Не объект.МестоСписком;	
	Элементы.МестоОтчет.Видимость = Не объект.МестоСпискомОтчет;	
	
	Элементы.СписокМест.Видимость = объект.МестоСписком;	
	Элементы.СписокМестОтчет.Видимость = объект.МестоСпискомОтчет;	
	
КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура МестоСпискомПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура МестоСпискомОтчетПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры




