
Функция ВернутьТаблицуКонтрагентовФинБазы(МассивИНН, МассивНаименований)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка,
	               |	Контрагенты.ИНН,
	               |	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200)) КАК НаименованиеПолное
	               |ПОМЕСТИТЬ Сводная
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ИНН В(&МассивИНН)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка,
	               |	Контрагенты.ИНН,
	               |	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200)) В (&МассивНаименований)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сводная.Ссылка,
	               |	Сводная.ИНН,
	               |	Сводная.НаименованиеПолное
	               |ИЗ
	               |	Сводная КАК Сводная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сводная.Ссылка,
	               |	Сводная.ИНН,
	               |	Сводная.НаименованиеПолное";
	
	Запрос.УстановитьПараметр("МассивИНН", МассивИНН);
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	Тз.Индексы.Добавить("ИНН, НаименованиеПолное");
	
	Возврат Тз;
	
КонецФункции

Функция ВернутьТаблицуОрганизацийФинБазы(МассивИНН, МассивНаименований)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка,
	               |	Организации.ИНН,
	               |	Организации.Наименование КАК Наименование
	               |ПОМЕСТИТЬ Сводная
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ИНН В(&МассивИНН)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Организации.Ссылка,
	               |	Организации.ИНН,
	               |	Организации.Наименование
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Наименование В (&МассивНаименований)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сводная.Ссылка,
	               |	Сводная.ИНН,
	               |	Сводная.Наименование
	               |ИЗ
	               |	Сводная КАК Сводная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сводная.Ссылка,
	               |	Сводная.ИНН,
	               |	Сводная.Наименование";
	
	Запрос.УстановитьПараметр("МассивИНН", МассивИНН);
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	Тз.Индексы.Добавить("ИНН, Наименование");
	
	Возврат Тз;
	
КонецФункции

Функция ВернутьТаблицудоговоровФинБазы(МассивКонтров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка,
	               |	ДоговорыКонтрагентов.Владелец,
	               |	ДоговорыКонтрагентов.Организация,
	               |	ДоговорыКонтрагентов.Код
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец В(&МассивКонтров)";
	
	Запрос.УстановитьПараметр("МассивКонтров", МассивКонтров);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроставитьДанныеФинВДанныхБух()
	
	//Контрагенты
	МассивИНН = Новый Массив;
	МассивНаименований = Новый Массив;
	МассивНеСопоставленныхКонтрагентов = Новый Массив;
		
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КонтрагентИНН) 
			И Стр.КонтрагентИНН <> "000000000000" Тогда
				МассивИНН.Добавить(Стр.КонтрагентИНН);
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Стр.Контрагент) Тогда
			МассивНаименований.Добавить(Стр.Контрагент);
		КонецЕсли;
			
	КонецЦикла;
		
	ТзКонтрФинБазы = ВернутьТаблицуКонтрагентовФинБазы(МассивИНН, МассивНаименований);

	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНайден = Ложь;
			
		Если ЗначениеЗаполнено(Стр.КонтрагентГуид) Тогда
			НайдКонтрГуид = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.КонтрагентГуид));
			
			Если ЗначениеЗаполнено(НайдКонтрГуид.Код) Тогда				
				Стр.КонтрагентФин = НайдКонтрГуид;
				КонтрагентНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ КонтрагентНайден Тогда
			
			НайдСтр = Неопределено;
			
			Если ЗначениеЗаполнено(Стр.КонтрагентИНН) И Стр.КонтрагентИНН <> "000000000000" Тогда				
				НайдСтр = ТзКонтрФинБазы.Найти(Стр.КонтрагентИНН, "ИНН");
			КонецЕсли;	
				
			Если НайдСтр = Неопределено И ЗначениеЗаполнено(Стр.Контрагент) Тогда
				НайдСтр = ТзКонтрФинБазы.Найти(Стр.Контрагент, "НаименованиеПолное");
			КонецЕсли;
			
			Если НайдСтр = Неопределено Тогда
				Стр.КонтрагентФин = Справочники.Контрагенты.ПустаяСсылка();				
				МассивНеСопоставленныхКонтрагентов.Добавить(Стр.Контрагент + " (ИНН:" + Стр.КонтрагентИНН + ");");
			Иначе				
				Стр.КонтрагентФин = НайдСтр.Ссылка;					
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивНеСопоставленныхКонтрагентов);
	
	Если МассивНеСопоставленныхКонтрагентов.Количество() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Внимание по следующим контрагентам Бух. базы не удалось однозначно сопоставить контрагента Фин. базы. Отбор по ним может работать некорректно: ");
		
		Для Каждого Контр Из МассивНеСопоставленныхКонтрагентов Цикл
			ОбщегоНазначения.СообщитьОбОшибке(Контр);
		КонецЦикла;
	КонецЕсли;
	
	//Организации
	МассивИНН = Новый Массив;
	МассивГУИД = Новый Массив;
	МассивНаименований = Новый Массив;
	МассивНеСопоставленныхОрганизаций = Новый Массив;
		
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Ссыль = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.ОрганизацияГУИД));
		
		Если ЗначениеЗаполнено(Ссыль.Код) Тогда
			Стр.ОрганизацияИНН = Ссыль;
		Иначе		
			Если ЗначениеЗаполнено(Стр.ОрганизацияИНН) Тогда
				МассивИНН.Добавить(Стр.ОрганизацияИНН);
			Иначе
				МассивНаименований.Добавить(Стр.Организация);
			КонецЕсли;
		КонецЕсли;	
			
	КонецЦикла;
		
	ТзОргФинБазы = ВернутьТаблицуОрганизацийФинБазы(МассивИНН, МассивНаименований);

	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.ОрганизацияФин) Тогда
			
			НайдСтр = Неопределено;
			
			Если ЗначениеЗаполнено(Стр.ОрганизацияИНН) Тогда				
				НайдСтр = ТзОргФинБазы.Найти(Стр.ОрганизацияИНН, "ИНН");
			КонецЕсли;	
				
			Если НайдСтр = Неопределено И ЗначениеЗаполнено(Стр.Организация) Тогда
				НайдСтр = ТзОргФинБазы.Найти(Стр.Организация, "Наименование");
			КонецЕсли;
			
			Если НайдСтр = Неопределено Тогда
				Стр.ОрганизацияФин = Справочники.Организации.ПустаяСсылка();				
				МассивНеСопоставленныхОрганизаций.Добавить(Стр.Организация + " (ИНН:" + Стр.ОрганизацияИНН + ");");
			Иначе				
				Стр.ОрганизацияФин = НайдСтр.Ссылка;					
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивНеСопоставленныхОрганизаций);
	
	Если МассивНеСопоставленныхОрганизаций.Количество() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Внимание по следующим организациям Бух. базы не удалось однозначно сопоставить организации Фин. базы: ");
		
		Для Каждого Орг Из МассивНеСопоставленныхОрганизаций Цикл
			ОбщегоНазначения.СообщитьОбОшибке(Орг);
		КонецЦикла;
	КонецЕсли;
	
	//Договоры
	МассивКонтров = Новый Массив;	
	МассивНеСопоставленныхДоговоров = Новый Массив;
		
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КонтрагентФин) И ЗначениеЗаполнено(Стр.ДоговорКод) Тогда
			МассивКонтров.Добавить(Стр.КонтрагентФин);
		КонецЕсли;
			
	КонецЦикла;
		
	ТзДогФинБазы = ВернутьТаблицудоговоровФинБазы(МассивКонтров);

	Для Каждого Стр Из ДанныеБух Цикл
		
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.ДоговорКод) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Владелец", Стр.КонтрагентФин);
		СтруктураПоиска.Вставить("Организация", Стр.ОрганизацияФин);
		СтруктураПоиска.Вставить("Код", Стр.ДоговорКод);
		
		НайдСтроки = ТзДогФинБазы.НайтиСтроки(СтруктураПоиска);
		
		Если НайдСтроки.Количество() Тогда
			Стр.ДоговорФин = НайдСтроки[0].Ссылка;
		Иначе
			СтрокаЗаписи = "Контрагент: " + Строка(Стр.КонтрагентФин) + ", договор (код): " + Стр.ДоговорКод;
			МассивНеСопоставленныхДоговоров.Добавить(СтрокаЗаписи);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивНеСопоставленныхДоговоров);
	
	Если МассивНеСопоставленныхДоговоров.Количество() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Внимание по следующим договорам Бух. базы не удалось однозначно сопоставить договора Фин. базы:");
		
		Для Каждого Контр Из МассивНеСопоставленныхДоговоров Цикл
			ОбщегоНазначения.СообщитьОбОшибке(Контр);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;		
 	
	ОбщегоНазначения.СообщитьОбОшибке("Выполняю подключение к Бухгалтерской базе", , , СтатусСообщения.Информация);
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось подключиться к базе бухгалтерии!");
		Возврат;
	КонецПопытки;
	
	Запрос=v82.NewObject("Запрос");
		
	ЗапросДанныеФинансов = Новый Запрос;
	
	ПТУ = Ложь;
	ДР = Ложь;
	
	НачалоПериода = Дата("00010101");
	КонецПериода = НачалоПериода;
	
	ДанныеБух.Очистить();
	ТаблицаФинансы.Очистить();
		
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="ПериодОтчета" Тогда
			
			НачалоПериода = Параметр.Значение.ДатаНачала;
			КонецПериода = КонецДня(Параметр.Значение.ДатаОкончания);
		
		ИначеЕсли СокрЛП(Параметр.Параметр) = "ПТУ" Тогда
			ПТУ = Параметр.Использование И Параметр.Значение = Истина;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "ДР" Тогда
			ДР = Параметр.Использование И Параметр.Значение = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) ИЛИ Не ЗначениеЗаполнено(КонецПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнены начало или конец периода отчета!");
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
			
	ЗапросДанныеФинансов.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросДанныеФинансов.УстановитьПараметр("КонецПериода", КонецПериода);
	
	СводнаяТаблица = Новый ТаблицаЗначений;
	СводнаяТаблица.Колонки.Добавить("Раздел");
	СводнаяТаблица.Колонки.Добавить("ДокументБух");
	СводнаяТаблица.Колонки.Добавить("ДокументФин");
	СводнаяТаблица.Колонки.Добавить("СуммаБух");
	СводнаяТаблица.Колонки.Добавить("СуммаФин");
	СводнаяТаблица.Колонки.Добавить("Контрагент");
	СводнаяТаблица.Колонки.Добавить("СтавкаНДСФин");
	СводнаяТаблица.Колонки.Добавить("СтавкаНДСБух");
	СводнаяТаблица.Колонки.Добавить("КомментарийБух");
	СводнаяТаблица.Колонки.Добавить("Ответственный");
	СводнаяТаблица.Колонки.Добавить("ТранспортныеУслуги");
	
	ДанныеБух.Очистить();
	ТаблицаФинансы.Очистить();
	
	//Аренда
	ЗапросДанныеФинансов.УстановитьПараметр("Счет6802", ПланыСчетов.Финансовый.НалогиУН);	
	ЗапросДанныеФинансов.Текст = "ВЫБРАТЬ
	                             |	ФинансовыйДвиженияССубконто.Регистратор КАК Док,
	                             |	ФинансовыйДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	                             |	ФинансовыйДвиженияССубконто.Организация КАК Организация,
	                             |	ФинансовыйДвиженияССубконто.Сумма КАК Сумма,
	                             |	ФинансовыйДвиженияССубконто.СубконтоКт2 КАК Контрагент,	                             
	                             |	ЛОЖЬ КАК Обработан
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.ДвиженияССубконто(&НачалоПериода, &КонецПериода, СчетДт = &Счет6802, , ) КАК ФинансовыйДвиженияССубконто
	                             |ГДЕ
	                             |	ФинансовыйДвиженияССубконто.Регистратор ССЫЛКА Документ.НачислениеАренднойПлатыОтАрендодателей
	                             |	И ФинансовыйДвиженияССубконто.Сумма <> 0
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	ФинансовыйДвиженияССубконто.Регистратор,
	                             |	ФинансовыйДвиженияССубконто.НомерСтроки,
	                             |	ФинансовыйДвиженияССубконто.Организация,
	                             |	ФинансовыйДвиженияССубконто.Сумма,
	                             |	ФинансовыйДвиженияССубконто.СубконтоКт2	                             
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	НомерСтроки
	                             |АВТОУПОРЯДОЧИВАНИЕ
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	Шапка.Номер КАК НомерПоиска,
	                             |	Шапка.Ответственный,
	                             |	Шапка.Ссылка КАК Док,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Организация,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.НомерСтроки,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Контрагент,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.СтруктурнаяЕдиница,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка,
	                             |	""Начисление аренды"" КАК ТипТаблицы,
	                             |	НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Договор,
								 //|	ВЫБОР
								 //|		КОГДА НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.ДатаАкта <> ДАТАВРЕМЯ(1, 1, 1)
								 //|			ТОГДА НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.ДатаАкта
								 //|		ИНАЧЕ Шапка.Дата
								 //|	КОНЕЦ КАК ДатаПоиска,
								 |	Шапка.Дата КАК ДатаПоиска,
	                             |	ПРЕДСТАВЛЕНИЕ(НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.СтавкаНДС) КАК СтавкаНДС
	                             |ПОМЕСТИТЬ ДокументыНачислениеАрендыСводная
	                             |ИЗ
	                             |	Документ.НачислениеАренднойПлатыОтАрендодателей КАК Шапка
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеАренднойПлатыОтАрендодателей.НачислениеАренды КАК НачислениеАренднойПлатыОтАрендодателейНачислениеАренды
	                             |		ПО Шапка.Ссылка = НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка
	                             |ГДЕ
	                             |	Шапка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                             |	И Шапка.Проведен
	                             |	И НЕ НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка ЕСТЬ NULL
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	Шапка.Номер,
	                             |	Шапка.Ответственный,
	                             |	Шапка.Ссылка,
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Организация,
	                             |	0,
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Контрагент,
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.СтруктурнаяЕдиницаКт,
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Ссылка,
	                             |	""Прочая задолженность"",
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Договор,
	                             |	НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Ссылка.Дата,
	                             |	NULL
	                             |ИЗ
	                             |	Документ.НачислениеАренднойПлатыОтАрендодателей КАК Шапка
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеАренднойПлатыОтАрендодателей.ПрочаяЗадолженность КАК НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность
	                             |		ПО Шапка.Ссылка = НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Ссылка
	                             |ГДЕ
	                             |	Шапка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                             |	И Шапка.Проведен
	                             |	И НЕ НачислениеАренднойПлатыОтАрендодателейПрочаяЗадолженность.Ссылка ЕСТЬ NULL
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	Сводная.Док,
	                             |	Сводная.НомерПоиска,
	                             |	Сводная.Ответственный,
	                             |	Сводная.Организация,
	                             |	Сводная.Контрагент,
	                             |	Сводная.НомерСтроки КАК НомерСтроки,
	                             |	Сводная.ТипТаблицы,
	                             |	Сводная.Договор,
	                             |	Сводная.ДатаПоиска,
	                             |	Сводная.СтавкаНДС,
	                             |	0 КАК Сумма
	                             |ИЗ
	                             |	ДокументыНачислениеАрендыСводная КАК Сводная
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	Сводная.Контрагент,
	                             |	Сводная.НомерПоиска,
	                             |	Сводная.Док,
	                             |	Сводная.СтавкаНДС,
	                             |	Сводная.Ответственный,
	                             |	Сводная.Организация,
	                             |	Сводная.Договор,
	                             |	Сводная.ТипТаблицы,
	                             |	Сводная.ДатаПоиска,
	                             |	Сводная.НомерСтроки
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	НомерСтроки
	                             |АВТОУПОРЯДОЧИВАНИЕ";
	
	ОбщегоНазначения.СообщитьОбОшибке("Выполняю запрос по аренде", , , СтатусСообщения.Информация);
	
	//т.к. суммы НДС в документах нет, то иду на такой финт. Сортирую по номеру строки ТЧ документов и проводки.
	//по каждой строке из ТЧ документа ищу первую необработанную сумму по НДС в разрезе Контр+док+орг. Ей ставлю признак обработан, чтобы еще раз на нее не 
	//натыкаться. В итоге, даже если в документе в двух строках будет один и тот же контрагент и организация, то однозначно подберу сумму НДС для каждой из
	//этих строк - корректную.
	Результат = ЗапросДанныеФинансов.ВыполнитьПакет();
	
	ТаблицаПроводок = Результат[0].Выгрузить();
	ТаблицаДанныеДок = Результат[2].Выгрузить();
	
	ТаблицаПроводок.Индексы.Добавить("Док,Контрагент,Обработан,Организация");
	
	ТаблицаАренды = ТаблицаДанныеДок.Скопировать();
	ТаблицаАренды.Очистить();
	
	СтруктураПоиска = Новый Структура;
	
	Для Каждого Стр Из ТаблицаДанныеДок Цикл
		
		СтруктураПоиска.Вставить("Док", Стр.Док);
		СтруктураПоиска.Вставить("Контрагент", Стр.Контрагент);
		СтруктураПоиска.Вставить("Организация", Стр.Организация);
		СтруктураПоиска.Вставить("Обработан", Ложь);
		
		НайдСтроки = ТаблицаПроводок.НайтиСтроки(СтруктураПоиска);
		
		Если НайдСтроки.Количество() Тогда
			НСтр = НайдСтроки[0];
			
			НСтр.Обработан = Истина;
			
			НовСтр = ТаблицаАренды.Добавить();			
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.Сумма = НСтр.Сумма;
		КонецЕсли;                                 			
		
	КонецЦикла; 	
		
	Сч = 0;
	КолВо = ТаблицаАренды.Количество();
	
	ТаблицаАренды.Колонки.Добавить("Комментарий");
	
	Для Каждого Стр Из ТаблицаАренды Цикл
		Стр.Комментарий = "(" + СокрЛП(Стр.НомерПоиска) + "," + ?(Стр.ТипТаблицы = "Начисление аренды", Строка(Стр.НомерСтроки) + ")", Стр.ТипТаблицы);		
		Сч = Сч + 1;		
	КонецЦикла;	
	
	ТекстЗапросаБУ = "";
	
	Если ПТУ Тогда
	
		ТекстЗапросаБУ = "ВЫБРАТЬ
		                 |	ХозрасчетныйДвиженияССубконто.Регистратор
		                 |ПОМЕСТИТЬ Документы_С_Проводками
		                 |ИЗ
		                 |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		                 |			&НачалоПериода,
		                 |			&КонецПериода,
		                 |			Счет В ИЕРАРХИИ (&Счет19)
		                 |				И (Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		                 |					ИЛИ Регистратор ССЫЛКА Документ.КорректировкаПоступления),
		                 |			,
		                 |			) КАК ХозрасчетныйДвиженияССубконто
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ХозрасчетныйДвиженияССубконто.Регистратор
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	""ПТУ"" КАК Раздел,
		                 |	ПоступлениеТоваровУслуг.Ссылка КАК ДокументСсылка,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ссылка) КАК Документ,
		                 |	ПоступлениеТоваровУслуг.Контрагент КАК КонтрагентСсылка,
		                 |	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200)) КАК Контрагент,
		                 |	Контрагенты.ИНН КАК КонтрагентИНН,
		                 |	ПоступлениеТоваровУслуг.Номер КАК НомерПоиска,
		                 |	ПоступлениеТоваровУслуг.Дата КАК ДатаПоиска,
		                 |	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, ДЕНЬ) КАК ДатаПоискаАренды,
		                 |	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.Комментарий КАК СТРОКА(200)) КАК Комментарий,
		                 |	ПоступлениеТоваровУслуг.Организация КАК Организация,
		                 |	Организации.ИНН КАК ОрганизацияИНН,
		                 |	ДоговорыКонтрагентов.Код КАК ДоговорКод
		                 |ПОМЕСТИТЬ ШапкаПТУ
		                 |ИЗ
		                 |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		                 |		ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		                 |		ПО ПоступлениеТоваровУслуг.Организация = Организации.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		                 |		ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
		                 |		ПО ПоступлениеТоваровУслуг.Ссылка = ОтложенныеДвиженияДокументов.Документ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документы_С_Проводками КАК Документы_С_Проводками
		                 |		ПО (Документы_С_Проводками.Регистратор = ПоступлениеТоваровУслуг.Ссылка)
		                 |ГДЕ
		                 |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		                 |	И ПоступлениеТоваровУслуг.УчитыватьНДС
		                 |	И ВЫБОР
		                 |			КОГДА НЕ ПоступлениеТоваровУслуг.Проведен
		                 |				ТОГДА НЕ ОтложенныеДвиженияДокументов.Документ ЕСТЬ NULL
		                 |						И НЕ Документы_С_Проводками.Регистратор ЕСТЬ NULL
		                 |			ИНАЧЕ ПоступлениеТоваровУслуг.Проведен
		                 |		КОНЕЦ
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией,
		                 |	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
		                 |	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
		                 |ПОМЕСТИТЬ ВТ_ДокументыСПретензиями
		                 |ИЗ
		                 |	РегистрСведений.АК_ОтражениеПретензийПеревозчикам КАК АК_ОтражениеПретензийПеревозчикам
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК НДСЗаписиКнигиПокупокОбороты
		                 |		ПО АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией = НДСЗаписиКнигиПокупокОбороты.Регистратор
		                 |ГДЕ
		                 |	АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		                 |	И АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией.Проведен
		                 |	И АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией.УчитыватьНДС
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	АК_ОтражениеПретензийПеревозчикам.ДокументСПретензией,
		                 |	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
		                 |	НДСЗаписиКнигиПокупокОбороты.НДСОборот
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
		                 |	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС
		                 |ПОМЕСТИТЬ ОбъединениеПТУ
		                 |ИЗ
		                 |	ШапкаПТУ КАК ШапкаПТУ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		                 |		ПО ШапкаПТУ.ДокументСсылка = ПоступлениеТоваровУслугТовары.Ссылка
		                 |			И (ПоступлениеТоваровУслугТовары.СчетУчетаНДС В ИЕРАРХИИ (&Счет19))
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыСПретензиями КАК ВТ_ДокументыСПретензиями
		                 |		ПО ШапкаПТУ.ДокументСсылка = ВТ_ДокументыСПретензиями.ДокументСПретензией
		                 |ГДЕ
		                 |	НЕ ПоступлениеТоваровУслугТовары.Номенклатура ЕСТЬ NULL
		                 |	И ВТ_ДокументыСПретензиями.ДокументСПретензией ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугТовары.СтавкаНДС)
		                 |
		                 |ОБЪЕДИНИТЬ ВСЕ
		                 |
		                 |ВЫБРАТЬ
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ПРЕДСТАВЛЕНИЕ(ВТ_ДокументыСПретензиями.СтавкаНДС),
		                 |	СУММА(ВТ_ДокументыСПретензиями.СуммаНДС)
		                 |ИЗ
		                 |	ШапкаПТУ КАК ШапкаПТУ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыСПретензиями КАК ВТ_ДокументыСПретензиями
		                 |		ПО ШапкаПТУ.ДокументСсылка = ВТ_ДокументыСПретензиями.ДокументСПретензией
		                 |ГДЕ
		                 |	НЕ ВТ_ДокументыСПретензиями.ДокументСПретензией ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ПРЕДСТАВЛЕНИЕ(ВТ_ДокументыСПретензиями.СтавкаНДС)
		                 |
		                 |ОБЪЕДИНИТЬ ВСЕ
		                 |
		                 |ВЫБРАТЬ
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.СтавкаНДС),
		                 |	СУММА(ПоступлениеТоваровУслугУслуги.СуммаНДС)
		                 |ИЗ
		                 |	ШапкаПТУ КАК ШапкаПТУ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		                 |		ПО ШапкаПТУ.ДокументСсылка = ПоступлениеТоваровУслугУслуги.Ссылка
		                 |			И (ПоступлениеТоваровУслугУслуги.СчетУчетаНДС В ИЕРАРХИИ (&Счет19))
		                 |ГДЕ
		                 |	НЕ ПоступлениеТоваровУслугУслуги.Номенклатура ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.СтавкаНДС)
		                 |
		                 |ОБЪЕДИНИТЬ ВСЕ
		                 |
		                 |ВЫБРАТЬ
		                 |	ШапкаПТУ.Раздел,
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугОборудование.СтавкаНДС),
		                 |	СУММА(ПоступлениеТоваровУслугОборудование.СуммаНДС)
		                 |ИЗ
		                 |	ШапкаПТУ КАК ШапкаПТУ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
		                 |		ПО ШапкаПТУ.ДокументСсылка = ПоступлениеТоваровУслугОборудование.Ссылка
		                 |			И (ПоступлениеТоваровУслугОборудование.СчетУчетаНДС В ИЕРАРХИИ (&Счет19))
		                 |ГДЕ
		                 |	НЕ ПоступлениеТоваровУслугОборудование.Номенклатура ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаПТУ.ДокументСсылка,
		                 |	ШапкаПТУ.КонтрагентСсылка,
		                 |	ШапкаПТУ.Организация,
		                 |	ШапкаПТУ.Контрагент,
		                 |	ШапкаПТУ.ДоговорКод,
		                 |	ШапкаПТУ.ДатаПоиска,
		                 |	ШапкаПТУ.Комментарий,
		                 |	ШапкаПТУ.НомерПоиска,
		                 |	ШапкаПТУ.Документ,
		                 |	ШапкаПТУ.КонтрагентИНН,
		                 |	ШапкаПТУ.ДатаПоискаАренды,
		                 |	ШапкаПТУ.ОрганизацияИНН,
		                 |	ШапкаПТУ.Раздел,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугОборудование.СтавкаНДС)
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ ШапкаПТУ
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ОбъединениеПТУ.Раздел,
		                 |	ОбъединениеПТУ.ДокументСсылка,
		                 |	ОбъединениеПТУ.Документ,
		                 |	ОбъединениеПТУ.КонтрагентСсылка,
		                 |	ОбъединениеПТУ.Контрагент,
		                 |	ОбъединениеПТУ.КонтрагентИНН,
		                 |	ОбъединениеПТУ.НомерПоиска,
		                 |	ОбъединениеПТУ.ДатаПоиска,
		                 |	ОбъединениеПТУ.ДатаПоискаАренды,
		                 |	ОбъединениеПТУ.Комментарий,
		                 |	ОбъединениеПТУ.Организация,
		                 |	ОбъединениеПТУ.ОрганизацияИНН,
		                 |	ОбъединениеПТУ.ДоговорКод,
		                 |	ОбъединениеПТУ.СтавкаНДС,
		                 |	СУММА(ОбъединениеПТУ.СуммаНДС) КАК СуммаНДС
		                 |ПОМЕСТИТЬ СводнаяПТУ
		                 |ИЗ
		                 |	ОбъединениеПТУ КАК ОбъединениеПТУ
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ОбъединениеПТУ.Раздел,
		                 |	ОбъединениеПТУ.КонтрагентСсылка,
		                 |	ОбъединениеПТУ.Контрагент,
		                 |	ОбъединениеПТУ.ДокументСсылка,
		                 |	ОбъединениеПТУ.Документ,
		                 |	ОбъединениеПТУ.КонтрагентИНН,
		                 |	ОбъединениеПТУ.НомерПоиска,
		                 |	ОбъединениеПТУ.ДатаПоиска,
		                 |	ОбъединениеПТУ.ДатаПоискаАренды,
		                 |	ОбъединениеПТУ.Комментарий,
		                 |	ОбъединениеПТУ.Организация,
		                 |	ОбъединениеПТУ.ОрганизацияИНН,
		                 |	ОбъединениеПТУ.ДоговорКод,
		                 |	ОбъединениеПТУ.СтавкаНДС
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ ОбъединениеПТУ
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ПоступлениеТоваровУслуг.Ссылка КАК ДокументСсылка,
		                 |	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ссылка) КАК Документ,
		                 |	ПоступлениеТоваровУслуг.Контрагент КАК КонтрагентСсылка,
		                 |	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200)) КАК Контрагент,
		                 |	Контрагенты.ИНН КАК КонтрагентИНН,
		                 |	ПоступлениеТоваровУслуг.Номер КАК НомерПоиска,
		                 |	ПоступлениеТоваровУслуг.Дата КАК ДатаПоиска,
		                 |	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, ДЕНЬ) КАК ДатаПоискаАренды,
		                 |	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.Комментарий КАК СТРОКА(200)) КАК Комментарий,
		                 |	""ПТУ"" КАК Раздел,
		                 |	ПоступлениеТоваровУслуг.Организация,
		                 |	Организации.ИНН КАК ОрганизацияИНН,
		                 |	ДоговорыКонтрагентов.Код КАК ДоговорКод,
		                 |	КорректировкаПоступления.Ссылка КАК КоррСсылка
		                 |ПОМЕСТИТЬ ШапкаКорр
		                 |ИЗ
		                 |	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		                 |		ПО КорректировкаПоступления.ДокументПоступления = ПоступлениеТоваровУслуг.Ссылка
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		                 |		ПО (ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Ссылка)
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		                 |		ПО (ПоступлениеТоваровУслуг.Организация = Организации.Ссылка)
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		                 |		ПО (ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
		                 |		ПО КорректировкаПоступления.Ссылка = ОтложенныеДвиженияДокументов.Документ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документы_С_Проводками КАК Документы_С_Проводками
		                 |		ПО (Документы_С_Проводками.Регистратор = КорректировкаПоступления.Ссылка)
		                 |ГДЕ
		                 |	ВЫБОР
		                 |			КОГДА НЕ КорректировкаПоступления.Проведен
		                 |				ТОГДА НЕ ОтложенныеДвиженияДокументов.Документ ЕСТЬ NULL
		                 |						И НЕ Документы_С_Проводками.Регистратор ЕСТЬ NULL
		                 |			ИНАЧЕ КорректировкаПоступления.Проведен
		                 |		КОНЕЦ
		                 |	И КорректировкаПоступления.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		                 |	И КорректировкаПоступления.УчитыватьНДС
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ШапкаКорр.ДокументСсылка,
		                 |	ШапкаКорр.Документ,
		                 |	ШапкаКорр.КонтрагентСсылка,
		                 |	ШапкаКорр.Контрагент,
		                 |	ШапкаКорр.КонтрагентИНН,
		                 |	ШапкаКорр.НомерПоиска,
		                 |	ШапкаКорр.ДатаПоиска,
		                 |	ШапкаКорр.ДатаПоискаАренды,
		                 |	ШапкаКорр.Комментарий,
		                 |	ШапкаКорр.Раздел,
		                 |	ШапкаКорр.Организация,
		                 |	ШапкаКорр.ОрганизацияИНН,
		                 |	ШапкаКорр.ДоговорКод,
		                 |	ШапкаКорр.КоррСсылка,
		                 |	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступленияТовары.СтавкаНДС) КАК СтавкаНДС,
		                 |	СУММА(КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения) КАК СуммаНДС
		                 |ПОМЕСТИТЬ ОбъединениеКорр
		                 |ИЗ
		                 |	ШапкаКорр КАК ШапкаКорр
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
		                 |		ПО ШапкаКорр.КоррСсылка = КорректировкаПоступленияТовары.Ссылка
		                 |			И (КорректировкаПоступленияТовары.СчетУчетаНДС В ИЕРАРХИИ (&Счет19))
		                 |			И (КорректировкаПоступленияТовары.СуммаНДСДоИзменения - КорректировкаПоступленияТовары.СуммаНДС <> 0)
		                 |ГДЕ
		                 |	НЕ КорректировкаПоступленияТовары.Номенклатура ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаКорр.ДоговорКод,
		                 |	ШапкаКорр.ДатаПоискаАренды,
		                 |	ШапкаКорр.Организация,
		                 |	ШапкаКорр.ОрганизацияИНН,
		                 |	ШапкаКорр.Контрагент,
		                 |	ШапкаКорр.ДокументСсылка,
		                 |	ШапкаКорр.Раздел,
		                 |	ШапкаКорр.КонтрагентИНН,
		                 |	ШапкаКорр.КонтрагентСсылка,
		                 |	ШапкаКорр.КоррСсылка,
		                 |	ШапкаКорр.Документ,
		                 |	ШапкаКорр.Комментарий,
		                 |	ШапкаКорр.ДатаПоиска,
		                 |	ШапкаКорр.НомерПоиска,
		                 |	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступленияТовары.СтавкаНДС)
		                 |
		                 |ОБЪЕДИНИТЬ ВСЕ
		                 |
		                 |ВЫБРАТЬ
		                 |	ШапкаКорр.ДокументСсылка,
		                 |	ШапкаКорр.Документ,
		                 |	ШапкаКорр.КонтрагентСсылка,
		                 |	ШапкаКорр.Контрагент,
		                 |	ШапкаКорр.КонтрагентИНН,
		                 |	ШапкаКорр.НомерПоиска,
		                 |	ШапкаКорр.ДатаПоиска,
		                 |	ШапкаКорр.ДатаПоискаАренды,
		                 |	ШапкаКорр.Комментарий,
		                 |	ШапкаКорр.Раздел,
		                 |	ШапкаКорр.Организация,
		                 |	ШапкаКорр.ОрганизацияИНН,
		                 |	ШапкаКорр.ДоговорКод,
		                 |	ШапкаКорр.КоррСсылка,
		                 |	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступленияУслуги.СтавкаНДС),
		                 |	СУММА(КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения)
		                 |ИЗ
		                 |	ШапкаКорр КАК ШапкаКорр
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		                 |		ПО ШапкаКорр.КоррСсылка = КорректировкаПоступленияУслуги.Ссылка
		                 |			И (КорректировкаПоступленияУслуги.СуммаНДСДоИзменения - КорректировкаПоступленияУслуги.СуммаНДС <> 0)
		                 |			И (КорректировкаПоступленияУслуги.СчетУчетаНДС В ИЕРАРХИИ (&Счет19))
		                 |ГДЕ
		                 |	НЕ КорректировкаПоступленияУслуги.Номенклатура ЕСТЬ NULL
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ШапкаКорр.КонтрагентСсылка,
		                 |	ШапкаКорр.ДоговорКод,
		                 |	ШапкаКорр.ДокументСсылка,
		                 |	ШапкаКорр.НомерПоиска,
		                 |	ШапкаКорр.КоррСсылка,
		                 |	ШапкаКорр.ДатаПоискаАренды,
		                 |	ШапкаКорр.КонтрагентИНН,
		                 |	ШапкаКорр.Контрагент,
		                 |	ШапкаКорр.Комментарий,
		                 |	ШапкаКорр.ДатаПоиска,
		                 |	ШапкаКорр.Документ,
		                 |	ШапкаКорр.Организация,
		                 |	ШапкаКорр.ОрганизацияИНН,
		                 |	ШапкаКорр.Раздел,
		                 |	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступленияУслуги.СтавкаНДС)
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ ШапкаКорр
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ОбъединениеКорр.ДокументСсылка,
		                 |	ОбъединениеКорр.Документ,
		                 |	ОбъединениеКорр.КонтрагентСсылка,
		                 |	ОбъединениеКорр.Контрагент,
		                 |	ОбъединениеКорр.КонтрагентИНН,
		                 |	ОбъединениеКорр.НомерПоиска,
		                 |	ОбъединениеКорр.ДатаПоиска,
		                 |	ОбъединениеКорр.ДатаПоискаАренды,
		                 |	ОбъединениеКорр.Комментарий,
		                 |	ОбъединениеКорр.Раздел,
		                 |	ОбъединениеКорр.Организация,
		                 |	ОбъединениеКорр.ОрганизацияИНН,
		                 |	ОбъединениеКорр.ДоговорКод,
		                 |	ОбъединениеКорр.КоррСсылка,
		                 |	ОбъединениеКорр.СтавкаНДС,
		                 |	СУММА(ОбъединениеКорр.СуммаНДС) КАК СуммаНДС
		                 |ПОМЕСТИТЬ СводнаяКорр
		                 |ИЗ
		                 |	ОбъединениеКорр КАК ОбъединениеКорр
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ОбъединениеКорр.ОрганизацияИНН,
		                 |	ОбъединениеКорр.КоррСсылка,
		                 |	ОбъединениеКорр.СтавкаНДС,
		                 |	ОбъединениеКорр.КонтрагентСсылка,
		                 |	ОбъединениеКорр.Организация,
		                 |	ОбъединениеКорр.НомерПоиска,
		                 |	ОбъединениеКорр.Документ,
		                 |	ОбъединениеКорр.ДоговорКод,
		                 |	ОбъединениеКорр.Контрагент,
		                 |	ОбъединениеКорр.ДатаПоиска,
		                 |	ОбъединениеКорр.ДокументСсылка,
		                 |	ОбъединениеКорр.ДатаПоискаАренды,
		                 |	ОбъединениеКорр.Раздел,
		                 |	ОбъединениеКорр.КонтрагентИНН,
		                 |	ОбъединениеКорр.Комментарий
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ ОбъединениеКорр
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	СводнаяПТУ.Раздел,
		                 |	СводнаяПТУ.ДокументСсылка,
		                 |	СводнаяПТУ.Документ,
		                 |	СводнаяПТУ.КонтрагентСсылка,
		                 |	СводнаяПТУ.Контрагент,
		                 |	СводнаяПТУ.КонтрагентИНН,
		                 |	СводнаяПТУ.НомерПоиска,
		                 |	СводнаяПТУ.ДатаПоиска,
		                 |	СводнаяПТУ.ДатаПоискаАренды,
		                 |	СводнаяПТУ.Комментарий,
		                 |	СводнаяПТУ.Организация,
		                 |	СводнаяПТУ.ОрганизацияИНН,
		                 |	СводнаяПТУ.ДоговорКод,
		                 |	СводнаяПТУ.СтавкаНДС,
		                 |	СводнаяПТУ.СуммаНДС
		                 |ПОМЕСТИТЬ ОбъединениеПТУКорр
		                 |ИЗ
		                 |	СводнаяПТУ КАК СводнаяПТУ
		                 |
		                 |ОБЪЕДИНИТЬ ВСЕ
		                 |
		                 |ВЫБРАТЬ
		                 |	СводнаяКорр.Раздел,
		                 |	СводнаяКорр.ДокументСсылка,
		                 |	СводнаяКорр.Документ,
		                 |	СводнаяКорр.КонтрагентСсылка,
		                 |	СводнаяКорр.Контрагент,
		                 |	СводнаяКорр.КонтрагентИНН,
		                 |	СводнаяКорр.НомерПоиска,
		                 |	СводнаяКорр.ДатаПоиска,
		                 |	СводнаяКорр.ДатаПоискаАренды,
		                 |	СводнаяКорр.Комментарий,
		                 |	СводнаяКорр.Организация,
		                 |	СводнаяКорр.ОрганизацияИНН,
		                 |	СводнаяКорр.ДоговорКод,
		                 |	СводнаяКорр.СтавкаНДС,
		                 |	СводнаяКорр.СуммаНДС
		                 |ИЗ
		                 |	СводнаяКорр КАК СводнаяКорр
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ СводнаяПТУ
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ СводнаяКорр
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ОбъединениеПТУКорр.Раздел,
		                 |	ОбъединениеПТУКорр.ДокументСсылка,
		                 |	ОбъединениеПТУКорр.Документ,
		                 |	ОбъединениеПТУКорр.КонтрагентСсылка,
		                 |	ОбъединениеПТУКорр.Контрагент,
		                 |	ОбъединениеПТУКорр.КонтрагентИНН,
		                 |	ОбъединениеПТУКорр.НомерПоиска,
		                 |	ОбъединениеПТУКорр.ДатаПоиска,
		                 |	ОбъединениеПТУКорр.ДатаПоискаАренды,
		                 |	ОбъединениеПТУКорр.Комментарий,
		                 |	ОбъединениеПТУКорр.Организация,
		                 |	ОбъединениеПТУКорр.ОрганизацияИНН,
		                 |	ОбъединениеПТУКорр.ДоговорКод,
		                 |	ОбъединениеПТУКорр.СтавкаНДС,
		                 |	СУММА(ОбъединениеПТУКорр.СуммаНДС) КАК Сумма
		                 |ПОМЕСТИТЬ СводнаяТаблица
		                 |ИЗ
		                 |	ОбъединениеПТУКорр КАК ОбъединениеПТУКорр
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ОбъединениеПТУКорр.ДатаПоиска,
		                 |	ОбъединениеПТУКорр.СтавкаНДС,
		                 |	ОбъединениеПТУКорр.ДоговорКод,
		                 |	ОбъединениеПТУКорр.ДатаПоискаАренды,
		                 |	ОбъединениеПТУКорр.Комментарий,
		                 |	ОбъединениеПТУКорр.ОрганизацияИНН,
		                 |	ОбъединениеПТУКорр.Организация,
		                 |	ОбъединениеПТУКорр.Контрагент,
		                 |	ОбъединениеПТУКорр.КонтрагентИНН,
		                 |	ОбъединениеПТУКорр.Раздел,
		                 |	ОбъединениеПТУКорр.НомерПоиска,
		                 |	ОбъединениеПТУКорр.КонтрагентСсылка,
		                 |	ОбъединениеПТУКорр.Документ,
		                 |	ОбъединениеПТУКорр.ДокументСсылка
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	СводнаяТаблица.ДокументСсылка
		                 |ПОМЕСТИТЬ ВыборкаПТУ
		                 |ИЗ
		                 |	СводнаяТаблица КАК СводнаяТаблица
		                 |ГДЕ
		                 |	СводнаяТаблица.ДокументСсылка ССЫЛКА Документ.ПоступлениеТоваровУслуг
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	ВыборкаПТУ.ДокументСсылка
		                 |ПОМЕСТИТЬ ДокументыПоАренде
		                 |ИЗ
		                 |	ВыборкаПТУ КАК ВыборкаПТУ
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		                 |		ПО ВыборкаПТУ.ДокументСсылка = ПоступлениеТоваровУслугУслуги.Ссылка
		                 |ГДЕ
		                 |	ПоступлениеТоваровУслугУслуги.Номенклатура В(&НоменклатураАренда)
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |УНИЧТОЖИТЬ ВыборкаПТУ
		                 |;
		                 |
		                 |////////////////////////////////////////////////////////////////////////////////
		                 |ВЫБРАТЬ
		                 |	СводнаяТаблица.ДокументСсылка,
		                 |	СводнаяТаблица.Документ,
		                 |	СводнаяТаблица.КонтрагентСсылка,
		                 |	СводнаяТаблица.Контрагент,
		                 |	СводнаяТаблица.КонтрагентИНН,
		                 |	СводнаяТаблица.НомерПоиска,
		                 |	СводнаяТаблица.ДатаПоиска,
		                 |	СводнаяТаблица.ДатаПоискаАренды,
		                 |	СводнаяТаблица.Комментарий,
		                 |	СводнаяТаблица.Раздел,
		                 |	СводнаяТаблица.Организация,
		                 |	СводнаяТаблица.ОрганизацияИНН,
		                 |	СводнаяТаблица.ДоговорКод,
		                 |	СводнаяТаблица.СтавкаНДС,
		                 |	СводнаяТаблица.Сумма,
		                 |	ВЫБОР
		                 |		КОГДА ДокументыПоАренде.ДокументСсылка ЕСТЬ NULL
		                 |			ТОГДА ЛОЖЬ
		                 |		ИНАЧЕ ИСТИНА
		                 |	КОНЕЦ КАК ЭтоАренда
		                 |ИЗ
		                 |	СводнаяТаблица КАК СводнаяТаблица
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПоАренде КАК ДокументыПоАренде
		                 |		ПО СводнаяТаблица.ДокументСсылка = ДокументыПоАренде.ДокументСсылка";
		
	КонецЕсли;
	
	Если ДР Тогда
		
		Если ЗначениеЗаполнено(ТекстЗапросаБУ) Тогда
			ТекстЗапросаБУ = ТекстЗапросаБУ + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|";
		КонецЕсли;
		
		ТекстЗапросаБУ = ТекстЗапросаБУ + "ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК ДокументСсылка,
		|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОбороты.Регистратор) КАК Документ,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.Контрагенты) КАК КонтрагентСсылка,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.Контрагенты).НаименованиеПолное КАК СТРОКА(200)) КАК Контрагент,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.Контрагенты).ИНН КАК КонтрагентИНН,
		|	ХозрасчетныйОбороты.Регистратор.Номер КАК НомерПоиска,
		|	ХозрасчетныйОбороты.Регистратор.Дата КАК ДатаПоиска,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоискаАренды,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Комментарий КАК СТРОКА(200)),
		|	""ДР"",
		|	ХозрасчетныйОбороты.Регистратор.Организация,
		|	ХозрасчетныйОбороты.Регистратор.Организация.ИНН,
		|	"""",
		|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОбороты.Регистратор.СтавкаНДС) КАК СтавкаНДС,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК Сумма,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&Счет19), , , , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПоступлениеДопРасходов

		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Регистратор,
		|	ХозрасчетныйОбороты.Регистратор.Номер,
		|	ХозрасчетныйОбороты.Регистратор.Дата,
		|	ХозрасчетныйОбороты.Регистратор.Организация,
		|	ХозрасчетныйОбороты.КорСубконто1,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Комментарий КАК СТРОКА(200)),
		|	ХозрасчетныйОбороты.Регистратор.Организация.ИНН,
		|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОбороты.Регистратор.СтавкаНДС)";		
		
	КонецЕсли;
			
	ОбщегоНазначения.СообщитьОбОшибке("Выполняю запрос Бухгалтерской базы", , , СтатусСообщения.Информация);
	
	Запрос.Текст=ТекстЗапросаБУ;
	Запрос.УстановитьПараметр("Счет19", v82.ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям);
	
	МД = v82.XMLTypeOf(v82.Справочники.Номенклатура.ПустаяСсылка());

	СписокАренда = v82.NewObject("СписокЗначений");
	СписокАренда.Добавить(v82.XMLValue(v82.FromXMLType(МД), "6c6750ae-d70b-11e1-8a91-000c29e4e694")); //аренда помещений
	СписокАренда.Добавить(v82.XMLValue(v82.FromXMLType(МД), "4a7763d6-f62d-11e0-b0a6-000c29e4e68a")); //аренда помещений (переменка)
	
	Запрос.УстановитьПараметр("НоменклатураАренда", СписокАренда);
						
	Выборка=Запрос.Выполнить().Выбрать();
	
	ОбщегоНазначения.СообщитьОбОшибке("Обрабатываю выборку бухгалтерской базы", , , СтатусСообщения.Информация);
	
	Пока Выборка.Следующий() Цикл
		НС=ДанныеБух.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.НомерПоиска = СокрЛП(НС.НомерПоиска);					
		НС.ГУИД = v82.XMLСтрока(Выборка.ДокументСсылка); 		
		НС.ОрганизацияГУИД = v82.XMLСтрока(Выборка.Организация);
		НС.КонтрагентГуид = v82.XMLСтрока(Выборка.КонтрагентСсылка);			
	КонецЦикла;
	
	ДанныеБух.Свернуть("НомерПоиска,Документ,ДатаПоиска, ГУИД, Раздел, Обработан, Контрагент, КонтрагентГуид, КонтрагентИНН, Комментарий, ДоговорФин, ОрганизацияФин, КонтрагентФин, ОрганизацияГУИД, ОрганизацияИНН, Организация, ДоговорКод, ДатаПоискаАренды, ЭтоАренда, СтавкаНДС", "Сумма");
	
	ТекстЗапросаФинансы = "";
	
	Если ПТУ Тогда
	
		ТекстЗапросаФинансы = "ВЫБРАТЬ
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор
		                      |	КОНЕЦ КАК Док,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Ответственный
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Ответственный
		                      |	КОНЕЦ КАК Ответственный,
		                      |	""ПТУ"" КАК Раздел,
		                      |	СУММА(ФинансовыйОбороты.СуммаОборотДт) КАК Сумма,
		                      |	ФинансовыйОбороты.КорСубконто2 КАК Контрагент,
		                      |	ПРЕДСТАВЛЕНИЕ(ФинансовыйОбороты.Субконто3) КАК СтавкаНДС,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Дата
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Дата
		                      |	КОНЕЦ КАК ДатаПоиска,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Номер
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Номер
		                      |	КОНЕЦ КАК НомерПоиска
		                      |ИЗ
		                      |	РегистрБухгалтерии.Финансовый.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет = &Счет6802, , , , ) КАК ФинансовыйОбороты
		                      |ГДЕ
		                      |	(ФинансовыйОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		                      |			ИЛИ ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ФинансовыйОбороты.КорСубконто2,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Ответственный
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Ответственный
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Дата
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Дата
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА ФинансовыйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
		                      |			ТОГДА ФинансовыйОбороты.Регистратор.ИсправляемыйДокументПоступления.Номер
		                      |		ИНАЧЕ ФинансовыйОбороты.Регистратор.Номер
		                      |	КОНЕЦ,
		                      |	ПРЕДСТАВЛЕНИЕ(ФинансовыйОбороты.Субконто3)";
		
	КонецЕсли;
	
	Если ДР Тогда
		
		Если ЗначениеЗаполнено(ТекстЗапросаФинансы) Тогда
			ТекстЗапросаФинансы = ТекстЗапросаФинансы + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|";
		КонецЕсли;
		
		ТекстЗапросаФинансы = ТекстЗапросаФинансы + "ВЫБРАТЬ
									|	ФинансовыйОбороты.Регистратор КАК Док,
									|	ФинансовыйОбороты.Регистратор.Ответственный,
									|	""ДР"",
									//|	ФинансовыйОбороты.Счет,
									|	СУММА(ФинансовыйОбороты.СуммаОборотДт) КАК Сумма,
									|	ФинансовыйОбороты.КорСубконто2 КАК Контрагент,
									|	ПРЕДСТАВЛЕНИЕ(ФинансовыйОбороты.Субконто3) КАК СтавкаНДС,
									|	ФинансовыйОбороты.Регистратор.Дата КАК ДатаПоиска,
									|	ФинансовыйОбороты.Регистратор.Номер КАК НомерПоиска
									|ИЗ
									|	РегистрБухгалтерии.Финансовый.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет = &Счет6802, , , , ) КАК ФинансовыйОбороты
									|ГДЕ
									|	ФинансовыйОбороты.Регистратор ССЫЛКА Документ.ПоступлениеДопРасходов
									|
		                            |СГРУППИРОВАТЬ ПО
		                            |	ФинансовыйОбороты.Счет,
		                            |	ФинансовыйОбороты.Регистратор,
		                            |	ФинансовыйОбороты.Регистратор.Дата,
		                            |	ФинансовыйОбороты.Регистратор.Номер,ФинансовыйОбороты.Регистратор.Ответственный,
		                            |	ФинансовыйОбороты.КорСубконто2,
		                            |	ПРЕДСТАВЛЕНИЕ(ФинансовыйОбороты.Субконто3)";
		
	КонецЕсли;
	
	//Транспортные услуги - отдельно.
	ТекстЗапросаФинансыТУ = "";
	
	Если ПТУ Тогда
	
		ТекстЗапросаФинансыТУ =   ";
								 |ВЫБРАТЬ
	                             |	ПоступлениеТоваровУслуг.Ссылка КАК Док,
	                             |	ПоступлениеТоваровУслуг.Ответственный,
	                             |	""ПТУ"" КАК Раздел,
	                             |	0 КАК Сумма,
	                             |	ПоступлениеТоваровУслуг.Контрагент,
	                             |	ИСТИНА КАК ТранспортныеУслуги
	                             |ИЗ
	                             |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                             |ГДЕ
	                             |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                             |	И ПоступлениеТоваровУслуг.ТранспортныеУслуги";
		
	КонецЕсли;
	
	Если ДР Тогда
		
		Если ЗначениеЗаполнено(ТекстЗапросаФинансыТУ) Тогда
			ТекстЗапросаФинансыТУ = ТекстЗапросаФинансыТУ + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|";
		КонецЕсли;
		
		ТекстЗапросаФинансыТУ = ТекстЗапросаФинансыТУ + "ВЫБРАТЬ
	                             |	ПоступлениеДопРасходов.Ссылка,
	                             |	ПоступлениеДопРасходов.Ответственный,
	                             |	""ДР"",
	                             |	0,
	                             |	ПоступлениеДопРасходов.Контрагент,
	                             |	ИСТИНА
	                             |ИЗ
	                             |	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	                             |ГДЕ
	                             |	ПоступлениеДопРасходов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                             |	И ПоступлениеДопРасходов.ТранспортныеУслуги";
		
	КонецЕсли;

	ОбщегоНазначения.СообщитьОбОшибке("Выполняю запрос финансы", , , СтатусСообщения.Информация);
	ЗапросДанныеФинансов.Текст = ТекстЗапросаФинансы + Символы.ПС + ТекстЗапросаФинансыТУ;	

	ЗапросДанныеФинансов.УстановитьПараметр("Счет6802", ПланыСчетов.Финансовый.НалогиУН);
	
	Результат = ЗапросДанныеФинансов.ВыполнитьПакет();
	
	ТаблицаФинансы.Загрузить(Результат[0].Выгрузить());	
	ВыборкаТУ = Результат[1].Выбрать();
	
	Пока ВыборкаТУ.Следующий() Цикл
		НовСтр = ТаблицаФинансы.Найти(ВыборкаТУ.Док, "Док");
		
		Если НовСтр = Неопределено Тогда
			НовСтр = ТаблицаФинансы.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаТУ);
	КонецЦикла;
		
	Для Каждого Стр Из ТаблицаФинансы Цикл
		Стр.ГУИД = Строка(Стр.Док.УникальныйИдентификатор());		
		Стр.НомерПоиска = СокрЛП(Стр.НомерПоиска);				
	КонецЦикла;		
		
	ОбщегоНазначения.СообщитьОбОшибке("Сопоставляю данные финансов и данные бухгалтерии", , , СтатусСообщения.Информация);
	
	Сч = 0;
	Колво = ТаблицаФинансы.Количество();
		
	// сопоставляем
	Для Каждого Стр Из ТаблицаФинансы Цикл		
			
		Сч = Сч + 1;
				
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Раздел", Стр.Раздел);
		СтруктураПоиска.Вставить("ГУИД", Стр.ГУИД);			
		СтруктураПоиска.Вставить("Обработан", Ложь);
		
		Если НЕ Стр.ТранспортныеУслуги Тогда
			СтруктураПоиска.Вставить("СтавкаНДС", Стр.СтавкаНДС);
		КонецЕсли;
				
		НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
		Если НайдСтроки.Количество() = 0 И ТипЗнч(Стр.Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда		
			
			СтруктураПоиска.Удалить("СтавкаНДС");			
			НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);	
							
		КонецЕсли;
			
		НовСтр = СводнаяТаблица.Добавить();
		НовСтр.Раздел = ?(Стр.Раздел = "ПТУ", "Поступление товаров и услуг", "Поступление доп. расходов");
		НОвСтр.ДокументФин = Стр.Док;
		НовСтр.Контрагент = Стр.Контрагент;			
		НовСтр.СуммаФин = Стр.Сумма;
		НовСтр.СтавкаНДСФин = Стр.СтавкаНДС;
		НовСтр.Ответственный = Стр.Ответственный;
		НОвСтр.ТранспортныеУслуги = Стр.ТранспортныеУслуги;
		
		Если НайдСтроки.Количество() = 0 Тогда								
			НовСтр.ДокументБух = "ДОКУМЕНТ НЕ НАЙДЕН";				
			НовСтр.СуммаБух = 0;				
			НовСтр.СтавкаНДСБух = "";
			НовСтр.КомментарийБух = "";
		Иначе		
			НовСтр.ДокументБух = НайдСтроки[0].Документ;
			НовСтр.СуммаБух = НайдСтроки[0].Сумма;
			НовСтр.СтавкаНДСБух = НайдСтроки[0].СтавкаНДС;
			НовСтр.КомментарийБух = НайдСтроки[0].Комментарий;
			НайдСтроки[0].Обработан = Истина;
		КонецЕсли;	
			
	КонецЦикла;			
			
	ОбщегоНазначения.СообщитьОбОшибке("Проставляю данные фин в данные БУ", , , СтатусСообщения.Информация);
	ПроставитьДанныеФинВДанныхБух();
		
	//Исключаем аренду.
	ОбщегоНазначения.СообщитьОбОшибке("Обработка аренды", , , СтатусСообщения.Информация);
	МассивСтрБухДляУд = Новый Массив;
		
	СтруктураПоиска = Новый Структура;
		
	Сч = 0;
	Всего = ТаблицаАренды.Количество();	
		
	Для Каждого Стр Из ТаблицаАренды Цикл
		
		Сч = Сч + 1;
		
		//ОбщегоНазначения.СообщитьОбОшибке(Строка(Сч) + " из " + Строка(Всего), , , СтатусСообщения.Информация);
		
		СтруктураПоиска.Вставить("КонтрагентФин", Стр.Контрагент);
		СтруктураПоиска.Вставить("ДоговорФин", Стр.Договор);
		СтруктураПоиска.Вставить("ДатаПоискаАренды", НачалоДня(Стр.ДатаПоиска));
		СтруктураПоиска.Вставить("ОрганизацияФин", Стр.Организация);
		СтруктураПоиска.Вставить("Обработан", Ложь);
		
		НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПОиска);
		
		Для Каждого НСтр Из НайдСтроки Цикл
			
			//Сообщить("НСТР: " + НСтр.Комментарий + " ||| Стр: " + Стр.Комментарий);
			
			Если Найти(НСтр.Комментарий, Стр.Комментарий) Тогда
				
				//Сообщить("НСТР: " + НСтр.Комментарий + " ||| Стр: " + Стр.Комментарий);
				
				НайдСтроки[0].Обработан = Истина;
				
				НовСтр = СводнаяТаблица.Добавить();
				НовСтр.Раздел = "Аренда";
				НовСтр.Ответственный = Стр.Ответственный;
				НОвСтр.ДокументФин = Стр.Док;
				НовСтр.ДокументБух = НСтр.Документ;
				НовСтр.СуммаФин = Стр.Сумма;
				НовСтр.СуммаБух = НСтр.Сумма;
				НСтр.Обработан = Истина;
				НовСтр.Контрагент = Стр.Контрагент;
				НовСтр.КомментарийБух = НСтр.Комментарий;
				НовСтр.ТранспортныеУслуги = Ложь;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// сопоставляем
	Для Каждого Стр Из ДанныеБух Цикл
			
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;
			
		НовСтр = СводнаяТаблица.Добавить();
		НовСтр.Раздел = ?(Стр.ЭтоАренда, "Аренда", ?(Стр.Раздел = "ДР", "Поступление доп. расходов", "Поступление товаров и услуг"));
		НовСтр.Ответственный = Справочники.Пользователи.ПустаяСсылка();
		НОвСтр.ДокументФин = "ДОКУМЕНТ НЕ НАЙДЕН";
		НовСтр.ДокументБух = Стр.Документ;
		НовСтр.СуммаФин = 0;
		НовСтр.СуммаБух = Стр.Сумма;
		НовСтр.Контрагент = Стр.КонтрагентФин;		
		НовСтр.СтавкаНДСФин = "";
		НовСтр.СтавкаНДСБух = Стр.СтавкаНДС;
		НовСтр.КомментарийБух = Стр.Комментарий;
		НовСтр.ТранспортныеУслуги = ?(Найти(Стр.Комментарий, "Рейс") <> 0, Истина, Ложь);
							
	КонецЦикла;
	
	//исключаю транспорт
	ОбщегоНазначения.СообщитьОбОшибке("Завершение обработки", , , СтатусСообщения.Информация);
	МассивСтрДляУд = Новый Массив;
	
	Для Каждого Стр Из СводнаяТаблица Цикл
		Если Стр.ТранспортныеУслуги Тогда		
			МассивСтрДляУд.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из МассивСтрДляУд Цикл
		СводнаяТаблица.Удалить(Стр);
	КонецЦикла;
			
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
											Настройки, ДанныеРасшифровки);

	ВнешниеНаборыДанных=Новый Структура;

	ВнешниеНаборыДанных.Вставить("СводнаяТаблица",СводнаяТаблица);										
											
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
													   ДанныеРасшифровки);

	//Очищаем поле табличного документа

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры



