
&НаСервере
Процедура ЗаполнитьРегистр()
	
	ДатаОбработки = ДатаНачала;
	Счетчик = 0;
	НачатьТранзакцию();
	Пока ДатаОбработки <= ДатаОкончания Цикл
		Запись = РегистрыСведений.СоответствиеДатДнямНедели.СоздатьМенеджерЗаписи();
		Запись.Дата = ДатаОбработки;
		Запись.НомерНедели = НачатьСНомераНедели + Цел(Счетчик/7);
		Запись.Записать();
		Счетчик = Счетчик + 1;
		ДатаОбработки = ДатаОбработки + 86400;
	КонецЦикла;	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры	

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьРегистр();
	
КонецПроцедуры
