
Функция ПолучитьТекстЗапросаПоНеотработаннымЗадачамТехнолога(УсловиеПоМагазину, УсловиеПоДокументуОснованию, НеУчитыватьСамовывозСПустойДатой = Ложь) Экспорт
Перем ТекстЗапроса;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МП_ЗадачаТехнолога.Ссылка КАК Ссылка,
		|	МП_ЗадачаТехнолога.Магазин КАК Магазин
		|ИЗ
		|	Документ.МП_ЗадачаТехнолога КАК МП_ЗадачаТехнолога
		|ГДЕ
		|	НЕ МП_ЗадачаТехнолога.Проведен
		|	И НЕ МП_ЗадачаТехнолога.ПометкаУдаления
		|	И НЕ МП_ЗадачаТехнолога.Закрыта
		|	И МП_ЗадачаТехнолога.Магазин = &Магазин
		|	И МП_ЗадачаТехнолога.ДокументОснование = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МП_ЗадачаТехнолога.Ссылка,
		|	МП_ЗадачаТехнолога.Магазин
		|ИЗ
		|	Документ.МП_ЗадачаТехнолога КАК МП_ЗадачаТехнолога
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеТехнологаМагазинам КАК ЗаданиеТехнологаМагазинам
		//|		ПО МП_ЗадачаТехнолога.ДокументОснование = ЗаданиеТехнологаМагазинам.Ссылка
		|ГДЕ
		|	МП_ЗадачаТехнолога.Проведен
		|	И НЕ МП_ЗадачаТехнолога.ПометкаУдаления
		|	И НЕ МП_ЗадачаТехнолога.Закрыта
		|	И МП_ЗадачаТехнолога.Магазин = &Магазин
		|	И МП_ЗадачаТехнолога.ДокументОснование = &ДокументОснование
		|	И МП_ЗадачаТехнолога.ФактическаяДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ МП_ЗадачаТехнолога.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданийТехнологаМагазинам.УбратьСПолок)
		//|	И НЕ (МП_ЗадачаТехнолога.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданийТехнологаМагазинам.СамовывозСМагазинов) И ЗаданиеТехнологаМагазинам.ДатаВывоза = ДАТАВРЕМЯ(1,1,1))
		|	И НЕ МП_ЗадачаТехнолога.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданийТехнологаМагазинам.СамовывозСМагазинов)
		|
		|СГРУППИРОВАТЬ ПО
		|	МП_ЗадачаТехнолога.Ссылка,
		|	МП_ЗадачаТехнолога.Магазин
		|
		|ИМЕЮЩИЕ
		|	СУММА(МП_ЗадачаТехнолога.ПараметрыЗадачи.Количество) > 0";
	
	Если УсловиеПоМагазину = Ложь Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И МП_ЗадачаТехнолога.Магазин = &Магазин", "");
	КонецЕсли;
	
	Если УсловиеПоДокументуОснованию Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И НЕ МП_ЗадачаТехнолога.Закрыта", "");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И МП_ЗадачаТехнолога.ДокументОснование = &ДокументОснование", "");
	КонецЕсли;
	
	Если НеУчитыватьСамовывозСПустойДатой = Ложь Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			//"И НЕ (МП_ЗадачаТехнолога.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданийТехнологаМагазинам.СамовывозСМагазинов) И ЗаданиеТехнологаМагазинам.ДатаВывоза = ДАТАВРЕМЯ(1,1,1))", "");
			"И НЕ МП_ЗадачаТехнолога.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданийТехнологаМагазинам.СамовывозСМагазинов)", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция НеотработанныхЗадачТехнолога() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТорговаяТочкаПоАйпи) Тогда Возврат 0; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаПоНеотработаннымЗадачамТехнолога(Истина, Ложь, Истина));
	Запрос.УстановитьПараметр("Магазин", ПараметрыСеанса.ТорговаяТочкаПоАйпи);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВыборкаЗапроса.Количество();
	
КонецФункции // НеотработанныхЗадачТехнолога()
 