
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТорговаяТочкаПоАйпи) И (ПараметрыСеанса.НомерТочкиПоАйпи <> 999) Тогда
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		//	ЗадачиНаДегустациюНовинок.Отбор, "Магазин", ПараметрыСеанса.ТорговаяТочкаПоАйпи, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		//	ЗадачиТехнологаНаДегустацию.Отбор, "Магазин", ПараметрыСеанса.ТорговаяТочкаПоАйпи, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//Элементы.ЗадачиНаДегустациюНовинокМагазин.Видимость = Ложь;
		//Элементы.ЗадачиТехнологаНаДегустациюМагазин.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЗадачиНаДегустацию.Отбор, "Магазин", ПараметрыСеанса.ТорговаяТочкаПоАйпи, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.ЗадачиНаДегустациюМагазин.Видимость = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗадачиНаДегустацию.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	//ЗадачиНаДегустациюНовинок.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	//ЗадачиТехнологаНаДегустацию.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеЗадачиПриИзменении(Элемент)
	ЗадачиНаДегустацию.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	//ЗадачиНаДегустациюНовинок.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	//ЗадачиТехнологаНаДегустацию.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", ПоказатьВсеЗадачи);
	//Элементы.ЗадачиНаДегустациюНовинок.Обновить();
	Элементы.ЗадачиНаДегустацию.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиНаДегустациюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.ЗадачиНаДегустацию.ТекущиеДанные.Ссылка);
	
КонецПроцедуры
