
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Бессрочный Тогда
		Запись.ДействуетДо = '39990101';
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Запись.ДействуетДо) Тогда
		Отказ = Истина;
		Сообщить("Не указана дата окончания действия сертификата");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.ДействуетДо.Видимость = НЕ Запись.Бессрочный;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	
	НастроитьВидимость();
	
КонецПроцедуры
