
Функция Печать(ПараметрКоманды)
	
	Возврат Обработки.АК_ПечатьТТН.ПечатьТранспортнойНакладной(ПараметрКоманды);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Печать(ПараметрКоманды);
  	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	ТабДок.Показать("Печать транспортной накладной");
	
КонецПроцедуры
