
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ Тогда
		Если ЗначениеЗаполнено(ИмяФайла) Тогда
			ФайлОбъект = Новый Файл(ИмяФайла);
			УинФайла = ФайлОбъект.ИмяБезРасширения;
			
			Набор = РегистрыСведений.ПрикрепленныеФотоКОбъектам.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(Ссылка);
			ФайлОбъект = Новый Файл(ИмяФайла);
			УинФайла = ФайлОбъект.ИмяБезРасширения;
			Для Каждого СтрокаСостав Из Состав Цикл
				Запись = Набор.Добавить();
				Запись.Номенклатура = СтрокаСостав.Номенклатура;
				Запись.ТипЗаписи = Перечисления.ТипыЗаписейПриложенныхКартинок.ГостТУ;
				Запись.ОтносительноеИмяФайла = УинФайла + ФайлОбъект.Расширение;
				Запись.Расширение = СтрЗаменить(ФайлОбъект.Расширение, ".", "");
				Запись.УинЗаписи = УинФайла;
				Запись.Объект = Ссылка;
				Запись.ДатаДобавления = ТекущаяДата();
			КонецЦикла;	
			Набор.Записать();
			
		КонецЕсли;				   
					   
		
	КонецЕсли;	
	
КонецПроцедуры
