

Функция ПолучитьЗначениеПараметра(Источник, ИмяПараметра) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Источник = Источник;
	МенеджерЗаписи.ИмяПараметра = ИмяПараметра;
	МенеджерЗаписи.Прочитать();
	
	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Значение, Неопределено);
	
КонецФункции

Процедура УстановитьЗначениеПараметра(Источник, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Источник = Источник;
	МенеджерЗаписи.ИмяПараметра = ИмяПараметра;
	МенеджерЗаписи.Значение = ЗначениеПараметра;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
