
&НаКлиенте
Процедура Заполнить(Команда)
	Если ГрафикПогашенияЗайма.Количество()=0 Тогда
		Сообщить("Для заполнения графика должна быть строка с датой первого платежа");
	Иначе
		ПервыйВзнос=ГрафикПогашенияЗайма[0];
		ТекДата=ПервыйВзнос.ДатаПлатежа;
		Пока ГрафикПогашенияЗайма.Итог("Сумма")<Параметры.Заявка.СуммаДокумента Цикл
			НС=ГрафикПогашенияЗайма.Добавить();
			ТекДата=ДобавитьМесяц(ТекДата,1);
			НС.ДатаПлатежа=ТекДата;
			НС.Сумма=ПервыйВзнос.Сумма;
		КонецЦикла;	
		Если ГрафикПогашенияЗайма.Итог("Сумма")<>Параметры.Заявка.СуммаДокумента Тогда
			НС.Сумма=НС.Сумма-(ГрафикПогашенияЗайма.Итог("Сумма")-Параметры.Заявка.СуммаДокумента);
		КонецЕсли;	
	КонецЕсли;	
	Итог=ГрафикПогашенияЗайма.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Если ГрафикПогашенияЗайма.Итог("Сумма")<>Параметры.Заявка.СуммаДокумента Тогда
		Сообщить("Итог по графику не равен сумме документа-заявки, запись невозможна");
		Возврат;
	КонецЕсли;	
	Док=Параметры.Заявка.ПолучитьОбъект();
	Док.ГрафикПогашенияЗайма.Загрузить(ГрафикПогашенияЗайма.Выгрузить());
	Док.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры	

&НаКлиенте
Процедура ГрафикПриИзменении(Элемент)
	Итог=ГрафикПогашенияЗайма.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заявка=Параметры.Заявка;
	Заёмщик=Параметры.Заявка.Контрагент;
	СуммаЗайма=Параметры.Заявка.СуммаДокумента;
КонецПроцедуры
