
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НайденноеЗначение = Неопределено;
	Если Параметры.Свойство("Состав", НайденноеЗначение)Тогда
		
		ТЗСостав = РеквизитФормыВЗначение("Состав");
		ТЗСостав = НайденноеЗначение;
		ЗначениеВРеквизитФормы(ТЗСостав, "Состав");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажки(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьФлажки(ЗначениеПометки)
	
	ТЗСостав = РеквизитФормыВЗначение("Состав");
	ТЗСостав.ЗаполнитьЗначения(ЗначениеПометки, "Пометка");
	ЗначениеВРеквизитФормы(ТЗСостав, "Состав");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАктивностьФизЛиц(Команда)
	
	УстановитьАктивностьФизЛицНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАктивностьФизЛицНаСервере()
	
	ТЗСостав = РеквизитФормыВЗначение("Состав");
	
	НайденныеСтроки = ТЗСостав.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если Не ЗначениеЗаполнено(НайденнаяСтрока.ФизЛицо)Тогда
			Продолжить;
		КонецЕсли;
		
		ФЛОбъект = НайденнаяСтрока.ФизЛицо.ПолучитьОбъект();
		ФЛОбъект.Активный = НайденнаяСтрока.Активный;
		
		Попытка
			ФЛОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить флаг ""Ативный"" у физического лица " + Строка(ФЛОбъект));
		КонецПопытки;
		
	КонецЦикла;
	
	ТЗСостав = Справочники.СотрудникиОрганизаций.ПолучитьТаблицуИзмененийАктивностиФизЛиц();
	
	ЗначениеВРеквизитФормы(ТЗСостав, "Состав");
	
КонецПроцедуры



