
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сп=Новый СписокЗначений;
	Сп.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000243"));
	Сп.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000231"));

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");   
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
    ЭлементОтбора.Использование  = Истина;
    ЭлементОтбора.ПравоеЗначение = Сп;
КонецПроцедуры
