
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//
	ТабДок = Печать(ПараметрКоманды);
	
	//
	ТабДок.ОтображатьСетку			= Ложь;
	ТабДок.Защита					= Ложь;
	ТабДок.ТолькоПросмотр			= Истина;
	ТабДок.ОтображатьЗаголовки		= Ложь;
	ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
	ТабДок.РазмерКолонтитулаСнизу	= 0;
	ТабДок.РазмерКолонтитулаСверху 	= 0;
	ТабДок.ПолеСверху 				= 5;
	ТабДок.ПолеСнизу 				= 5;
	ТабДок.ПолеСлева 				= 5;
	ТабДок.ПолеСправа 				= 5;
	ТабДок.АвтоМасштаб				= Истина;
	
	//
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция Печать(ПараметрКоманды)
	
	Возврат Документы.ЗаявкаНаПечатьЭтикетки.ПечатьЗаявкаПотребителя(ПараметрКоманды);
	
КонецФункции

