
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если Вопрос("Желаете отправить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		СтруктураВозврата = Новый Структура;
		
		лкСписокДляОтправки_ТТ = Новый СписокЗначений;
		Для каждого ТекСтр Из Объект.СписокТТ Цикл
			
			лкСписокДляОтправки_ТТ.Добавить(ТекСтр.ТорговаяТочка);	
			
		КонецЦикла;
		
		лкСписокДляОтправки_Роли = Новый СписокЗначений;
		Для каждого ТекСтр Из Объект.СписокРолей Цикл
			
			лкСписокДляОтправки_Роли.Добавить(ТекСтр.Роль);	
			
		КонецЦикла;
		
		СтруктураВозврата.Вставить("ТТ", лкСписокДляОтправки_ТТ);		
		СтруктураВозврата.Вставить("Роли", лкСписокДляОтправки_Роли);
		СтруктураВозврата.Вставить("ВсемСменам", ВсемСменам);
		СтруктураВозврата.Вставить("СрокАктуальностиСообщения", СрокАктуальностиСообщения);
		
		Закрыть(СтруктураВозврата);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СрокАктуальностиСообщения = 0 Тогда 
		 СрокАктуальностиСообщения = 30;
	КонецЕсли;	
	
КонецПроцедуры

