&НаСервереБезКонтекста
Функция ЭтоАудитор()
	
	Возврат РольДоступна("АудиторТоваров");
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьПользователя()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоАудитор() Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Аудитор");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = ПолучитьПользователя();
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли; 
	
КонецПроцедуры


