
&НаКлиенте
Процедура Передать(Команда)
	
	Если ПроверитьЗаполнение()Тогда
		
		СтруктураНастроек = Новый Структура("Период, Помощник", Период, Помощник);
		Закрыть(СтруктураНастроек);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Параметры.Период;
	ТекущийПомощник = Параметры.ТекущийПомощник;
	Адрес = Параметры.Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТекущийПомощник, Адрес", ТекущийПомощник, Адрес);
	Помощник = ОткрытьФормуМодально("Обработка.ГрафикРаботыПродавцов_ТЗ.Форма.ФормаВыбораФизическогоЛица", ПараметрыОткрытия);
	
КонецПроцедуры
