Функция ПечатьШК(МассивСсылок) Экспорт
	
	ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Макет = Справочники.СоставПаллеты.ПолучитьМакет("Этикетка");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛистРасходныеОрдера.Ссылка.Маршрут КАК Маршрут,
	               |	МаршрутныйЛистРасходныеОрдера.Документ
	               |ИЗ
	               |	Документ.МаршрутныйЛист.РасходныеОрдера КАК МаршрутныйЛистРасходныеОрдера
	               |ГДЕ
	               |	МаршрутныйЛистРасходныеОрдера.Документ В(&Документ)
	               |	И МаршрутныйЛистРасходныеОрдера.Ссылка.ПометкаУдаления = ЛОЖЬ";
	МасРО=Новый Массив;
	Для каждого Эл Из МассивСсылок Цикл
		МасРО.Добавить(Эл.РасходныйОрдер);	
	КонецЦикла; 
	Запрос.УстановитьПараметр("Документ", МасРО);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Область = Макет.ПолучитьОбласть("Этикетка");
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	ТабДокИтог = Новый ТабличныйДокумент();
	Для каждого Ссылка Из МассивСсылок Цикл
		Если ТипЗнч(Ссылка.РасходныйОрдер)=Тип("ДокументСсылка.РасходныйОрдерСклад") Тогда
			ШтрихКод = "850" + Прав("000000000000" + Формат(Ссылка.ИД, "ЧГ=0"), 12);
			ТабДок = Новый ТабличныйДокумент();
			
			УчаствуетВМаршруте = "";
			
			Если Выборка.НайтиСледующий(Новый Структура("Документ",Ссылка.РасходныйОрдер)) Тогда
				УчаствуетВМаршруте = Выборка.Маршрут.Наименование+" "+Выборка.Маршрут.ПолноеНаименование;
			КонецЕсли;	
			Выборка.Сбросить();
			Область.Параметры.ТорговаяТочка = Ссылка.РасходныйОрдер.Получатель;
			
			Область.Параметры.Паллета = "ИД "+Ссылка.ИД+" "+Строка(Ссылка.РасходныйОрдер)+Символы.ПС+?(Ссылка.РасходныйОрдер.Склад.ДляШтучногоТовара,"Коробка склада штучного товара "+Строка(Ссылка.РасходныйОрдер.Склад),"Маршрут: " + УчаствуетВМаршруте);
			
			Рисунок 					= Область.Рисунки["ШтрихКод"];
			
			ПараметрыШК = Новый Структура();
			ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
			ПараметрыШК.Вставить("Высота", Рисунок.Высота);
			ПараметрыШК.Вставить("ТипКода", 4);
			ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
			ПараметрыШК.Вставить("РазмерШрифта", 10);
			ПараметрыШК.Вставить("Штрихкод", Штрихкод);
			Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
			Область.Параметры.ШК = ШтрихКод;
			ТабДок.Вывести(Область);
			Для каждого Стр Из Ссылка.Состав Цикл
				ОбластьСтр.Параметры.Заполнить(Стр);
				ТабДок.Вывести(ОбластьСтр);
			КонецЦикла; 
			Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			     ТабДокИтог.Вывести(ТабДок);
			Иначе
			     ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			     ТабДокИтог.Вывести(ТабДок);
			КонецЕсли; 
		Иначе	
			ШтрихКод = "850" + Прав("000000000000" + Формат(Ссылка.ИД, "ЧГ=0"), 12);
			ТабДок = Новый ТабличныйДокумент();
			
			Область.Параметры.ТорговаяТочка = "";
			
			Область.Параметры.Паллета = "ИД "+Ссылка.ИД+" "+Строка(Ссылка.РасходныйОрдер);
			
			Рисунок 					= Область.Рисунки["ШтрихКод"];
			
			ПараметрыШК = Новый Структура();
			ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
			ПараметрыШК.Вставить("Высота", Рисунок.Высота);
			ПараметрыШК.Вставить("ТипКода", 4);
			ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
			ПараметрыШК.Вставить("РазмерШрифта", 10);
			ПараметрыШК.Вставить("Штрихкод", Штрихкод);
			Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
			Область.Параметры.ШК = ШтрихКод;
			ТабДок.Вывести(Область);
			Для каждого Стр Из Ссылка.Состав Цикл
				ОбластьСтр.Параметры.Заполнить(Стр);
				ТабДок.Вывести(ОбластьСтр);
			КонецЦикла; 
			Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			     ТабДокИтог.Вывести(ТабДок);
			Иначе
			     ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			     ТабДокИтог.Вывести(ТабДок);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ТабДокИтог.КлючПараметровПечати = "ПараметрыПечати_ЭтикеткиУпаковки";
	Возврат ТабДокИтог;
	
КонецФункции
