
#Область ОбработчикиСобытий

//+++АК LATV 2018.10.18 ИП-00020107
Процедура ПриКопировании(ОбъектКопирования)

	ИД = 0;

КонецПроцедуры

//+++АК LATV 2018.10.18 ИП-00020107
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ИД = 0 Тогда
		Попытка
			НовыйИД = РегистрыСведений.НомераДокументов.ПолучитьИЗафиксироватьНовыйИдентификатор("Нумератор паллет", Отказ);
		Исключение
			Возврат;
		КонецПопытки;
		
		ЭтотОбъект.ИД = НовыйИД;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерСклад") Тогда
		Паллета = Справочники.СоставПаллеты.НайтиПоРеквизиту("РасходныйОрдер", РасходныйОрдер);
		Если ЗначениеЗаполнено(Паллета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Повторите попытку'"),,,, Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
