
//+++АК LATV 2018.08.09 ИП-00019120
Функция КодДляВыполненияВПериодическихЗаданиях(ТекущаяОбработка, Параметры) Экспорт

	ЗапросПолучателей = Новый Запрос();
	ЗапросПолучателей.Текст =
		"ВЫБРАТЬ
		|	ПериодическиеЗаданияПолучателиРассылки.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	Справочник.ПериодическиеЗадания.ПолучателиРассылки КАК ПериодическиеЗаданияПолучателиРассылки
		|ГДЕ
		|	ПериодическиеЗаданияПолучателиРассылки.Ссылка = &Задание";
	
	ЗапросПолучателей.УстановитьПараметр("Задание", ТекущаяОбработка);
	Получатели = ЗапросПолучателей.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	
	// Выполнение обработки
	ВыполняемаяОбработка = Обработки.РассылкаПоздравленийСотрудникам.Создать();
	
	ВыполняемаяОбработка.Открытки			= Параметры.Открытки;
	ВыполняемаяОбработка.ПолучателиКопий	= Получатели;
	
	ВыполняемаяОбработка.ПоздравитьСотрудников();

КонецФункции
