
&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НомерВходящегоДокумента", ЭтаФорма.НомерВходящегоДокумента);
	СтруктураВозврата.Вставить("ДатаВходящегоДокумента"	, ЭтаФорма.ДатаВходящегоДокумента);
	
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.НомерВходящегоДокумента	= Параметры.Номер;
	ЭтаФорма.ДатаВходящегоДокумента		= Параметры.Дата;
	
КонецПроцедуры
