
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Обработка.ГрафикРаботыВнештатныхСотрудников.Форма.Форма", , , , ПараметрыВыполненияКоманды.Окно);
	//+++АК mika 2018.08.09 ИП-00019475 "Статистика использования(Удалить)"↓
	ОбщегоНазначенияСервер.СтатистикаИспользованияПодсистемДобавитьЗапись(Новый Структура("Подсистема, ИмяОбъекта, ИмяФормы, ИмяЭлемента, ДопИнформация", 
			"Магазины", "ОбщаяКоманда.ГрафикРаботыВнештатныхСотрудников" , , ,"Обработка.ГрафикРаботыВнештатныхСотрудников.Форма.Форма")); 
	//---АК mika
КонецПроцедуры
