
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(АктНаСписание)
	ТабДок = Новый ТабличныйДокумент;
	АктНаОприходование(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура АктНаОприходование(ТабДок, ПараметрКоманды)
	Документы.ИнвентаризацияСклад.АктНаСписание(ТабДок, ПараметрКоманды,"НА ОПРИХОДОВАНИЕ");
КонецПроцедуры
