
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Заявка", ПараметрКоманды);
	Форма = ПолучитьФорму("Документ.АК_ЗаявкаНаВнеплановоеОбслуживание.Форма.ФормаКопирования",ПараметрыФормы);
	Форма.Открыть();
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.АК_ЗаявкаНаВнеплановоеОбслуживание.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
