
&НаКлиенте
Процедура ПечатьШК(Команда)
	ТД=ПечатьШКСервер();
	ТД.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьШКСервер() Экспорт
	
	ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Макет = Обработки.ПечатьШКБольшихКоробок.ПолучитьМакет("Этикетка");
	
	
	Область = Макет.ПолучитьОбласть("Этикетка");
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	ТабДокИтог = Новый ТабличныйДокумент();
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Характеристика,
	               |	ТЗ.КоличествоКоробок
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтриховыеКоды.Номенклатура,
	               |	ШтриховыеКоды.Характеристика,
	               |	МАКСИМУМ(ШтриховыеКоды.ШтрихКод) КАК ШтрихКод,
	               |	вт.КоличествоКоробок
	               |ИЗ
	               |	РегистрСведений.ШтриховыеКоды КАК ШтриховыеКоды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО ШтриховыеКоды.Номенклатура = вт.Номенклатура
	               |			И ШтриховыеКоды.Характеристика = вт.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ШтриховыеКоды.Номенклатура,
	               |	ШтриховыеКоды.Характеристика,
	               |	вт.КоличествоКоробок";
	Запрос.УстановитьПараметр("ТЗ", Объект.Товары.Выгрузить());
	Выб=Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		
		ШтрихКод = "88" + Прав(Выб.Штрихкод,СтрДлина(Выб.Штрихкод)-2)+Строка(Формат(Выб.КоличествоКоробок, "ЧЦ=5; ЧВН=; ЧГ="));
		ТабДок = Новый ТабличныйДокумент();
		
		
		
		Рисунок 					= Область.Рисунки["ШтрихКод"];
		
		ПараметрыШК = Новый Структура();
		ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
		ПараметрыШК.Вставить("Высота", Рисунок.Высота);
		ПараметрыШК.Вставить("ТипКода", 4);
		ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШК.Вставить("РазмерШрифта", 10);
		ПараметрыШК.Вставить("Штрихкод", Штрихкод);
		Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
		Область.Параметры.ШК = ШтрихКод;
		ТабДок.Вывести(Область);
		ОбластьСтр.Параметры.Заполнить(Выб);
		ТабДок.Вывести(ОбластьСтр);
		Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			 ТабДокИтог.Вывести(ТабДок);
		Иначе
			 ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			 ТабДокИтог.Вывести(ТабДок);
		КонецЕсли; 
	КонецЦикла; 
	
	ТабДокИтог.КлючПараметровПечати = "ПараметрыПечати_ЭтикеткиБольшихКоробок";
	Возврат ТабДокИтог;
	
КонецФункции
