//+++АК Susk (Суслин К.В.) 2018.02.15 ИП-00017786 
&НаКлиенте
Процедура Заполнить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("СчетЗатрат", СчетЗатрат);
	Результат.Вставить("Субконто1" , Субконто1);
	Результат.Вставить("Субконто2" , Субконто2);
	Результат.Вставить("Субконто3" , Субконто3);	
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры 

//+++АК Susk (Суслин К.В.) 2018.02.15 ИП-00017786
&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

//+++АК Susk (Суслин К.В.) 2018.02.15 ИП-00017786
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетЗатрат") Тогда	
		СчетЗатрат = Параметры.СчетЗатрат;
	КонецЕсли;
	
КонецПроцедуры

//+++АК Susk (Суслин К.В.) 2018.02.15 ИП-00017786
&НаКлиенте
Процедура СчетЗатратПриИзменении(Элемент)
	
	ПриВыбореСчета(СчетЗатрат, Субконто1, Элементы.Субконто1, 
			Субконто2, Элементы.Субконто2, 
			Субконто3, Элементы.Субконто3);			
	
КонецПроцедуры

//+++АК Susk (Суслин К.В.) 2018.02.15 ИП-00017786
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриВыбореСчета(СчетЗатрат, Субконто1, Элементы.Субконто1, 
			Субконто2, Элементы.Субконто2, 
			Субконто3, Элементы.Субконто3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореСчета(Счет, Субконто1, НадписьСубконто1, Субконто2, НадписьСубконто2, Субконто3, НадписьСубконто3) 
	
	ЭлементыСубконто = Новый Структура("Субконто1,НадписьСубконто1,Субконто2,НадписьСубконто2,Субконто3,НадписьСубконто3", Субконто1, НадписьСубконто1, Субконто2, НадписьСубконто2, Субконто3, НадписьСубконто3);
	
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		
		ЭлементыСубконто["НадписьСубконто" + Сч].Видимость = НЕ ТолькоПросмотр;
		ЭлементыСубконто["НадписьСубконто" + Сч].ВыбиратьТип = Ложь;
		
		Если ЭлементыСубконто["Субконто" + Сч] = Неопределено ИЛИ ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]) <> ЭлементыСубконто["Субконто" + Сч] Тогда
			ЭлементыСубконто["Субконто" + Сч] = ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]);
		КонецЕсли;

		ЭлементыСубконто["НадписьСубконто" + Сч].Заголовок = Счет.ВидыСубконто[Сч - 1].ВидСубконто.Наименование;
		ЭлементыСубконто["НадписьСубконто" + Сч].Видимость = НЕ ТолькоПросмотр;
		
		Выполнить("Субконто" + Сч + " = ЭлементыСубконто[""Субконто"" + Сч]");
		
	КонецЦикла;	

КонецПроцедуры