
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
	ЗначенияЗаполнения = Новый Структура("Поставщик",Контрагент);
	ПараметрыФормы = Новый Структура("Поставщик,ЗначенияЗаполнения",Контрагент,ЗначенияЗаполнения);
	ОткрытьФорму("РегистрСведений.АК_НастройкиРассылокПоставщикамТехнологам.ФормаЗаписи",ПараметрыФормы);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры)=Тип("ДанныеФормыСтруктура") тогда
		Параметры.Свойство("Контрагент",Контрагент);
		Элементы.Поставщик.Видимость=НЕ ЗначениеЗаполнено(Контрагент);
		Элементы.Контрагент.Видимость=НЕ Элементы.Поставщик.Видимость;
	КонецЕсли;
КонецПроцедуры

