
Процедура ЗаполнитьДниНеделиВСтроках()
	
	Для Каждого СтрокаТаб Из Объект.ДниПоМестамВыкладкам Цикл
		ДниСтрока = "";
		Если Найти(СтрокаТаб.ДниНедели, "1") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Пн";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "2") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Вт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "3") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Ср";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "4") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Чт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "5") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Пт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "6") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Сб";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "7") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Вс";
		КонецЕсли;
		СтрокаТаб.ДниНеделиСтрока = ДниСтрока;
	КонецЦикла;		
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДниНеделиВСтроках();
	
КонецПроцедуры

&НаКлиенте
Процедура ДниПоМестамВыкладкамДниНеделиСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = ОткрытьФормуМодально("Справочник.ГрафикиИнвентаризацииМагазинов.Форма.ФормаДнейНедели", Новый Структура("ДниСтрока", Элементы.ДниПоМестамВыкладкам.ТекущиеДанные.ДниНедели), ЭтаФорма);
	Если Результат <> Неопределено Тогда
		Элементы.ДниПоМестамВыкладкам.ТекущиеДанные.ДниНедели = Результат;
		ЗаполнитьДниНеделиВСтроках();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДниНеделиВСтроках();
	
КонецПроцедуры
