
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТЗнТоварыНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуОтбора()
	Возврат "Номенклатура,Характеристика,ЕдиницаИзмерения,Цена,ДатаПроизводстваНач,ДатаПроизводстваКон,УИДСтрокиНоменклатуры";
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОтбора(ТекущиеДанные)
	
	СтруктураОтбор = Новый Структура(ПолучитьСтрокуОтбора());
	ЗаполнитьЗначенияСвойств(СтруктураОтбор, ТекущиеДанные);
	Возврат СтруктураОтбор;
	
КонецФункции // ПолучитьСтруктуруОтбора()
 

&НаСервере
Процедура ОбновитьТЗнТоварыНаСервере(ОбновлятьКомпенсацию = Истина)
	
	ТЗн = Объект.Товары.Выгрузить();
	ТЗн.Свернуть(ПолучитьСтрокуОтбора(), "");
	ТЗн.Сортировать("Номенклатура");
	ТЗнТовары.Загрузить(ТЗн);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗнТоварыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтруктураВозврата = Новый Структура(ПолучитьСтрокуОтбора());
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, Элемент.ТекущиеДанные);
	СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры", СтруктураВозврата.Характеристика);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
