
Процедура ВывестиКартинкуПоТекущемуТовару(ТекИдентификатор)
	
	КартинкаТекТовара = Неопределено;
	Если ТекИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаКартинки = Неопределено;
	Для Каждого СтрокаКарт Из ТекИдентификатор.Картинки Цикл
		Если СтрокаКарт.ЭтоОсновноеИзображение Тогда
			СтрокаКартинки = СтрокаКарт;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаКартинки = Неопределено
		И ТекИдентификатор.Картинки.Количество() > 0 Тогда
		СтрокаКартинки = ТекИдентификатор.Картинки[0];
	КонецЕсли;
	
	Если СтрокаКартинки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КаталогКЗаписи = Константы.КаталогХраненияФайловКартинок.Получить();
	Если Прав(КаталогКЗаписи, 1) <> "\" Тогда
		КаталогКЗаписи = КаталогКЗаписи + "\";
	КонецЕсли;	
	ИмяФайла = КаталогКЗаписи + Строка(ТекИдентификатор.УникальныйИдентификатор()) + "_" + Строка(СтрокаКартинки.КлючСтроки) + ?(Лев(СтрокаКартинки.Расширение, 1) = ".", "", ".") + СтрокаКартинки.Расширение;
	
	КартинкаТекТовара = ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла));
	
	Описание = "<html><body>" + ТекИдентификатор.Описание + "</body></html>";
	
	//ТекДанные = Элементы.Список.
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыводитьКартинкуТовараПриИзменении(Элемент)
	
	Элементы.КартинкаТовара.Видимость = ВыводитьКартинкуТовара;
	Элементы.Описание.Видимость = ВыводитьКартинкуТовара;
	Если ВыводитьКартинкуТовара Тогда
		ВывестиКартинкуПоТекущемуТовару(Элементы.Список.ТекущаяСтрока);
		//Элементы.Описание.Документ.Body.innerHTML = Описание;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиПодписка()
	
	Если ВыводитьКартинкуТовара Тогда
		ВывестиКартинкуПоТекущемуТовару(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиПодписка", 0.3, Истина);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СправочникНоменклатура.Ссылка,
	                      |	СправочникНоменклатура.ПометкаУдаления,
	                      |	СправочникНоменклатура.Предопределенный,
	                      |	СправочникНоменклатура.Родитель,
	                      |	СправочникНоменклатура.ЭтоГруппа,
	                      |	СправочникНоменклатура.Код,
	                      |	СправочникНоменклатура.Наименование,
	                      |	СправочникНоменклатура.id_tov,
	                      |	0 КАК Остаток,
	                      |	0 КАК ВРезерве,
	                      |	0 КАК СвободныйОстаток
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК СправочникНоменклатура
						  //+++АК KIRN 2018.03.20 ИП-00018103
						  |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК СоответствиеТиповРозничныхТочекИТорговыхМарок
						  |		ПО СправочникНоменклатура.ТорговаяМарка = СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка
						  //---АК KIRN 
	                      |ГДЕ
						  |	(СправочникНоменклатура.ХозТовар = ИСТИНА
						  |			ИЛИ &ОтборХозТовар = ЛОЖЬ)
						  |	И (СправочникНоменклатура.РекламныйМатериал = ИСТИНА
						  |			ИЛИ &ОтборРекламныхМатериалов = ЛОЖЬ)
						  |	И СправочникНоменклатура.ПометкаУдаления = ЛОЖЬ
						  //+++АК KIRN 2018.03.20 ИП-00018103 
						  |И Выбор когда &ЭтоПродавец ТОгда 
					  	  |		ВЫбор когда СправочникНоменклатура.ЭтоГруппа Тогда Истина Иначе
						  |		Выбор когда СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар) ТОгда
						  |			СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки = &ТипРозничнойТочки Иначе Истина Конец Конец	 
					  	  |	Иначе Истина Конец";
						  //---АК KIRN 
	
	Элементы.Остаток.Видимость = Параметры.ОтборРекламныхМатериалов;
	Элементы.ВРезерве.Видимость = Параметры.ОтборРекламныхМатериалов;
	Элементы.СвободныйОстаток.Видимость = Параметры.ОтборРекламныхМатериалов;
	Если Параметры.ОтборРекламныхМатериалов Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	СправочникНоменклатура.Ссылка,
		                      |	СправочникНоменклатура.ПометкаУдаления,
		                      |	СправочникНоменклатура.Предопределенный,
		                      |	СправочникНоменклатура.Родитель,
		                      |	СправочникНоменклатура.ЭтоГруппа,
		                      |	СправочникНоменклатура.Код,
		                      |	СправочникНоменклатура.Наименование,
		                      |	СправочникНоменклатура.id_tov,
		                      |	ВЫБОР
		                      |		КОГДА ЕСТЬNULL(ВЗ_Остатки.КоличествоОстаток, 0) < 0
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ЕСТЬNULL(ВЗ_Остатки.КоличествоОстаток, 0)
		                      |	КОНЕЦ КАК Остаток,
		                      |	ВЫБОР
		                      |		КОГДА ЕСТЬNULL(ВЗ_Резерв.КоличествоОстаток, 0) < 0
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ЕСТЬNULL(ВЗ_Резерв.КоличествоОстаток, 0)
		                      |	КОНЕЦ КАК ВРезерве,
		                      |	ВЫБОР
		                      |		КОГДА ЕСТЬNULL(ВЗ_Остатки.КоличествоОстаток, 0) < 0
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ЕСТЬNULL(ВЗ_Остатки.КоличествоОстаток, 0)
		                      |	КОНЕЦ - ВЫБОР
		                      |		КОГДА ЕСТЬNULL(ВЗ_Резерв.КоличествоОстаток, 0) < 0
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ЕСТЬNULL(ВЗ_Резерв.КоличествоОстаток, 0)
		                      |	КОНЕЦ КАК СвободныйОстаток
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК СправочникНоменклатура
							  //+++АК KIRN 2018.03.20  ИП-00018103
							  |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК СоответствиеТиповРозничныхТочекИТорговыхМарок
							  |		ПО СправочникНоменклатура.ТорговаяМарка = СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка
							  //---АК KIRN 
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		                      |			СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |		ИЗ
		                      |			РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад.Владелец = &РеклМатериалы) КАК ТоварыНаСкладахОстатки
		                      |		
		                      |		СГРУППИРОВАТЬ ПО
		                      |			ТоварыНаСкладахОстатки.Номенклатура) КАК ВЗ_Остатки
		                      |		ПО СправочникНоменклатура.Ссылка = ВЗ_Остатки.Номенклатура
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			ЗаявкиНаРекламныеМатериалыОстатки.Номенклатура КАК Номенклатура,
		                      |			СУММА(ЗаявкиНаРекламныеМатериалыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |		ИЗ
		                      |			РегистрНакопления.ЗаявкиНаРекламныеМатериалы.Остатки КАК ЗаявкиНаРекламныеМатериалыОстатки
		                      |		ГДЕ
		                      |			ЗаявкиНаРекламныеМатериалыОстатки.Заявка.Дата >= &ДатаГраница
		                      |			И ЗаявкиНаРекламныеМатериалыОстатки.КоличествоОстаток >= 0
		                      |			И ЗаявкиНаРекламныеМатериалыОстатки.Заявка <> &Заявка
		                      |		
		                      |		СГРУППИРОВАТЬ ПО
		                      |			ЗаявкиНаРекламныеМатериалыОстатки.Номенклатура) КАК ВЗ_Резерв
		                      |		ПО СправочникНоменклатура.Ссылка = ВЗ_Резерв.Номенклатура
		                      |ГДЕ
		                      |	(СправочникНоменклатура.ХозТовар = ИСТИНА
		                      |			ИЛИ &ОтборХозТовар = ЛОЖЬ)
		                      |	И (СправочникНоменклатура.РекламныйМатериал = ИСТИНА
		                      |			ИЛИ &ОтборРекламныхМатериалов = ЛОЖЬ)
							  //+++АК KIRN 2018.03.20 ИП-00018103 
							  |И Выбор когда &ЭтоПродавец ТОгда 
						  	  |		ВЫбор когда СправочникНоменклатура.ЭтоГруппа Тогда Истина Иначе
							  |		Выбор когда СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар) ТОгда
							  |			СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки = &ТипРозничнойТочки Иначе Истина Конец Конец	
						  	  |	Иначе Истина Конец";
							  //---АК KIRN 
		Список.Параметры.УстановитьЗначениеПараметра("РеклМатериалы", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("000000357"));				
		Список.Параметры.УстановитьЗначениеПараметра("Заявка", Параметры.Заявка);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаГраница", ТекущаяДата() - 86400 * 14);
	// +++ АК mirv 14.11.2017 [ИП-00017151]
	ИначеЕсли Параметры.Свойство("ОтборОбед") Тогда 
		Если Параметры.ОтборОбед Тогда
			Список.ТекстЗапроса = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СправочникНоменклатура.Ссылка,
				|	СправочникНоменклатура.ПометкаУдаления,
				|	СправочникНоменклатура.Предопределенный,
				|	СправочникНоменклатура.Родитель,
				|	СправочникНоменклатура.ЭтоГруппа,
				|	СправочникНоменклатура.Код,
				|	СправочникНоменклатура.Наименование,
				|	СправочникНоменклатура.id_tov,
				|	0 КАК Остаток,
				|	0 КАК ВРезерве,
				|	0 КАК СвободныйОстаток,
				|	СправочникНоменклатура.Обед
				|ИЗ
				|	Справочник.Номенклатура КАК СправочникНоменклатура
				//+++АК KIRN 2018.03.20 ИП-00018103 
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК СоответствиеТиповРозничныхТочекИТорговыхМарок
				|		ПО СправочникНоменклатура.ТорговаяМарка = СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка
				//---АК KIRN 
				|ГДЕ
				|	(СправочникНоменклатура.ХозТовар = ИСТИНА
				|			ИЛИ &ОтборХозТовар = ЛОЖЬ)
				|	И (СправочникНоменклатура.РекламныйМатериал = ИСТИНА
				|			ИЛИ &ОтборРекламныхМатериалов = ЛОЖЬ)
				|	И НЕ СправочникНоменклатура.Обед = ЗНАЧЕНИЕ(Перечисление.ВидыОбеда.ПустаяСсылка)
				//+++АК KIRN 2018.03.20  ИП-00018103
				|И Выбор когда &ЭтоПродавец ТОгда 
				|		ВЫбор когда СправочникНоменклатура.ЭтоГруппа Тогда Истина Иначе
				 |		Выбор когда СправочникНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар) ТОгда		
				|			СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки = &ТипРозничнойТочки Иначе Истина Конец Конец	
				|	Иначе Истина Конец";
				//---АК KIRN 
			Если Не Параметры.СписокВидов.Количество() = 0 Тогда
				//Список.ТекстЗапроса = Список.ТекстЗапроса + " И СправочникНоменклатура.Обед В (&СписокВидов)";
				//Список.Параметры.УстановитьЗначениеПараметра("СписокВидов", Параметры.СписокВидов);

				Для каждого СтрокаСписка Из Параметры.СписокВидов Цикл
					Сч = СтрокаСписка.ПолучитьИдентификатор();
					Список.ТекстЗапроса = Список.ТекстЗапроса +
					" И НЕ СправочникНоменклатура.Обед = &ВидОбеда" + Сч;
					Список.Параметры.УстановитьЗначениеПараметра("ВидОбеда" + Сч, СтрокаСписка.Значение);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		
		Элементы.Обед.Видимость = Истина;
	// --- АК mirv  	
	
	КонецЕсли;	
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборХозТовар", Параметры.ОтборХозТоваров);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборРекламныхМатериалов", Параметры.ОтборРекламныхМатериалов);
	
	
	//+++АК KIRN 2018.03.20  ИП-00018103
	ОбщиеПроцедуры.НоменклатураФормаУпрПриСозданииНаСервере(ЭтаФорма, "Список");
	//---АК KIRN 

КонецПроцедуры
