//+++АК VERT 2018.04.03 ИП-00017500.01
&НаСервереБезКонтекста
Процедура ФинСчетПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

//+++АК VERT 2018.04.03 ИП-00017500.01
&НаКлиенте
Процедура ФинСчетПриИзменении(Элемент)
	ФинСчетПриИзмененииНаСервере();
КонецПроцедуры

//+++АК VERT 2018.04.03 ИП-00017500.01
&НаКлиенте
Процедура ТаблицаСоответствияПолеБухНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

//+++АК VERT 2018.04.03 ИП-00017500.01
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.СоответствиеСубконто) Тогда 
		ТаблицаСоответствия.Загрузить(ЗначениеИзСтрокиВнутр(Запись.СоответствиеСубконто));
	КонецЕсли;
КонецПроцедуры

//+++АК VERT 2018.04.03 ИП-00017500.01
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СоответствиеСубконто = ЗначениеВСтрокуВнутр(ТаблицаСоответствия.Выгрузить());
КонецПроцедуры
