
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКонтрагенты = Параметры.МассивКонтрагенты;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Параметры.ДатаДок));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИнвентаризацияСкладТовары.Склад,
	               |	ИнвентаризацияСкладТовары.Склад.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.ИнвентаризацияСклад.Товары КАК ИнвентаризацияСкладТовары
	               |ГДЕ
	               |	ИнвентаризацияСкладТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ИнвентаризацияСкладТовары.Ссылка.Проведен = ИСТИНА
	               |	И ИнвентаризацияСкладТовары.Ссылка.ПоНесколькимСкладам = ИСТИНА";
				   
	ТабКеш = Запрос.Выполнить().Выгрузить();
	Для Каждого ЭлементМассив Из МассивКонтрагенты Цикл
		Если ТипЗнч(ЭлементМассив) = Тип("СправочникСсылка.Склады") Тогда
			Если ТабКеш.Найти(ЭлементМассив, "Склад") = Неопределено Тогда
				СтрокаДоб = ТабКонтрагенты.Добавить();
				СтрокаДоб.Отправить = Истина;
				СтрокаДоб.Контрагент = ЭлементМассив;
			КонецЕсли;
		Иначе
			Если ТабКеш.Найти(ЭлементМассив, "Контрагент") = Неопределено Тогда
				СтрокаДоб = ТабКонтрагенты.Добавить();
				СтрокаДоб.Отправить = Истина;
				СтрокаДоб.Контрагент = ЭлементМассив;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	Для Каждого СтрокаТаб Из ТабКонтрагенты Цикл
		СтрокаТаб.Отправить = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаТаб Из ТабКонтрагенты Цикл
		СтрокаТаб.Отправить = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	МассивВозврат = Новый Массив();
	Для Каждого СтрокаТаб Из ТабКонтрагенты Цикл
		Если СтрокаТаб.Отправить Тогда
			МассивВозврат.Добавить(СтрокаТаб.Контрагент);
		КонецЕсли;	
	КонецЦикла;
	
	Закрыть(МассивВозврат);
	
КонецПроцедуры
