
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Найти(Параметры.ДниСтрока, "1") Тогда
		Понедельник = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "2") Тогда
		Вторник = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "3") Тогда
		Среда = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "4") Тогда
		Четверг = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "5") Тогда
		Пятница = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "6") Тогда
		Суббота = Истина;
	КонецЕсли;
	Если Найти(Параметры.ДниСтрока, "7") Тогда
		Воскресенье = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ДниСтрока = "";
	Если Понедельник Тогда
		ДниСтрока = ДниСтрока + "1";
	КонецЕсли;
	Если Вторник Тогда
		ДниСтрока = ДниСтрока + "2";
	КонецЕсли;
	Если Среда Тогда
		ДниСтрока = ДниСтрока + "3";
	КонецЕсли;
	Если Четверг Тогда
		ДниСтрока = ДниСтрока + "4";
	КонецЕсли;
	Если Пятница Тогда
		ДниСтрока = ДниСтрока + "5";
	КонецЕсли;
	Если Суббота Тогда
		ДниСтрока = ДниСтрока + "6";
	КонецЕсли;
	Если Воскресенье Тогда
		ДниСтрока = ДниСтрока + "7";
	КонецЕсли;
	
	Закрыть(ДниСтрока);
	
КонецПроцедуры
