&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Состояние("Начат обмен данными с сайтом по настройке "+ПараметрКоманды+" , ожидайте....");
	
	
	ВызватьАвтообмен(ПараметрКоманды);
	
	
	
КонецПроцедуры


&НаСервере
Процедура ВызватьАвтообмен(Ссылка)
	CMS1C_ПроцедурыОбменаССайтомСервер.ВызватьАвтообмен(Ссылка);
	//Попытка
	//Браузер = Новый COMОбъект("InternetExplorer.Application");	
	//Браузер.visible = true;
	//ИмяФайлаСостояния = КаталогПрограммы()+"cond.txt";
	//ФайлСостояния = Новый ЗаписьТекста(ИмяФайлаСостояния,,,Истина);
	//ФайлСостояния.Записать("");
	//ФайлСостояния.Закрыть();
	//
	//Браузер.Navigate(ИмяФайлаСостояния);
	//Браузер.Height = 200;
	//Браузер.Width = 700;
	//Браузер.AddressBar = Ложь;
	//Браузер.StatusBar = Ложь;
	//Браузер.Silent = Истина;
	//Исключение
	//КонецПопытки;
	//ОбъектНастройки = Ссылка.ПолучитьОбъект();	
	//Попытка
	//ОбъектНастройки.ДополнительныеСвойства.Вставить("Браузер",Браузер);
	//Исключение
	//КонецПопытки;
	//ОбъектНастройки.ВыполнитьАвтообмен();
	//Браузер.quit();
	
КонецПроцедуры // ()
