
&НаКлиенте
Процедура РолиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипРоли", ПланыВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РолиПользователейТипыРолей.Ссылка
		|ИЗ
		|	Справочник.РолиПользователей.ТипыРолей КАК РолиПользователейТипыРолей
		|ГДЕ
		|	РолиПользователейТипыРолей.ТипРоли = &ТипРоли
		|	И РолиПользователейТипыРолей.Ссылка.ПометкаУдаления = ЛОЖЬ";
		Результат = Запрос.Выполнить();

		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			Роли.Добавить(Выборка.Ссылка);
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого Эл Из Роли Цикл
		Для каждого Стр Из ВладелецФормы.Объект.Роли Цикл
			Если Стр.Роль=Эл.Значение Тогда
				Эл.Пометка=Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ВладелецФормы.Объект.Роли.Очистить();
	Для каждого Эл Из Роли Цикл
		Если Эл.Пометка Тогда
			НовСтр=ВладелецФормы.Объект.Роли.Добавить();
			НовСтр.Роль=Эл.Значение;
		КонецЕсли; 	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть();
КонецПроцедуры
