
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	П = Новый Структура;
	п.Вставить("Ключ",ВыбраннаяСтрока);
	ОткрытьФорму("Справочник.Датчики.Форма.ФормаЭлемента1",П);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	//СтандартнаяОбработка = Ложь;
	//П = Новый Структура;
	//п.Вставить("Ключ",Элементы.Список.ТекущиеДанные.ссылка);
	//ОткрытьФорму("Справочник.Датчики.Форма.ФормаЭлемента1",П);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
