
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТорговаяТочкаПоАйпи) И (ПараметрыСеанса.НомерТочкиПоАйпи <> 999) Тогда
	  //И НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ПродавецТолькоПросмотр") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Склад", ПараметрыСеанса.ТорговаяТочкаПоАйпи, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;	
	
КонецПроцедуры
