
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСписка

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечатьБейджа(Команда) //+++АК mika 2018.08.01 ИП-00019374
	
	МассивКонтЛиц = Новый Массив();
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		МассивКонтЛиц.Добавить(ДанныеСтроки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент = ПечатьБейджейСервер(МассивКонтЛиц);
	ТабличныйДокумент.Показать("Бэйджи");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПечатьБейджейСервер(МассивКонтЛиц) //+++АК mika 2018.08.01 ИП-00019374
	
	Возврат Справочники.КонтактныеЛицаКонтрагентов.ПечатьБейджейКонтактныеЛицаКонтрагентов(МассивКонтЛиц);
	
КонецФункции

#КонецОбласти




