
Функция ПривестиТелефонКНужномуЗначению(Телефон) Экспорт
	
	СтрокаРазрешенныхСимволов = "0123456789";
	
	ТелефонНовый = "";
	Для н = 1 По СтрДлина(Телефон) Цикл
		Если Найти(СтрокаРазрешенныхСимволов, Сред(Телефон, н, 1)) > 0 Тогда
			ТелефонНовый = ТелефонНовый + Сред(Телефон, н, 1);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ТелефонНовый;
	
КонецФункции

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Если НЕ Модифицированность() Тогда
			Отказ = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнен объект.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Объект.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать в качестве объекта контактной информации - группу.";
			Прервать;
		КонецЕсли;
		Если Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Запись.Представление = СокрЛП(Запись.Представление);
			Проверка = СтрЗаменить(Запись.Представление, ";", Символы.ПС);
			Для н = 1 По СтрЧислоСтрок(Проверка) Цикл
				Если НЕ УправлениеЭлектроннойПочтой.EmailValid(СокрЛП(СтрПолучитьСтроку(Проверка, н))) Тогда
					СтрокаОтказа = "" + СтрокаОтказа + ?(ПустаяСтрока(СтрокаОтказа), "", Символы.ПС) + "Строка e-mail """ + 
									СокрЛП(СтрПолучитьСтроку(Проверка, н)) + """ содержит неправильный формат";
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		Если Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И Запись.Вид.ТелефонОбязательно11Символов
			И ЗначениеЗаполнено(Запись.Представление) Тогда
			Запись.Представление = ПривестиТелефонКНужномуЗначению(Запись.Представление);
			Если СтрДлина(Запись.Представление) <> 11 Тогда
				СтрокаОтказа = "" + СтрокаОтказа + ?(ПустаяСтрока(СтрокаОтказа), "", Символы.ПС) + "Для объекта: " + Запись.Объект + " телефон с видом: " + Запись.Вид + " не соотвествует требованию. Телефон обязательно должен содержать 11 символов.";
				Отказ = Истина;
			КонецЕсли;	
			//+++АК bara 16739 24.11.17
			Если Лев(Запись.Представление,1)="8" Тогда
				Запись.Представление = "7"+Сред(Запись.Представление,2,10);
			КонецЕсли; 
			//---
		КонецЕсли;	
	КонецЦикла;
	
	//+++АК bara 16739 24.11.17
	УстановитьПривилегированныйРежим(Истина);
	
	тзЗаписей =  ЭтотОбъект.выгрузить(,"Объект,Вид,Тип,Представление"); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектНомер.Объект,
	               |	ОбъектНомер.Вид,
	               |	ОбъектНомер.Тип,
	               |	ОбъектНомер.Представление
	               |ПОМЕСТИТЬ ВТ_ОбъектНомер
	               |ИЗ
	               |	&ОбъектНомер КАК ОбъектНомер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбъектНомер.Объект,
	               |	ВТ_ОбъектНомер.Вид,
	               |	ВТ_ОбъектНомер.Тип,
	               |	ВТ_ОбъектНомер.Представление
	               |ПОМЕСТИТЬ ВТ_Контакты
	               |ИЗ
	               |	ВТ_ОбъектНомер КАК ВТ_ОбъектНомер
	               |ГДЕ
	               |	ВТ_ОбъектНомер.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И ТИПЗНАЧЕНИЯ(ВТ_ОбъектНомер.Объект) = ТИП(Справочник.ФизическиеЛица)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СлужебныеSIMКарты.Ссылка КАК Объект
	               |ИЗ
	               |	Справочник.СлужебныеSIMКарты КАК СлужебныеSIMКарты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контакты КАК ВТ_Контакты
	               |		ПО (СлужебныеSIMКарты.Код = ПОДСТРОКА(ВТ_Контакты.Представление, 1, 11))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контакты КАК ВТ_Контакты
	               |		ПО КонтактнаяИнформация.Тип = ВТ_Контакты.Тип
	               |			И (ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 11) = ПОДСТРОКА(ВТ_Контакты.Представление, 1, 11))
	               |			И КонтактнаяИнформация.Объект <> ВТ_Контакты.Объект
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.ФизическиеЛица)";
	
	Запрос.УстановитьПараметр("ОбъектНомер", тзЗаписей);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Отказ = Истина; //+++АК MIND 2017.11.28 убрал, так как работает неправильно, на доработку
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Объект) = Тип("СправочникСсылка.СлужебныеSIMКарты") Тогда 
			//Сообщить("Данный номер уже используется в служебных сим картах "+ ВыборкаДетальныеЗаписи.Объект);
		Иначе
			Сообщить("Данный номер уже используется как телефон в "+ ВыборкаДетальныеЗаписи.Объект);
		КонецЕсли;
	КонецЦикла;
	//---	
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.
	Для Каждого Запись из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Объект)Тогда
			Если Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты  
				Или Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон  
				И (Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента
				Или Запись.Вид = Справочники.ВидыКонтактнойИнформации.РабочийТелефонКонтактногоЛицаКонтрагента
				Или Запись.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛицаКонтрагента
				Или Запись.Вид = Справочники.ВидыКонтактнойИнформации.EmailФизЛица
				Или Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСлужебный) Тогда
				
					Параметры = Новый Массив;
					Если ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")Тогда
						Параметры.Добавить(Запись.Объект.Владелец);
					Иначе
						Параметры.Добавить(Запись.Объект)
					КонецЕсли;
					ФоновыеЗадания.Выполнить("РегламентныеЗаданияСервер.ОбновитьДанныеСписковРассылки",Параметры,Новый УникальныйИдентификатор,"Обновление КИ в списке рассылки для "+Запись.Объект.Наименование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
