
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Финансовый.Записывать = Истина;
	Движения.Финансовый.Очистить();
	Для каждого Стр Из ЭтотОбъект.ФизЛица Цикл
		Проводка = Движения.Финансовый.Добавить();
		Проводка.Период = ЭтотОбъект.Дата;
		Проводка.СчетКт = ПланыСчетов.Финансовый.ЗаймыФизЛиц;
		Проводка.СубконтоКт.Организации  	= ЭтотОбъект.Организация;
		Проводка.СубконтоКт.КонтрагентыФизЛица	= Стр.ФизЛицо;
		Проводка.Содержание				= "Возврат займа";
				
		Проводка.СчетДт 		= ПланыСчетов.Финансовый.РасчетыСПерсоналомПоОплатеТруда;
		Проводка.СубконтоДт.Организации = ЭтотОбъект.Организация;
		
		Проводка.Сумма 			= Стр.Сумма;
	КонецЦикла;
	
	АК_УчетМСФО.ЗаполнитьОрганизацию(Движения.Финансовый,Организация);
	
КонецПроцедуры
