
#Область ОбработчикиСобытийФормы

//+++АК LATV 2018.07.04 ИП-00019101
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗначенияЗаполнения = Неопределено;
	Если Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения)
	   И ТипЗнч(ЗначенияЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияЗаполнения);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("Владелец") Тогда
		Если СтруктурнаяЕдиница.Пустая() Тогда
			ЭтаФорма.СтруктурнаяЕдиница = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновноеСтруктурноеПодразделение");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец"
			, СтруктурнаяЕдиница,,, ЗначениеЗаполнено(СтруктурнаяЕдиница));
	Иначе
		ЭтаФорма.СтруктурнаяЕдиница = Параметры.Отбор.Владелец;
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("Организация")
	   И Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация"
			, Параметры.Организация,,, ЗначениеЗаполнено(Параметры.Организация));
	КонецЕСли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

//+++АК LATV 2018.07.04 ИП-00019101
&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец"
		, СтруктурнаяЕдиница,,, ЗначениеЗаполнено(СтруктурнаяЕдиница));

КонецПроцедуры

#КонецОбласти
