////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает установленную на текущую дату/время структуру настроек или значение конкретного параметра
//
// Параметры:
//  ИмяНастройки  - <Тип.Строка> - Имя настройки (должно совпадать с именем одного из реквизитов регистра)
//
// Возвращаемое значение:
//   <Тип.Произвольный>   - Значение ресурса или структура параметров (соответствует структуре регистра) 
//
Функция ПолучитьЗначениеНастройкиАутсорсинг(ИмяНастройки = Неопределено) Экспорт 
	
	СтруктураНастроек = РегистрыСведений.НастройкиПодсистемыАутсорсинг.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Использовать", Истина));
	
	Если ИмяНастройки = Неопределено Тогда
		Возврат СтруктураНастроек;	
	Иначе
		Возврат СтруктураНастроек[ИмяНастройки];     
	КонецЕсли;
	
КонецФункции // ПолучитьСтруктуруНастроекПодсистемы()

