
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоТипу") Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипРоли", Параметры.ОтборПоТипу);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РолиПользователейТипыРолей.Ссылка
		|ИЗ
		|	Справочник.РолиПользователей.ТипыРолей КАК РолиПользователейТипыРолей
		|ГДЕ
		|	РолиПользователейТипыРолей.ТипРоли = &ТипРоли";
		Результат = Запрос.Выполнить();

		Выборка = Результат.Выбрать();

		СпОтб = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СпОтб.Добавить(Выборка.Ссылка);
		КонецЦикла;

		//
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= СпОтб;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;
	КонецЕсли;
	Если Параметры.Свойство("ОтборПоСписку") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= Параметры.ОтборПоСписку;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;
	КонецЕсли;
КонецПроцедуры
