
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Печать(ПараметрКоманды);
	Если НЕ ТабДок = Неопределено Тогда
		ТабДок.ОтображатьСетку			= Ложь;
		ТабДок.Защита					= Ложь;
		ТабДок.ТолькоПросмотр			= Истина;
		ТабДок.ОтображатьЗаголовки		= Ложь;
		ТабДок.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
		ТабДок.РазмерКолонтитулаСнизу	= 0;
		ТабДок.РазмерКолонтитулаСверху 	= 0;
		ТабДок.ПолеСверху 				= 5;
		ТабДок.ПолеСнизу 				= 5;
		ТабДок.ПолеСлева 				= 5;
		ТабДок.ПолеСправа 				= 5;
		ТабДок.АвтоМасштаб				= Истина;
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Печать(ПараметрКоманды)	
	//+++АК BELN 2018.11.06 ИП-00019252 
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Документы.РасходныйОрдерСклад.ДоступнаПечать() Тогда
		Сообщить("Нет права на печать");
		Возврат Неопределено;
	КонецЕсли; 
	//---АК BELN 2018.11.06	
	Мас=Новый Массив;
	Мас.Добавить(ПараметрКоманды);
	Возврат Документы.РасходныйОрдерСклад.ПечатьШКПаллеты(Мас);	
КонецФункции
