Функция КоличествоПрикрепленныхФайлов(Контрагент) Экспорт 
	
	Если  Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат 0;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФайлыРекомендаций.ОтносительноеИмяФайла),0) КАК КоличествоФайлов
		|ИЗ
		|	РегистрСведений.ФайлыРекомендаций КАК ФайлыРекомендаций
		|ГДЕ
		|	ФайлыРекомендаций.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КоличествоФайлов;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции	