//+++АК POZM 2018.06.07 ИП-00018682 
Функция ПолучитьСписокАктивныхАкцептантов() Экспорт
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПользователиСПравомАкцептаОплат.Пользователь
	             |ИЗ
	             |	Справочник.ПользователиСПравомАкцептаОплат КАК ПользователиСПравомАкцептаОплат
	             |ГДЕ
	             |	ПользователиСПравомАкцептаОплат.Активен
	             |	И НЕ ПользователиСПравомАкцептаОплат.ПометкаУдаления
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПользователиСПравомАкцептаОплат.Пользователь";
	Запрос = Новый Запрос(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Пользователь");
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	
//---АК POZM 