
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе бухгалтерии!");
		Возврат;
	КонецПопытки;
	
	Запрос=v82.NewObject("Запрос");
	
	ЗапросДанныеФинансов = Новый Запрос;
	
	Анализ011 = Ложь;
	Анализ109 = Ложь;
	Анализ084 = Ложь;
	Анализ103 = Ложь;
	Анализ106 = Ложь;
	Анализ1010 = Ложь;
	НастройкаПо60 = Ложь;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="ПериодОтчета" Тогда
			Запрос.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			Запрос.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));
			
			ЗапросДанныеФинансов.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			ЗапросДанныеФинансов.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));
			ЗапросДанныеФинансов.УстановитьПараметр("КонецПериодаОст",КонецДня(Параметр.Значение.ДатаОкончания) + 1);
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ0101" Тогда
			Анализ011 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ109" Тогда
			
			Анализ109 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ084" Тогда
			
			Анализ084 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ103" Тогда
			
			Анализ103 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ106" Тогда
			
			Анализ106 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Анализ1010" Тогда
			
			Анализ1010 = Параметр.Использование;
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "НастройкаПо60" Тогда
			
			НастройкаПо60 = Параметр.Использование;
		
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаФинансы.Очистить();
	ДанныеБух.Очистить();

	МассивСчетов = Новый Массив;	
	
	Если Анализ011 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации);		
	КонецЕсли;
	
	Если Анализ109 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.Инвентарь);
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваДо100000);		
	КонецЕсли;
	
	Если Анализ084 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ПриобретениеОсновныхСредств);
	КонецЕсли;
	
	Если НастройкаПо60 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.Инвентарь);
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваДо100000);	
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ПриобретениеОсновныхСредств);
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации);
	КонецЕсли;
	
	Если Анализ103 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ГСМ);
	КонецЕсли;
	
	Если Анализ106 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.ПрочиеМатериалы);
	КонецЕсли;
	
	Если Анализ1010 Тогда
		МассивСчетов.Добавить(ПланыСчетов.Финансовый.Спецодежда);
	КонецЕсли;
	
	ЗапросДанныеФинансов.УстановитьПараметр("Счета", МассивСчетов);
	ЗапросДанныеФинансов.УстановитьПараметр("Сч01_1", ПланыСчетов.Финансовый.ОсновныеСредстваВОрганизации);	
	ЗапросДанныеФинансов.УстановитьПараметр("Сч08_4", ПланыСчетов.Финансовый.ПриобретениеОсновныхСредств);	
	ЗапросДанныеФинансов.УстановитьПараметр("Сч10_3", ПланыСчетов.Финансовый.ГСМ);	
	ЗапросДанныеФинансов.УстановитьПараметр("Сч10_6", ПланыСчетов.Финансовый.ПрочиеМатериалы);	
	ЗапросДанныеФинансов.УстановитьПараметр("Сч10_10", ПланыСчетов.Финансовый.Спецодежда);	
	ЗапросДанныеФинансов.УстановитьПараметр("НастройкаПо60", НастройкаПо60);	
	  
	ЗапросДанныеФинансов.Текст = "ВЫБРАТЬ
	                             |	ФинансовыйОстаткиИОбороты.Субконто1 КАК ОС,
	                             |	ФинансовыйОстаткиИОбороты.Субконто1.ИнвентарныйНомер КАК ИнвентарныйНомер,
	                             |	0 КАК ФинСуммаНачало,
	                             |	0 КАК ФинСуммаКонец,
	                             |	ФинансовыйОстаткиИОбороты.Счет КАК Счет,
	                             |	ФинансовыйОстаткиИОбороты.Субконто1.Наименование КАК Наименование_ОС,
	                             |	ФинансовыйОстаткиИОбороты.Регистратор,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет = &Сч01_1
	                             |			ТОГДА ""01.1""
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет = &Сч08_4
	                             |			ТОГДА ""08.4""
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет = &Сч10_3
	                             |			ТОГДА ""10.3""
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет = &Сч10_6
	                             |			ТОГДА ""10.6""
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет = &Сч10_10
	                             |			ТОГДА ""10.10""
	                             |		ИНАЧЕ ""10.9""
	                             |	КОНЕЦ КАК РазделУчета,
	                             |	ФинансовыйОстаткиИОбороты.СуммаОборотДт КАК ФинСуммаОборотДт,
	                             |	ФинансовыйОстаткиИОбороты.СуммаОборотКт КАК ФинСуммаОборотКт,
	                             |	ФинансовыйОстаткиИОбороты.Субконто1.ЗаводскойНомер КАК ЗаводскойНомер,
	                             |	ФинансовыйОстаткиИОбороты.Субконто1.АК_ID_Buh КАК ID_Buh,
	                             |	1 КАК ЭтоОстатки
	                             |ПОМЕСТИТЬ Выборка
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Обороты(
	                             |			&НачалоПериода,
	                             |			&КонецПериода,
	                             |			Авто,
	                             |			Счет В (&Счета),
	                             |			,
	                             |			,
	                             |			ВЫБОР
	                             |				КОГДА &НастройкаПо60
	                             |					ТОГДА КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПЛАНсчетов.финансовый.РасчетыСПоставщикамиИПодрядчиками))
	                             |			КОНЕЦ,
	                             |			) КАК ФинансовыйОстаткиИОбороты
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ФинансовыйОстатки.Субконто1,
	                             |	ФинансовыйОстатки.Субконто1.ИнвентарныйНомер,
	                             |	ФинансовыйОстатки.СуммаОстаток,
	                             |	0,
	                             |	ФинансовыйОстатки.Счет,
	                             |	ФинансовыйОстатки.Субконто1.Наименование,
	                             |	"""",
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч01_1
	                             |			ТОГДА ""01.1""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч08_4
	                             |			ТОГДА ""08.4""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_3
	                             |			ТОГДА ""10.3""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_6
	                             |			ТОГДА ""10.6""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_10
	                             |			ТОГДА ""10.10""
	                             |		ИНАЧЕ ""10.9""
	                             |	КОНЕЦ,
	                             |	0,
	                             |	0,
	                             |	ФинансовыйОстатки.Субконто1.ЗаводскойНомер,
	                             |	ФинансовыйОстатки.Субконто1.АК_ID_Buh,
	                             |	0
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Остатки(&Началопериода, Счет В (&Счета), , ) КАК ФинансовыйОстатки
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ФинансовыйОстатки.Субконто1,
	                             |	ФинансовыйОстатки.Субконто1.ИнвентарныйНомер,
	                             |	0,
	                             |	ФинансовыйОстатки.СуммаОстаток,
	                             |	ФинансовыйОстатки.Счет,
	                             |	ФинансовыйОстатки.Субконто1.Наименование,
	                             |	"""",
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч01_1
	                             |			ТОГДА ""01.1""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч08_4
	                             |			ТОГДА ""08.4""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_3
	                             |			ТОГДА ""10.3""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_6
	                             |			ТОГДА ""10.6""
	                             |		КОГДА ФинансовыйОстатки.Счет = &Сч10_10
	                             |			ТОГДА ""10.10""
	                             |		ИНАЧЕ ""10.9""
	                             |	КОНЕЦ,
	                             |	0,
	                             |	0,
	                             |	ФинансовыйОстатки.Субконто1.ЗаводскойНомер,
	                             |	ФинансовыйОстатки.Субконто1.АК_ID_Buh,
	                             |	1
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Остатки(&КонецПериодаОст, Счет В (&Счета), , ) КАК ФинансовыйОстатки
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	Выборка.Счет,
	                             |	Выборка.ОС КАК ОС,
	                             |	ВЫБОР
	                             |		КОГДА Выборка.Счет = &Сч01_1
	                             |			ТОГДА """"
	                             |		ИНАЧЕ Выборка.ОС.Номенклатура.id_tov
	                             |	КОНЕЦ КАК id_tov,
	                             |	Выборка.ИнвентарныйНомер,
	                             |	Выборка.Регистратор,
	                             |	СУММА(Выборка.ФинСуммаНачало) КАК ФинСуммаНачало,
	                             |	СУММА(Выборка.ФинСуммаОборотДт) КАК ФинСуммаОборотДт,
	                             |	СУММА(Выборка.ФинСуммаОборотКт) КАК ФинСуммаОборотКт,
	                             |	СУММА(Выборка.ФинСуммаКонец) КАК ФинСуммаКонец,
	                             |	Выборка.Наименование_ОС,
	                             |	Выбор когда &НастройкаПо60 Тогда ""60"" Иначе Выборка.РазделУчета Конец КАК РазделУчета,
	                             |	Выборка.ЗаводскойНомер,
	                             |	Выборка.ID_Buh,
	                             |	Выборка.ЭтоОстатки
	                             |ИЗ
	                             |	Выборка КАК Выборка
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	Выборка.ОС,
	                             |	Выборка.Счет,
	                             |	Выборка.Наименование_ОС,
	                             |	Выборка.Регистратор,
	                             |	Выбор когда &НастройкаПо60 Тогда ""60"" Иначе Выборка.РазделУчета Конец ,
	                             |	Выборка.ЗаводскойНомер,
	                             |	Выборка.ID_Buh,
	                             |	Выборка.ЭтоОстатки,
	                             |	Выборка.ИнвентарныйНомер,
	                             |	ВЫБОР
	                             |		КОГДА Выборка.Счет = &Сч01_1
	                             |			ТОГДА """"
	                             |		ИНАЧЕ Выборка.ОС.Номенклатура.id_tov
	                             |	КОНЕЦ";
								 	
	ТаблицаФинансы.Загрузить(ЗапросДанныеФинансов.Выполнить().Выгрузить());
		
	Для Каждого Стр Из ТаблицаФинансы Цикл
		Стр.Гуид = Строка(Стр.ОС.УникальныйИдентификатор());
		
		Если Стр.РазделУчета = "10.9" ИЛИ Стр.РазделУчета = "01.1" ИЛИ НастройкаПо60 Тогда
			//Стр.ИнвентарныйНомерДляПоиска = СтрЗаменить(Стр.ОС.ИнвентарныйНомер, "Б_", "");
		КонецЕсли;
		
	КонецЦикла;

	ТекстЗапроса="ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.09""
				|			ТОГДА ""10.9""
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""08.04""
				|			ТОГДА ""08.4""
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.03""
				|			ТОГДА ""10.3""
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.06""
				|			ТОГДА ""10.6""
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""10.10""
				|			ТОГДА ""10.10""
				|		ИНАЧЕ ""01.1""
				|	КОНЕЦ КАК РазделУчета,
				|	ХозрасчетныйОстаткиИОбороты.Счет.Код КАК Счет,
				|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
				|	ХозрасчетныйОстаткиИОбороты.Субконто1.Наименование КАК Наименование_ОС,
				|	0 КАК БухСуммаНачало,
				|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК БухСуммаОборотДт,
				|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК БухСуммаОборотКт,
				|	0 КАК БухСуммаКонец
				|ПОМЕСТИТЬ Выборка
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&Счета), , , ВЫБОР
				|КОГДА &НастройкаПо60
				|	ТОГДА КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
				|КОНЕЦ, ) КАК ХозрасчетныйОстаткиИОбороты
				|ОБЪЕДИНИТЬ ВСЕ

				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.09""
				|			ТОГДА ""10.9""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""08.04""
				|			ТОГДА ""08.4""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.03""
				|			ТОГДА ""10.3""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.06""
				|			ТОГДА ""10.6""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.10""
				|			ТОГДА ""10.10""
				|		ИНАЧЕ ""01.1""
				|	КОНЕЦ,
				|	ХозрасчетныйОстатки.Счет.Код,
				|	ХозрасчетныйОстатки.Субконто1,
				|	ХозрасчетныйОстатки.Субконто1.Наименование,
				|	ХозрасчетныйОстатки.СуммаОстаток,
				|	0,
				|	0,
				|	0
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В (&Счета), , ) КАК ХозрасчетныйОстатки

				|ОБЪЕДИНИТЬ ВСЕ

				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.09""
				|			ТОГДА ""10.9""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""08.04""
				|			ТОГДА ""08.4""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.03""
				|			ТОГДА ""10.3""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.06""
				|			ТОГДА ""10.6""
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""10.10""
				|			ТОГДА ""10.10""
				|		ИНАЧЕ ""01.1""
				|	КОНЕЦ,
				|	ХозрасчетныйОстатки.Счет.Код,
				|	ХозрасчетныйОстатки.Субконто1,
				|	ХозрасчетныйОстатки.Субконто1.Наименование,
				|	0,
				|	0,
				|	0,
				|	ХозрасчетныйОстатки.СуммаОстаток
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1), Счет В (&Счета), , ) КАК ХозрасчетныйОстатки
				|;

				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Выборка.РазделУчета,
				|	Выборка.Счет,
				|	Выборка.ОС КАК Ос,
				|	Выборка.Наименование_ОС,
				|	СУММА(Выборка.БухСуммаНачало) КАК БухСуммаНачало,
				|	СУММА(Выборка.БухСуммаКонец) КАК БухСуммаКонец,
				|	СУММА(Выборка.БухСуммаОборотДт) КАК БухСуммаОборотДт,
				|	СУММА(Выборка.БухСуммаОборотКт) КАК БухСуммаОборотКт,
				|	ВЫБОР
				|	КОГДА Выборка.РазделУчета = ""01.1""
				|		ТОГДА Выборка.ОС
				|	ИНАЧЕ Выборка.ОС.ИД
				|КОНЕЦ КАК id_buh
				|ПОМЕСТИТЬ Сводная
				|ИЗ
				|	Выборка КАК Выборка

				|СГРУППИРОВАТЬ ПО
				|	Выборка.РазделУчета,
				|	Выборка.Счет,
				|	Выборка.Наименование_ОС,
				|	Выборка.ОС,				
				|	ВЫБОР
				|	КОГДА Выборка.РазделУчета = ""01.1""
				|		ТОГДА Выборка.ОС
				|	ИНАЧЕ Выборка.ОС.ИД
				|КОНЕЦ

				|;

				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ Выборка
				|;

				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВЫБОР КОГДА &НастройкаПо60 ТОГДА ""60"" ИНАЧЕ Сводная.РазделУчета КОНЕЦ КАК РазделУчета,
				|	Сводная.Счет,
				|	Сводная.Ос КАК ОсСсылка,
				|	Сводная.Ос.Наименование КАК Ос_Бух,
				|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомерБух,
				|	Сводная.Наименование_ОС,
				|	СУММА(Сводная.БухСуммаНачало) КАК БухСуммаНачало,
				|	СУММА(Сводная.БухСуммаОборотДт) КАК БухСуммаОборотДт,
				|	СУММА(Сводная.БухСуммаОборотКт) КАК БухСуммаОборотКт,
				|	СУММА(Сводная.БухСуммаКонец) КАК БухСуммаКонец,
				|	Сводная.id_buh
				|ИЗ
				|	Сводная КАК Сводная
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&КонецПериода, ) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
				|		ПО Сводная.Ос = ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство

				|СГРУППИРОВАТЬ ПО
				|	ВЫБОР КОГДА &НастройкаПо60 ТОГДА ""60"" ИНАЧЕ Сводная.РазделУчета КОНЕЦ,
				|	Сводная.Счет,
				|	Сводная.Ос,
				|	Сводная.Наименование_ОС,
				|	Сводная.id_buh,
				|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ИнвентарныйНомер";
	
	Запрос.Текст=ТекстЗапроса;
	
	МассивСчетов=v82.NewObject("Массив");
	
	Если Анализ011 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	КонецЕсли;
	
	Если Анализ109 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ИнвентарьИХозяйственныеПринадлежности);
	КонецЕсли;
	
	Если Анализ084 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовОсновныхСредств);
	КонецЕсли;
	
	Если НастройкаПо60 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ОСвОрганизации);
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ИнвентарьИХозяйственныеПринадлежности);
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовОсновныхСредств);
	КонецЕсли;	
	
	//
	Если Анализ103 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.Топливо);
	КонецЕсли;
	Если Анализ106 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ПрочиеМатериалы);
	КонецЕсли;
	Если Анализ1010 Тогда
		МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаНаСкладе);
	КонецЕсли;
					
	Запрос.УстановитьПараметр("Счета",МассивСчетов);
	Запрос.УстановитьПараметр("НастройкаПо60", НастройкаПо60);
	
	Выборка=Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		НС=ДанныеБух.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);		
		
		Если Выборка.РазделУчета = "01.1" ИЛИ (НастройкаПо60 И Выборка.Счет = "01.01") Тогда
			НС.ГУИД = v82.XMLСтрока(Выборка.ОССсылка);
			НС.ЗаводскойНомер = Выборка.ОССсылка.ЗаводскойНомер;			
		Иначе
			НС.ГУИд = "";
		КонецЕсли;
		
	КонецЦикла;	
	
	//ДанныеБух.ЗаполнитьЗначения(Ложь, "Обработан");
	Для Каждого Стр Из ДанныеБух Цикл
		Стр.Обработан = Ложь;
	КонецЦикла;
	
	СводнаяТаблица = Новый ТаблицаЗначений;	
	СводнаяТаблица.Колонки.Добавить("ОС");
	СводнаяТаблица.Колонки.Добавить("Номенклатура");
	СводнаяТаблица.Колонки.Добавить("ИнвентарныйНомер");
	СводнаяТаблица.Колонки.Добавить("Регистратор");
	СводнаяТаблица.Колонки.Добавить("ГУИД");
	СводнаяТаблица.Колонки.Добавить("БухСуммаНачало");
	СводнаяТаблица.Колонки.Добавить("БухСуммаКонец");
	СводнаяТаблица.Колонки.Добавить("РазделУчета");
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотДт");	
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотКт");		
	//
	СводнаяТаблица.Колонки.Добавить("ФинСуммаНачало");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаКонец");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотДт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотКт");
		
	Для Каждого Стр Из ТаблицаФинансы Цикл
		
		НовСтр = СводнаяТаблица.Добавить();
		НовСтр.БухСуммаНачало = 0;
		НовСтр.БухСуммаКонец = 0;
		НовСтр.БухСуммаОборотДТ = 0;
		НовСтр.БухСуммаОборотКт = 0;
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		//поиск ОС из бух		
		НайдСтр = Неопределено;	
		
		Если Стр.РазделУчета = "01.1" ИЛИ (НастройкаПо60 И Стр.Счет = "01.1") Тогда
		
			// ид бух
			Если ЗначениеЗаполнено(Стр.id_buh) Тогда			
				НайдСтр = ДанныеБух.Найти(Стр.id_buh, "ГУИД");			
			КонецЕсли;	
		
			// гуид
			Если НайдСтр = Неопределено Тогда
				НайдСтр = ДанныеБух.Найти(Строка(Стр.ОС.УникальныйИдентификатор()), "ГУИД");
			КонецЕсли;
			
			// инв. номер
			Если НайдСтр = Неопределено Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("РазделУчета", Стр.РазделУчета);
				СтруктураПоиска.Вставить("ИнвентарныйНомерБух", Стр.ИнвентарныйНомер);			
				СтруктураПоиска.Вставить("Обработан", Ложь);
				
				НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
				Если НайдСтроки.Количество() = 0 Тогда
					СтруктураПоиска.Вставить("ИнвентарныйНомерБух", СтрЗаменить(Стр.ИнвентарныйНомер, "Б_", ""));
					НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				КонецЕсли;
				
				Если НайдСтроки.Количество() Тогда
					НайдСтр = НайдСтроки[0];
				КонецЕсли;
			КонецЕсли;
			
			// заводской номер (если заполнен)
			Если НайдСтр = Неопределено И ЗначениеЗаполнено(Стр.ЗаводскойНомер) Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("РазделУчета", Стр.РазделУчета);
				СтруктураПоиска.Вставить("ЗаводскойНомер", Стр.ЗаводскойНомер);
				СтруктураПоиска.Вставить("ОС_Бух", Стр.Наименование_ОС);
				СтруктураПоиска.Вставить("Обработан", Ложь);
				
				НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
				Если НайдСтроки.Количество() Тогда
					НайдСтр = НайдСтроки[0];
				КонецЕсли;
			КонецЕсли;
			
		Иначе
		
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("РазделУчета", Стр.РазделУчета);
			 
			Если Стр.РазделУчета = "10.9" ИЛИ Стр.РазделУчета = "08.4" ИЛИ НастройкаПо60 Тогда
			 	СтруктураПоиска.Вставить("id_buh", Стр.Ос.Номенклатура.id_tov);
			Иначе
				СтруктураПоиска.Вставить("id_buh", Стр.Ос.id_tov);
			КонецЕсли;
			
			СтруктураПоиска.Вставить("Обработан", Ложь);
				
			 НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
			 Если НайдСтроки.Количество() Тогда
			 	НайдСтр = НайдСтроки[0];
			 КонецЕсли;		
			
		КонецЕсли;	
		
		Если НайдСтр <> Неопределено Тогда
			
			Если НЕ НайдСтр.Обработан Тогда
			
				ЗаполнитьЗначенияСвойств(НовСтр, НайдСтр);
				НайдСтр.Обработан = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если НЕ Стр.Обработан Тогда
			НовСтр = СводнаяТаблица.Добавить();
			ЗаполнитьЗначениясвойств(НовСтр, Стр);
			НовСтр.ОС = Стр.ОС_Бух;
			НовСтр.ИнвентарныйНомер = Стр.ИнвентарныйНомерБух;
			
			//
			НовСтр.ФинСуммаНачало = 0;
			НовСтр.ФинСуммаКонец = 0;
			НовСтр.ФинСуммаОборотДт = 0;
			НовСтр.ФинСуммаОборотКт = 0;			
			
		КонецЕсли;
	КонецЦикла;
	
	Если НастройкаПо60 Тогда
		
	МассивСтрДЛяУд = Новый Массив;
	
	Для Каждого Стр Из СводнаяТаблица Цикл
		Стр.Номенклатура = ?(ТипЗнч(Стр.ОС) = Тип("СправочникСсылка.ОсновныеСредства"), Стр.ОС.Номенклатура, СокрЛП(Стр.ОС));
		
		Если ЗначениеЗаполнено(Стр.ФинСуммаОборотДт) ИЛИ ЗначениеЗаполнено(Стр.ФинСуммаОборотКт)
			ИЛИ ЗначениеЗаполнено(Стр.БухСуммаОборотДТ) ИЛИ ЗначениеЗаполнено(Стр.БухСуммаОборотКТ) Тогда
				Продолжить;
		КонецЕсли;
		
		МассивСтрДЛяУд.Добавить(Стр);
		
	КонецЦикла;
	
	ДЛя Каждого Стр Из МассивСтрДляУд Цикл
		СводнаяТаблица.Удалить(Стр);
	КонецЦикла;
	
	КонецЕсли;
		
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
											Настройки, ДанныеРасшифровки);

	ВнешниеНаборыДанных=Новый Структура;

	ВнешниеНаборыДанных.Вставить("СводнаяТаблица",СводнаяТаблица);										
											
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
													   ДанныеРасшифровки);

	//Очищаем поле табличного документа

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

//Процедура ЗагрузитьНастройкиМодуль(СтруктураНастроек) Экспорт
//	
//	ДанныеБух.Очистить();	
//	ТаблицаФинансы.Очистить();
//	
//	Если СтруктураНастроек.Свойство("ДанныеБухНаименование_ОС") Тогда

//		Для Каждого Эл Из СтруктураНастроек.ДанныеБухНаименование_ОС Цикл
//			ДанныеБух.Добавить();
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ДанныеБухНаименование_ОС") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухНаименование_ОС, "Наименование_ОС");
//	КонецЕсли;	                                                                                  	
//	
//	Если СтруктураНастроек.Свойство("ДанныеБухСчет") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухСчет, "Счет");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухСуммаНачало") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухСуммаНачало, "БухСуммаНачало");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухСуммаКонец") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухСуммаКонец, "БухСуммаКонец");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухКоличествоНачало") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухКоличествоНачало, "БухКоличествоНачало");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухКоличествоКонец") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухКоличествоКонец, "БухКоличествоКонец");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухРазделУчета") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухРазделУчета, "РазделУчета");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухСуммаОборот") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухСуммаОборот, "БухСуммаОборот");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухКоличествоОборот") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухКоличествоОборот, "БухКоличествоОборот");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухСуммаОборотДт") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухСуммаОборотДт, "БухСуммаОборотДт");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухКоличествоОборотДт") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухКоличествоОборотДт, "БухКоличествоОборотДт");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухСуммаОборотКт") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухСуммаОборотКт, "БухСуммаОборотКт");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухБухКоличествоОборотКт") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухБухКоличествоОборотКт, "БухКоличествоОборотКт");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухГУИД") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухГУИД, "ГУИД");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухЗаводскойНомер") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухЗаводскойНомер, "ЗаводскойНомер");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухОбработан") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухОбработан, "Обработан");
//	КонецЕсли;	

//	Если СтруктураНастроек.Свойство("ДанныеБухИнвентарныйНомер") Тогда
//		ДанныеБух.ЗагрузитьКолонку(СтруктураНастроек.ДанныеБухИнвентарныйНомер, "ИнвентарныйНомер");
//	КонецЕсли;	
//	
//		
//	//***
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыОС") Тогда

//		Для Каждого Эл Из СтруктураНастроек.ТаблицаФинансыОС Цикл
//			ТаблицаФинансы.Добавить();
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыОС") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыОС, "ОС");
//	КонецЕсли;	
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыРегистратор") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыРегистратор, "Регистратор");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинСуммаНачало") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинСуммаНачало, "ФинСуммаНачало");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинКоличествоНачало") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинКоличествоНачало, "ФинКоличествоНачало");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинСуммаОборот") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинСуммаОборот, "ФинСуммаОборот");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинКоличествоОборот") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинКоличествоОборот, "ФинКоличествоОборот");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинСуммаОборотДт") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинСуммаОборотДт, "ФинСуммаОборотДт");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинКоличествоОборотДт") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинКоличествоОборотДт, "ФинКоличествоОборотДт");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинСуммаОборотКт") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинСуммаОборотКт, "ФинСуммаОборотКт");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинКоличествоОборотКт") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинКоличествоОборотКт, "ФинКоличествоОборотКт");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинСуммаКонец") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинСуммаКонец, "ФинСуммаКонец");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыФинКоличествоКонец") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыФинКоличествоКонец, "ФинКоличествоКонец");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыСчет") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыСчет, "Счет");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыНаименование_ОС") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыНаименование_ОС, "Наименование_ОС");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыРазделУчета") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыРазделУчета, "РазделУчета");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыЗаводскойНомер") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыЗаводскойНомер, "ЗаводскойНомер");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыID_Buh") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыID_Buh, "ID_Buh");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыЭтоОстатки") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыЭтоОстатки, "ЭтоОстатки");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыГУИД") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыГУИД, "ГУИД");
//	КонецЕсли;
//	
//	Если СтруктураНастроек.Свойство("ТаблицаФинансыИнвентарныйНомер") Тогда
//		ТаблицаФинансы.ЗагрузитьКолонку(СтруктураНастроек.ТаблицаФинансыИнвентарныйНомер, "ИнвентарныйНомер");
//	КонецЕсли;
//	
//КонецПроцедуры