
&НаКлиенте
Процедура ЗаполнитьПоЗУП(Команда)
	Если Объект.ФизЛица.Количество()>0 Тогда
		Если Вопрос("Табличная часть будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			Объект.ФизЛица.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	ЗаполнитьПоЗУПСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗУПСервер()
	ТекстЗапроса="ВЫБРАТЬ
		|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Код КАК КодФ,
		|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
		|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование,
		|ЗарплатаКВыплатеОрганизацийЗарплата.Займ
		|ИЗ
			|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Проведен
		|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И ЗарплатаКВыплатеОрганизацийЗарплата.Займ<>0
		|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация.ИНН = &ИНН";
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Зуп();
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Зуп() + ".COMConnector");
	
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе зарплаты");
		Возврат;
		
	КонецПопытки;
	запрос=v82.NewObject("Запрос");  
	запрос.текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаС",НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаПо",КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ИНН",Объект.Организация.ИНН);	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС=Объект.ФизЛица.Добавить();
		НС.ФизЛицо=Справочники.ФизическиеЛица.НайтиПоКоду(Выборка.КодФ);
		НС.Сумма=Выборка.Займ;
	КонецЦикла;		
КонецПроцедуры	

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	Объект.БанковскийСчет=Справочники.БанковскиеСчета.НайтиПоНаименованию("Прочие безналичные средства",,,Объект.Организация);
КонецПроцедуры	

//+++АК sils 08.06.2018 ИП-00018876
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Погашение займа");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
КонецПроцедуры

//+++АК sils 08.06.2018 ИП-00018876
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));
КонецПроцедуры
