//+++АК Susk (Суслин К.В.) 2017.11.21 ИП-00017162 
&НаСервере
Функция ПолучитьДатчикиВМестахХранения(ДатаНачальная = Неопределено, Глубина = 3) Экспорт
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение();
	
	ТекстЗапроса = "SELECT     GetSensorShopNo_1.Магазин, GetSensorShopNo_1.МестоВыкладки, GetSensorShopNo_1.Датчик, GetSensorShopNo_1.ИдДатчика
		|FROM M2.dbo.GetSensorShopNo('&ПараметрДата', -&Глубина) AS GetSensorShopNo_1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрДата", Формат(?(ДатаНачальная = Неопределено, ТекущаяДата(), ДатаНачальная), "ДФ=yyyyMMdd"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Глубина", Формат(Глубина, "ЧГ=0"));
	
	rs = ADOСоединение.Execute(ТекстЗапроса);
	
	ТаблицаДатчики = Новый ТаблицаЗначений;
	ТаблицаДатчики.Колонки.Добавить("МестоВыкладки");
	ТаблицаДатчики.Колонки.Добавить("Магазин");
	ТаблицаДатчики.Колонки.Добавить("Датчик");
	ТаблицаДатчики.Колонки.Добавить("Обработан");
	
	ЗапросСпр = Новый Запрос;
	ЗапросСпр.Текст = "ВЫБРАТЬ
	                  |	Датчики.Ссылка,
	                  |	Датчики.Наименование,
	                  |	Датчики.ИД
	                  |ИЗ
	                  |	Справочник.Датчики КАК Датчики";
	
	ТаблицаДатчикиБазы = ЗапросСПр.Выполнить().Выгрузить();
	
	ЗапросСпр.Текст = "ВЫБРАТЬ
	                  |	СтруктурныеЕдиницы.Ссылка,
	                  |	СтруктурныеЕдиницы.Наименование
	                  |ИЗ
	                  |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы";
	
	ТаблицаТТ = ЗапросСпр.Выполнить().Выгрузить();
	
	Для Каждого СтрТТ Из ТаблицаТТ Цикл
		СтрТТ.Наименование = СокрЛП(СтрТТ.Наименование);
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура;
	
	Попытка
		rs.MoveFirst();
		Пока НЕ rs.Eof() Цикл
			
			МестоВыкладки = СокрЛП(rs.Fields("МестоВыкладки").Value);
			
			Если Найти(МестоВыкладки, "Теплые") = 0 Тогда				
				
				СтруктураПоиска.Вставить("Наименование", СокрЛП(rs.Fields("Датчик").Value));
				//СтруктураПоиска.Вставить("ИД", rs.Fields("ИдДатчика").Value);
						
				НайдСтроки = ТаблицаДатчикиБазы.НайтиСтроки(СтруктураПоиска);
			
				Если НайдСтроки.Количество() Тогда			
				
					Датчик = НайдСтроки[0].Ссылка;			
								
					НовСтр = ТаблицаДатчики.Добавить();
					
					НаименованиеТочки = СокрЛП(rs.Fields("Магазин").Value);
					НайдСтрМагазин = ТаблицаТТ.Найти(НаименованиеТочки, "Наименование");
					
					Если НЕ НайдСтрМагазин = Неопределено Тогда
						НовСтр.Магазин = НайдСтрМагазин.Ссылка;
					КонецЕсли;
					
					НовСтр.Датчик =	Датчик;
					НовСтр.МестоВыкладки = МестоВыкладки; 
					НовСтр.Обработан = Ложь;				
									
				КонецЕсли;
				
			КонецЕсли;
			
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	ADOСоединение.Close();
	
	ТаблицаДатчики.Свернуть("Датчик, Магазин, МестоВыкладки, Обработан");

	Возврат ТаблицаДатчики;

КонецФункции

//+++АК SaMi 2018.11.16 ИП-00019767^01
Функция ПолучитьИдентификаторыАктивныхДатчиков(Дата, Глубина = 1) Экспорт
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение();
	
	ТекстЗапросаSQL = "EXEC	[M2].[dbo].[FOR1C_GetSensorReadings] "+ ВнешниеДанные.ФорматПоля(НачалоДня(Дата)) + ", " + Глубина;
	
	RecordSet = ADOСоединение.Execute(ТекстЗапросаSQL);
	
	ТаблицаПоказанийДатчиков = ВнешниеДанные.ПреобразоватьРезультатВТаблицуЗначений(RecordSet);
	
	Возврат ТаблицаПоказанийДатчиков.ВыгрузитьКолонку("id_sensor");
	
КонецФункции
//---АК SaMi  2018.11.16 