
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		СсылкаОбъект = ЭтотОбъект.ПолучитьСсылкуНового();
		Если НЕ ЗначениеЗаполнено(СсылкаОбъект) Тогда
			СсылкаОбъект = Справочники.ХранилищеДополнительнойИнформации.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаОбъект);
		КонецЕсли;
	Иначе
		СсылкаОбъект = Ссылка;
	КонецЕсли;
	
	ХранилищеДвоичные = Хранилище.Получить();
	Если ТипЗнч(ХранилищеДвоичные) = Тип("ДвоичныеДанные") Тогда
		КаталогСохранения = Константы.КаталогХраненияФайловКартинок.Получить();
		Если ЗначениеЗаполнено(КаталогСохранения) Тогда
			КаталогСохранения = КаталогСохранения + ?(Прав(КаталогСохранения, 1) <> "\", "\", "") + "Справочник хранилище доп информации\";
			Расширение = РаботаСФайлами.ПолучитьРасширениеФайла(ИмяФайла);
			ХранилищеДвоичные.Записать(КаталогСохранения + Строка(СсылкаОбъект.УникальныйИдентификатор()) + "." + Расширение);
			Хранилище = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;	
	КонецЕсли;	
	
	Если Распечатан и не ИмяФайла = Ссылка.ИмяФайла Тогда
		Распечатан = Ложь;		
	КонецЕсли;
	
КонецПроцедуры
