
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = СформироватьКарточкуСотрудника(ПараметрКоманды);

	ТабДок.ОтображатьСетку		= Ложь;
	ТабДок.Защита				= Истина;
	ТабДок.ТолькоПросмотр		= Истина;
	ТабДок.ОтображатьЗаголовки	= Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьКарточкуСотрудника(ПараметрКоманды) 

	ТД1 = Новый ТабличныйДокумент;
	
	
	Макет1 = Документы.АК_АктПриемаПередачиТМЦСотруднику.ПолучитьМакет("ОбходнойЛист");
	ОблШапка = Макет1.ПолучитьОбласть("ШапкаОЛ");
	ОблСтрока = Макет1.ПолучитьОбласть("СтрокаОЛ");
	ОблСтрокаПодвал = Макет1.ПолучитьОбласть("ПодвалОЛ");
	
	СП1 = ПолучитьПараметрыТабДок(ПараметрКоманды);
	ОблШапка.Параметры.Заполнить(СП1);
	ОблШапка.Параметры.Номер = ПараметрКоманды.Номер;
	ТД1.Вывести(ОблШапка);
	
	Если ПараметрКоманды.ВидОперации = Перечисления.АК_ВидыОперацииАктаПриемаПередачиТМЦСотруднику.Передача Тогда
		СтрокаВидОперации = "Приход";
	Иначе
		СтрокаВидОперации = "Расход";		
	КонецЕсли; 
	
	Для каждого СтрокаДок Из ПараметрКоманды.ТМЦ Цикл
		ОблСтрока.Параметры.Номенклатура = СтрокаДок.Номенклатура;
		ОблСтрока.Параметры ["Количество" + СтрокаВидОперации] = СтрокаДок.Количество;
		ТД1.Вывести(ОблСтрока);
	КонецЦикла; 
	
	
	//Для каждого СтрокаТаб Из СП1.ТМЦ_Обороты Цикл
	//	ОблСтрока.Параметры.Заполнить(СтрокаТаб);
	//	ТД1.Вывести(ОблСтрока);
	//КонецЦикла; 
	
	ТД1.Вывести(ОблСтрокаПодвал);
		
		
	//Обл1 = Макет1.ПолучитьОбласть("Область1");
	//ОблСтрокаСИЗ = Макет1.ПолучитьОбласть("СтрокаСИЗ");
	//ОблПустаяСтрокаСИЗ = Макет1.ПолучитьОбласть("ПустаяСтрокаСИЗ");
	//
	////Если ПараметрКоманды.Организация.Код = "000000006" Тогда // это ВВ
	//	Обл2 = Макет1.ПолучитьОбласть("ОбластьВВ");
	////ИначеЕсли ПараметрКоманды.Организация.Код = "000000005" Тогда // это ВВ
	////	Обл2 = Макет1.ПолучитьОбласть("ОбластьЛДП");
	////Иначе
	////	Сообщить("Для организации " + Строка(ПараметрКоманды.Организация) + " формирование печатной формы не предусмотрено");
	////	Возврат Неопределено;
	////КонецЕсли;
	//
	//
	//
	//СП1 = ПолучитьПараметрыТабДок(ПараметрКоманды);
	//Обл1.Параметры.Заполнить(СП1);
	//ТД1.Вывести(Обл1);
	//
	//// Остатки ТМЦ
	//
	//КолВоСИЗ = СП1.ТМЦ_Остатки.Количество();
	//Для Сч1 = 1 По 18 Цикл
	//	Если Сч1 > КолВоСИЗ Тогда
	//		ТД1.Вывести(ОблПустаяСтрокаСИЗ);
	//	Иначе
	//		Инд1 = Сч1 - 1;
	//		ОблСтрокаСИЗ.Параметры.Наименование = ПолучитьНормализованнуюСтрокуСИЗ(Строка(СП1.ТМЦ_Остатки[Инд1].Номенклатура));
	//		ОблСтрокаСИЗ.Параметры.КолВо = СП1.ТМЦ_Остатки[Инд1].КоличествоОстаток;
	//		ТД1.Вывести(ОблСтрокаСИЗ);
	//	КонецЕсли;
	//КонецЦикла;
	//ТД1.Вывести(Обл2);
	
	// Вторую не выводим
	// вывод 2-й страницы
	//ТД1.ВывестиГоризонтальныйРазделительСтраниц();
	//
	//ОблШапка2 = Макет1.ПолучитьОбласть("ШапкаСтраницы2");
	//ОблСтрока2 = Макет1.ПолучитьОбласть("СтрокаСтраницы2");
	//ОблПустаяСтрока2 = Макет1.ПолучитьОбласть("ПустаяСтрокаСтраницы2");
	//
	//ТД1.Вывести(ОблШапка2);
	//
	//КолВоСИЗ = СП1.ТМЦ_Обороты.Количество();
	//Для Сч1 = 1 По 14 Цикл
	//	Если Сч1 > КолВоСИЗ Тогда
	//		ТД1.Вывести(ОблПустаяСтрока2);
	//	Иначе
	//		Инд1 = Сч1 - 1;
	//		ОблСтрока2.Параметры.Наименование = ПолучитьНормализованнуюСтрокуСИЗ(Строка(СП1.ТМЦ_Обороты[Инд1].Номенклатура));
	//		ОблСтрока2.Параметры.КолВоСИЗ =  СП1.ТМЦ_Обороты[Инд1].КоличествоПриход;
	//		ОблСтрока2.Параметры.Дата =  Формат(СП1.ТМЦ_Обороты[Инд1].ДатаПрихода, "ДФ=dd.MM.yy");
	//		Если ЗначениеЗаполнено(СП1.ТМЦ_Обороты[Инд1].ДатаРасхода) Тогда
	//			ОблСтрока2.Параметры.ДатаУвольнения = Формат(СП1.ТМЦ_Обороты[Инд1].ДатаРасхода, "ДФ=dd.MM.yy");								
	//		КонецЕсли;
	//		
	//		//+++AK susk
	//		ОблСтрока2.Параметры.КолВоСИЗУвольнение = СП1.ТМЦ_Обороты[Инд1].КоличествоРасход;

	//		//---AK susk
	//		
	//		ТД1.Вывести(ОблСтрока2);
	//	КонецЕсли;
	//КонецЦикла;
	
	ТД1.ПолеСправа = 7;
	
	Возврат ТД1;

КонецФункции // ()

Функция СформироватьКарточкуСотрудника_(ПараметрКоманды) 

	ТД1 = Новый ТабличныйДокумент;
	Макет1 = Документы.АК_АктПриемаПередачиТМЦСотруднику.ПолучитьМакет("КарточкаСотрудника");
	Обл1 = Макет1.ПолучитьОбласть("Область1");
	ОблСтрокаСИЗ = Макет1.ПолучитьОбласть("СтрокаСИЗ");
	ОблПустаяСтрокаСИЗ = Макет1.ПолучитьОбласть("ПустаяСтрокаСИЗ");
	
	//Если ПараметрКоманды.Организация.Код = "000000006" Тогда // это ВВ
		Обл2 = Макет1.ПолучитьОбласть("ОбластьВВ");
	//ИначеЕсли ПараметрКоманды.Организация.Код = "000000005" Тогда // это ВВ
	//	Обл2 = Макет1.ПолучитьОбласть("ОбластьЛДП");
	//Иначе
	//	Сообщить("Для организации " + Строка(ПараметрКоманды.Организация) + " формирование печатной формы не предусмотрено");
	//	Возврат Неопределено;
	//КонецЕсли;
	
	
	
	СП1 = ПолучитьПараметрыТабДок(ПараметрКоманды);
	Обл1.Параметры.Заполнить(СП1);
	ТД1.Вывести(Обл1);
	
	// Остатки ТМЦ
	
	КолВоСИЗ = СП1.ТМЦ_Остатки.Количество();
	Для Сч1 = 1 По 18 Цикл
		Если Сч1 > КолВоСИЗ Тогда
			ТД1.Вывести(ОблПустаяСтрокаСИЗ);
		Иначе
			Инд1 = Сч1 - 1;
			ОблСтрокаСИЗ.Параметры.Наименование = ПолучитьНормализованнуюСтрокуСИЗ(Строка(СП1.ТМЦ_Остатки[Инд1].Номенклатура));
			ОблСтрокаСИЗ.Параметры.КолВо = СП1.ТМЦ_Остатки[Инд1].КоличествоОстаток;
			ТД1.Вывести(ОблСтрокаСИЗ);
		КонецЕсли;
	КонецЦикла;
	ТД1.Вывести(Обл2);
	
	// Вторую не выводим
	// вывод 2-й страницы
	//ТД1.ВывестиГоризонтальныйРазделительСтраниц();
	//
	//ОблШапка2 = Макет1.ПолучитьОбласть("ШапкаСтраницы2");
	//ОблСтрока2 = Макет1.ПолучитьОбласть("СтрокаСтраницы2");
	//ОблПустаяСтрока2 = Макет1.ПолучитьОбласть("ПустаяСтрокаСтраницы2");
	//
	//ТД1.Вывести(ОблШапка2);
	//
	//КолВоСИЗ = СП1.ТМЦ_Обороты.Количество();
	//Для Сч1 = 1 По 14 Цикл
	//	Если Сч1 > КолВоСИЗ Тогда
	//		ТД1.Вывести(ОблПустаяСтрока2);
	//	Иначе
	//		Инд1 = Сч1 - 1;
	//		ОблСтрока2.Параметры.Наименование = ПолучитьНормализованнуюСтрокуСИЗ(Строка(СП1.ТМЦ_Обороты[Инд1].Номенклатура));
	//		ОблСтрока2.Параметры.КолВоСИЗ =  СП1.ТМЦ_Обороты[Инд1].КоличествоПриход;
	//		ОблСтрока2.Параметры.Дата =  Формат(СП1.ТМЦ_Обороты[Инд1].ДатаПрихода, "ДФ=dd.MM.yy");
	//		Если ЗначениеЗаполнено(СП1.ТМЦ_Обороты[Инд1].ДатаРасхода) Тогда
	//			ОблСтрока2.Параметры.ДатаУвольнения = Формат(СП1.ТМЦ_Обороты[Инд1].ДатаРасхода, "ДФ=dd.MM.yy");								
	//		КонецЕсли;
	//		
	//		//+++AK susk
	//		ОблСтрока2.Параметры.КолВоСИЗУвольнение = СП1.ТМЦ_Обороты[Инд1].КоличествоРасход;

	//		//---AK susk
	//		
	//		ТД1.Вывести(ОблСтрока2);
	//	КонецЕсли;
	//КонецЦикла;
	
	ТД1.ПолеСправа = 7;
	
	Возврат ТД1;

КонецФункции // ()

&НаСервере
Функция ПолучитьНормализованнуюСтрокуСИЗ(Строка1)

	Если СтрДлина(Строка1) > 5 И ВРег(Лев(Строка1, 5)) = "СИЗ -" Тогда
		СтрокаРез = СокрЛП(Сред(Строка1, 6));
	ИначеЕсли СтрДлина(Строка1) > 4 И ВРег(Лев(Строка1, 4)) = "СИЗ-" Тогда
		СтрокаРез = СокрЛП(Сред(Строка1, 5));
	Иначе
		СтрокаРез = СокрЛП(Строка1);
	КонецЕсли;
	
	Возврат СтрокаРез;
	
КонецФункции // ()


&НаСервере
Функция ПолучитьПараметрыТабДок(ПараметрКомандыДокумент)
	
	ПараметрКоманды = ПараметрКомандыДокумент.Сотрудник;
	
	СвойствоРост				 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0010");
	СвойствоРазмерОдежды		 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0011");
	СвойствоРазмерОбуви			 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0012");
	СвойствоРазмерГоловногоУбора = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0013");
	СвойствоРазмерПротивогаза	 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0014");
	СвойствоРазмерРеспиратора	 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0015");
	СвойствоРазмерРукавиц		 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0016");
	СвойствоРазмерПерчаток		 = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("0017");
	
	СП1 = Новый Структура;
	СтрФИО = ФамилияИмяОтчествоПоСтроке(ПараметрКоманды.Наименование);
	СП1.Вставить("Фамилия", СтрФИО.Фамилия);
	СП1.Вставить("Имя", СтрФИО.Имя);
	СП1.Вставить("Отчество", СтрФИО.Отчество);
	СП1.Вставить("ТабельныйНомер", ПараметрКоманды.Код);
	СП1.Вставить("СтруктурноеПодразделение", ПараметрКоманды.ПодразделениеОрганизации);
	//СП1.Вставить("Профессия", ПараметрКоманды.ТекущаяДолжностьОрганизации);
	СП1.Вставить("ДатаПоступленияНаРаботу", Формат(ПараметрКоманды.ДатаПриемаНаРаботу, "ДЛФ=Д"));
	СП1.Вставить("Пол", ПараметрКоманды.Физлицо.Пол);
	
	// метрика
	СП1.Вставить("Рост", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРост));
	СП1.Вставить("РазмерОдежды", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерОдежды));
	СП1.Вставить("РазмерОбуви", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерОбуви));
	СП1.Вставить("РазмерГоловногоУбора", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерГоловногоУбора));
	СП1.Вставить("РазмерПротивогаза", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерПротивогаза));
	СП1.Вставить("РазмерРеспиратора", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерРеспиратора));
	СП1.Вставить("РазмерРукавиц", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерРукавиц));
	СП1.Вставить("РазмерПерчаток", ПолучитьЗначениеСвойства(ПараметрКоманды, СвойствоРазмерПерчаток));
	
	ТЗСИЗ = Новый ТаблицаЗначений;
	ТЗСИЗ.Колонки.Добавить("СИЗ");
	ТЗСИЗ.Колонки.Добавить("КолВо");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Номенклатура,
		|	СУММА(ТМЦПереданныеСотрудникуОстаткиИОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.ПериодСекунда
		|ПОМЕСТИТЬ Приход
		|ИЗ
		|	РегистрНакопления.ТМЦПереданныеСотруднику.ОстаткиИОбороты(, &ДатаСреза, Авто, , ) КАК ТМЦПереданныеСотрудникуОстаткиИОбороты
		|ГДЕ
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Номенклатура,
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.ПериодСекунда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Номенклатура,
		|	СУММА(ТМЦПереданныеСотрудникуОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.ПериодСекунда
		|ПОМЕСТИТЬ Расход
		|ИЗ
		|	РегистрНакопления.ТМЦПереданныеСотруднику.ОстаткиИОбороты(, &ДатаСреза, Авто, , ) КАК ТМЦПереданныеСотрудникуОстаткиИОбороты
		|ГДЕ
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.Номенклатура,
		|	ТМЦПереданныеСотрудникуОстаткиИОбороты.ПериодСекунда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТМЦПереданныеСотрудникуОстатки.Номенклатура,
		|	СУММА(ТМЦПереданныеСотрудникуОстатки.КоличествоОстаток) КАК КоличествоКонечныйОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ТМЦПереданныеСотруднику.Остатки(&ДатаСреза, ) КАК ТМЦПереданныеСотрудникуОстатки
		|ГДЕ
		|	ТМЦПереданныеСотрудникуОстатки.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ТМЦПереданныеСотрудникуОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Приход.Номенклатура,
		|	Приход.КоличествоПриход,
		|	Приход.ПериодСекунда КАК ДатаПрихода,
		|	Расход.КоличествоРасход,
		|	Расход.ПериодСекунда КАК ДатаРасхода
		|ИЗ
		|	Приход КАК Приход
		|		ЛЕВОЕ СОЕДИНЕНИЕ Расход КАК Расход
		|		ПО Приход.Номенклатура = Расход.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник", ПараметрКоманды);
	
	СП1.Вставить("ТМЦ_Обороты", Запрос.Выполнить().Выгрузить());
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	СтрокаТЗСИЗ = ТЗСИЗ.Добавить();
	//	СтрокаТЗСИЗ.СИЗ = ВыборкаДетальныеЗаписи.Номенклатура;
	//	СтрокаТЗСИЗ.КолВо = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	//КонецЦикла;
	//
	//СП1.Вставить("СИЗ", ТЗСИЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТМЦПереданныеСотрудникуОстатки.Номенклатура,
	               |	СУММА(ТМЦПереданныеСотрудникуОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТМЦПереданныеСотруднику.Остатки(&ДатаСреза, ) КАК ТМЦПереданныеСотрудникуОстатки
	               |ГДЕ
	               |	ТМЦПереданныеСотрудникуОстатки.Сотрудник = &Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТМЦПереданныеСотрудникуОстатки.Номенклатура";
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник", ПараметрКоманды);
	
	СП1.Вставить("ТМЦ_Остатки", Запрос.Выполнить().Выгрузить());
	
	
	
	Возврат СП1;
	

КонецФункции // ()

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

&НаСервере
Функция ФамилияИмяОтчествоПоСтроке(СтрокаНаименование)
	
	ФИО = Новый Массив;
	
	ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(СтрокаНаименование)," ");
		
	КоличествоПодстрок = ФИО.Количество();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Фамилия",	?(КоличествоПодстрок > 0,ФИО[0],""));
	Результат.Вставить("Имя",		?(КоличествоПодстрок > 1,ФИО[1],""));
	Результат.Вставить("Отчество",	?(КоличествоПодстрок > 2,ФИО[2],""));
	
	Возврат Результат
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеСвойства(ПараметрКоманды, Свойство)

	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос1.УстановитьПараметр("Объект", ПараметрКоманды.Физлицо);
	Запрос1.УстановитьПараметр("Свойство", Свойство);
	
	Рез1 = Запрос1.Выполнить();
	Если Рез1.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб1 = Рез1.Выбрать();
		Выб1.Следующий();
		Возврат Выб1.Значение;
	КонецЕсли;
	
КонецФункции // ()

