
//+++AK Lobv рассылка уведомления при созданнии новой заявки
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ЭтоНовый() тогда
		МассивПолучателей=Новый Массив;
		Если ТипИсследования=Перечисления.ТипыИсследованияМониторингаОпроса.ППП тогда
			МассивПолучателей.Добавить("annyllat@gmail.com");
		ИначеЕсли ТипИсследования=Перечисления.ТипыИсследованияМониторингаОпроса.ОпросНаСайтеВСоцСетях тогда
			МассивПолучателей.Добавить("pr@izbenka.msk.ru");
			МассивПолучателей.Добавить("annyllat@gmail.com");
		Иначе
			МассивПолучателей.Добавить("research@izbenka.msk.ru");
			МассивПолучателей.Добавить("research@vkusvill.ru");
		КонецЕсли;
		
		Если МассивПолучателей.Количество()>0 тогда
			УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
			Почта = Новый ИнтернетПочта;
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			Письмо = Новый ИнтернетПочтовоеСообщение;
			Почта.Подключиться(Профиль);
			НомерДляПисьма=1;
			Запрос1=Новый Запрос;
			Запрос1.Текст="ВЫБРАТЬ
			             |	ЗаявкаНаПроведениеИсследования.Номер КАК Номер
			             |ИЗ
			             |	Документ.ЗаявкаНаПроведениеИсследования КАК ЗаявкаНаПроведениеИсследования
			             |ГДЕ
			             |	ЗаявкаНаПроведениеИсследования.Дата >= &Дата
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	Номер УБЫВ";
			Запрос1.УстановитьПараметр("Дата",НачалоГода(ТекущаяДата()));
			ТаблицаНомеров=Запрос1.Выполнить().Выгрузить();
			Если ТаблицаНомеров.Количество()>0 тогда
				Попытка
					НомерДляПисьма=Число(ТаблицаНомеров[0].Номер)+1;
				Исключение
				КонецПопытки;
			КонецЕсли;
			Письмо.Тема = "Создана новая заявка на проведение исследования, мониторинга, опроса №"+Строка(НомерДляПисьма)+" от "+Строка(Дата);
			ТекстСообщения = Письмо.Тексты.Добавить();
			ТекстСообщения.Текст     = 
			"Заказчик: "+Строка(Заказчик)+Символы.ПС+
			"Приоритет: "+Строка(Приоритет)+Символы.ПС+
			"Тип исследования: "+Строка(ТипИсследования)+Символы.ПС+
			"Срок: "+?(ЗначениеЗаполнено(СрокВыполнения),Строка(Формат(СрокВыполнения,"ДЛФ=Д")),"не указан")+Символы.ПС+Символы.ПС+
			"Запрос:"+Строка(Запрос)+Символы.ПС;
			ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
			
			Письмо.ИмяОтправителя = ""+УчетнаяЗапись+"";
			Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
			Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
			
			Для каждого АдресИзМассива из МассивПолучателей цикл
				Получатель = Письмо.Получатели.Добавить();
				Получатель.Адрес           = АдресИзМассива;
				Получатель.ОтображаемоеИмя = АдресИзМассива;
			КонецЦикла;
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//--АК