
#Область ОбластьПараметров

&НаСервере
Перем Организация;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборЗначения();

КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработатьВыборЗначения();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыФормы()
	
	Параметры.Свойство("Организация", Организация);
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборЗначения()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено тогда
		Закрыть(ТекущиеДанные.ФизЛицо);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
