
&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка, СтандартнаяОбработка)
      
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
 
	Если Поля.Количество() > 0
		  	И ТипЗнч(Поля[0].Значение) = Тип("ДокументСсылка.НачислениеАренднойПлатыОтАрендодателей") Тогда            
		СтандартнаяОбработка = Ложь;
		СтруктураРезультат = Новый Структура();
		СтруктураРезультат.Вставить("ДокументСсылка", Поля[0].Значение);
		Попытка 
		  	СтруктураРезультат.Вставить("ТТ", Данные.Элементы.Получить(Расшифровка).ПолучитьРодителей()[0].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);	
		Исключение
		КонецПопытки; 
		  
		Возврат СтруктураРезультат;
    КонецЕсли;

	Возврат Неопределено;
	  
КонецФункции
  
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
    СтруктураРезультат = ПолучитьРасшифровкуНаСервере(Расшифровка, СтандартнаяОбработка);
	  
	Если СтруктураРезультат <> Неопределено Тогда
		ФормаДокумента = СтруктураРезультат.ДокументСсылка.ПолучитьФорму();
		ТТ = Неопределено;
		Если СтруктураРезультат.Свойство("ТТ", ТТ) Тогда
			ФормаДокумента.ДокументОбъект.ДополнительныеСвойства.Вставить("ТТ", ТТ);
		КонецЕсли; 
		ФормаДокумента.Открыть()
	КонецЕсли; 
	  
КонецПроцедуры
