
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТорговаяТочка", ПараметрыСеанса.ТорговаяТочкаПоАйпи);
	
	ПериодЖурнала = Новый СтандартныйПериод;
	ПериодЖурнала.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодЖурнала.ДатаНачала = ТекущаяДата() - 86400 * 3;
	ПериодЖурнала.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Элементы.Список.Период = ПериодЖурнала;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказыССайта(Команда)
	
	ПолныеПрава.ЗагрузитьЗаказыССайта();
	
КонецПроцедуры
