
Процедура СформироватьСообщенияМагазинам(Ссылка, МассивМагазинов) Экспорт
	
	Если МассивМагазинов.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоКопияБазы() Тогда Возврат; КонецЕсли;
	
	НомерДатаСтр = " №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy");
	Тема = "Задача товароведа на дегустацию новинки " + НомерДатаСтр;
	ТекстСообщения =
		"Задача товароведа на дегустацию новинки " + НомерДатаСтр + ".
		|
		|Нужно продегустировать новинку:
		|" + Ссылка.Номенклатура + " (" + Ссылка.ХарактеристикаНоменклатуры + ")
		|и внести в задачу оценки и комментарий по показателям.";
	
	Если НЕ ПустаяСтрока(Ссылка.Комментарий) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "
		|Примечание к задаче: " + Ссылка.Комментарий;
	КонецЕсли;
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("ТипСообщения", Перечисления.ТипыСообщенийМОС.ИнформационноеСообщение);
	ПараметрыСообщения.Вставить("ВидПолучателей", Перечисления.ВидыПолучателейМОС.СписокМагазинов);
	ПараметрыСообщения.Вставить("ВсемСменам", Истина);
	ПараметрыСообщения.Вставить("Тема", Тема);
	ПараметрыСообщения.Вставить("ТекстСообщения", ТекстСообщения);
	ПараметрыСообщения.Вставить("СписокМагазинов", МассивМагазинов); //СтруктурныеЕдиницы
	ПараметрыСообщения.Вставить("ОбъектИнициатор", Ссылка.Ссылка);
	ПараметрыСообщения.Вставить("Отправитель", Справочники.РолиПользователей.Администратор);
	//ПараметрыСообщения.Вставить("ШаблонСообщений", Справочники.ШаблоныСообщенийМОС.УведомлениеЗаданиеТехнолога);
	
	СообщениеОбОшибке = "";
	Попытка
		СообщениеОбОшибке = МеханизмОбменаСообщениями.СоздатьИОтправитьСообщение(ПараметрыСообщения, Истина);
		СообщениеОбОшибке = ?(ТипЗнч(СообщениеОбОшибке) = Тип("ДокументСсылка.СообщениеМОС"), "", СообщениеОбОшибке);
	Исключение
		СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки; 
	
	Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = "Ошибка формирования сообщений магазинам: " + СообщениеОбОшибке;
		Сообщить(СообщениеОбОшибке);
		ЗаписьЖурналаРегистрации("Документ.ЗаданиеНаДегустациюНовинки", УровеньЖурналаРегистрации.Ошибка,, Ссылка.Ссылка, СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	//первичная рассылка по эл. почте, пока убрал
	Возврат;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктурныеЕдиницы.Ссылка,
		|	СтруктурныеЕдиницы.АдресЭлектроннойПочты КАК АдресЭП
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.Ссылка В(&МассивМагазинов)
		|	И (ВЫРАЗИТЬ(СтруктурныеЕдиницы.АдресЭлектроннойПочты КАК СТРОКА(1))) <> """"");
	Запрос.УстановитьПараметр("МассивМагазинов", МассивМагазинов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	МассивАдресовЭП = Новый Массив;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		МассивАдресовЭП.Добавить(ВыборкаЗапроса.АдресЭП);
	КонецЦикла;
	
	Если МассивАдресовЭП.Количество() > 0 Тогда
		Документы.ЗаданиеТехнологаМагазинам.ОтправитьСообщение(Тема, ТекстСообщения, МассивАдресовЭП, "Задания товароведа на дегустацию новинок");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьЗадачиПоЗаданию(Ссылка, ЗакрыватьЗадачи = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачаНаДегустациюНовинки.Ссылка,
		|	ЗадачаНаДегустациюНовинки.Закрыта КАК ЗадачаЗакрыта,
		|	ВЫБОР
		//+++АК ILIK 2018.08.08 ИП-00019413
		//|		КОГДА ЗадачаНаДегустациюНовинки.Магазин.СтатусТорговойТочки = ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)
		|		КОГДА ЗадачаНаДегустациюНовинки.Магазин.СтатусТорговойТочки В (ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт), ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Приостановлен))
		//---АК ILIK
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МагазинЗакрыт
		|ИЗ
		|	Документ.ЗадачаНаДегустациюНовинки КАК ЗадачаНаДегустациюНовинки
		|ГДЕ
		|	ЗадачаНаДегустациюНовинки.ЗаданиеНаДегустациюНовинки = &Ссылка
		|	И НЕ ЗадачаНаДегустациюНовинки.Закрыта = &ЗакрыватьЗадачи
		|
		|ДЛЯ ИЗМЕНЕНИЯ");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗакрыватьЗадачи", ЗакрыватьЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЗадачаНаДегустациюНовинкиОбъект = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		
		Если ВыборкаЗапроса.МагазинЗакрыт Тогда
			Если НЕ ВыборкаЗапроса.ЗадачаЗакрыта Тогда 
				ЗадачаНаДегустациюНовинкиОбъект.Закрыта = Истина;
			КонецЕсли;
		Иначе
			ЗадачаНаДегустациюНовинкиОбъект.Закрыта = ЗакрыватьЗадачи;
		КонецЕсли;
		
		ЗадачаНаДегустациюНовинкиОбъект.Записать();
		Сообщить("Закрыт документ " + ЗадачаНаДегустациюНовинкиОбъект.Ссылка);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ВернутьТЗнОтветственных(ЗаданиеТехнологаСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Управляющий управления качества"" КАК ТипРолиСтр,
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)) КАК РольПользователя
		|ИЗ
		|	Документ.ЗаданиеНаДегустациюНовинки КАК ЗаданиеНаДегустациюНовинки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (РолиПользователейСоставРоли.Ссылка = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя.Родитель, СоответствиеОбъектРольСрезПоследнихК.РольПользователя.Родитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеНаДегустациюНовинки.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Технолог по качеству"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|ИЗ
		|	Документ.ЗаданиеНаДегустациюНовинки КАК ЗаданиеНаДегустациюНовинки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (РолиПользователейСоставРоли.Ссылка = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя)
		|				ИЛИ РолиПользователейСоставРоли.Ссылка.Родитель = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеНаДегустациюНовинки.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РолиПользователейСоставРоли.Сотрудник,
		|	""Товаровед"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЕСТЬNULL(РолиПользователейСоставРоли.Ссылка, ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|ИЗ
		|	Документ.ЗаданиеНаДегустациюНовинки КАК ЗаданиеНаДегустациюНовинки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры) КАК СоответствиеОбъектРольСрезПоследнихХ
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (СоответствиеОбъектРольСрезПоследнихХ.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ЗначенияСвойствОбъектов.Объект = ЗаданиеНаДегустациюНовинки.ХарактеристикаНоменклатуры)
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ТехнологПоКачеству)
		|					И Объект ССЫЛКА Справочник.Контрагенты) КАК СоответствиеОбъектРольСрезПоследнихК
		|		ПО (СоответствиеОбъектРольСрезПоследнихХ.Объект ЕСТЬ NULL )
		|			И (ЗначенияСвойствОбъектов.Значение = СоответствиеОбъектРольСрезПоследнихК.Объект)
		|			И (СоответствиеОбъектРольСрезПоследнихК.РольПользователя <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
		|				,
		|				ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.БрендМенеджер)
		|					И Объект ССЫЛКА Справочник.РолиПользователей) КАК СоответствиеОбъектРольСрезПоследнихБМ
		|		ПО (ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя) <> ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка))
		|			И (СоответствиеОбъектРольСрезПоследнихБМ.Объект = ЕСТЬNULL(СоответствиеОбъектРольСрезПоследнихХ.РольПользователя, СоответствиеОбъектРольСрезПоследнихК.РольПользователя))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|		ПО (РолиПользователейСоставРоли.Ссылка = СоответствиеОбъектРольСрезПоследнихБМ.РольПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (РолиПользователейСоставРоли.Сотрудник = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеНаДегустациюНовинки.Ссылка = &ЗаданиеТехнологаСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаданиеНаДегустациюНовинки.Автор.ФизЛицо,
		|	""Автор"",
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(40)) КАК НомерТелефона,
		|	ЗНАЧЕНИЕ(Справочник.РолиПользователей.ПустаяСсылка)
		|ИЗ
		|	Документ.ЗаданиеНаДегустациюНовинки КАК ЗаданиеНаДегустациюНовинки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|			И (ЗаданиеНаДегустациюНовинки.Автор.ФизЛицо = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	ЗаданиеНаДегустациюНовинки.Ссылка = &ЗаданиеТехнологаСсылка");
	Запрос.УстановитьПараметр("ЗаданиеТехнологаСсылка", ЗаданиеТехнологаСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
