
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//+++АК kats 2018.03.15 17479
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ВыплатаЗарплаты") И
		НЕ УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьРедактированиеПремийДругихОтветственных, Ложь) Тогда
		Если ЭтоРуководительПодразделения() Тогда
			Утверждающий = ПараметрыСеанса.ТекущийПользователь;
			ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕстьОтборПоУтверждающему", Истина);
			ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Утверждающий", Утверждающий);
		Иначе
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕстьОтборПоОтветсвенному", Истина);
			ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Ответсвенный", Ответственный);
		КонецЕсли;
	КонецЕсли;
	//---АК kats 2018.03.15 17479
	
КонецПроцедуры

//+++АК kats 2018.03.15 17479
&НаСервере
Функция ЭтоРуководительПодразделения()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПраваПользователейНаРедактированиеГрафиков.Подразделение
	               |ИЗ
	               |	РегистрСведений.ПраваПользователейНаРедактированиеГрафиков КАК ПраваПользователейНаРедактированиеГрафиков
	               |ГДЕ
	               |	ПраваПользователейНаРедактированиеГрафиков.Пользователь = &Пользователь";
				   
	Результат = Запрос.Выполнить();
	Возврат (НЕ Результат.Пустой());
	
КонецФункции
//---АК kats 2018.03.15 17479