/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	
КонецПроцедуры // ПриСозданииНаСервере()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//Если ПредставлениеТекущегоВарианта = "По номенклатуре" Тогда
	//	ТабДок = Расшифровать_ПоНоменклатуре(Расшифровка);	
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По группе номенклатуры" Тогда
	//	ТабДок = Расшифровать_ПоГруппеНоменклатуры(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По дате" Тогда
	//	ТабДок = Расшифровать_ПоДате(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По комплектовщику и номенклатуре" Тогда
	//	ТабДок = Расшифровать_ПоКомплектовщикуИНоменклатуре(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По комплетовщику, номенклатуре и складу" Тогда
	//	ТабДок = Расшифровать_ПоКомплектовщикуИНоменклатуреИСкладу(Расшифровка);	
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По комплетовщику" Тогда
	//	ТабДок = Расшифровать_ПоКомплектовщику(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По складу" Тогда
	//	ТабДок = Расшифровать_ПоСкладу(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По ТТ" Тогда
	//	ТабДок = Расшифровать_ПоТТ(Расшифровка);
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По ТТ, номенклатуре и складу" Тогда
	//	ТабДок = Расшифровать_ПоТТНоменклатуреИСкладу(Расшифровка);	
	//ИначеЕсли ПредставлениеТекущегоВарианта = "По складу и номенклатуре" Тогда
	//	ТабДок = Расшифровать_ПоСкладуНоменклатуре(Расшифровка)	
	//Иначе
	//	Сообщить("Необходимо выбрать вариант отчета!", СтатусСообщения.Важное);
	//	Возврат;
	//КонецЕсли;
	//ТабДок.ТолькоПросмотр = Истина;
	//ТабДок.Показать();

КонецПроцедуры // РезультатОбработкаРасшифровки()

&НаСервере
Функция Расшифровать_ПоНоменклатуре(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	
	НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			День,
	               |			,
	               |			&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода),, НоменклатураСсылка));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоСкладу(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	//КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0]].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	СкладСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	//Запрос.УстановитьПараметр("Сборщик", КомплектовщикСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоСкладуНоменклатуре(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	//КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0]].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	//СкладСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
    Попытка 
		СкладСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	Исключение
		СкладСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоКомплектовщикуИНоменклатуре(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	Попытка 
		КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	Исключение
		КомплектовщикСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			День,
	               |			,
	               |			&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |	И РасходныйОрдерСкладТовары.Ссылка.Сборщик = &Сборщик
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Сборщик", КомплектовщикСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода),, НоменклатураСсылка));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоКомплектовщикуИНоменклатуреИСкладу(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	Попытка 
		КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		 
		СкладСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	Исключение
		КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		СкладСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			День,
	               |			,
	               |			(&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ Номенклатура = &Номенклатура)
	               |				И Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |	И РасходныйОрдерСкладТовары.Ссылка.Сборщик = &Сборщик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	СУММА(РасходныйОрдерСкладТовары.Количество) КАК Количество,
	               |	СУММА(РасходныйОрдерСкладТовары.КоличествоУРЗ) КАК КоличествоУРЗ,
	               |	СУММА(РасходныйОрдерСкладТовары.КоличествоТТ) КАК КоличествоТТ,
	               |	СУММА(РасходныйОрдерСкладТовары.Отклонение) КАК Отклонение,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТЗ_ТоварыСвернутые
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |	И РасходныйОрдерСкладТовары.Ссылка.Сборщик = &Сборщик
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Ссылка,
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ_ТоварыСвернутые.Номенклатура КАК Товар,
	               |	ТЗ_ТоварыСвернутые.Количество,
	               |	ТЗ_ТоварыСвернутые.КоличествоУРЗ,
	               |	ТЗ_ТоварыСвернутые.ЗаявкаНаСклад,
	               |	ТЗ_ТоварыСвернутые.Отклонение,
	               |	ТЗ_ТоварыСвернутые.Ссылка.Сборщик КАК Комплектовщик,
	               |	ТЗ_ТоварыСвернутые.Ссылка.Склад,
	               |	ТЗ_ТоварыСвернутые.Ссылка.Получатель КАК ТТ,
	               |	ТЗ_ТоварыСвернутые.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(ТЗ_ТоварыСвернутые.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	ТЗ_ТоварыСвернутые.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(ТЗ_ТоварыСвернутые.Ссылка.Дата) КАК Месяц,
	               |	ГОД(ТЗ_ТоварыСвернутые.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(ТЗ_ТоварыСвернутые.Ссылка.Дата) КАК Неделя,
	               |	ТЗ_ТоварыСвернутые.Номенклатура.Родитель КАК ГруппаТов,
	               |	ТЗ_ТоварыСвернутые.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((ТЗ_ТоварыСвернутые.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТЗ_ТоварыСвернутые.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	ТЗ_ТоварыСвернутые КАК ТЗ_ТоварыСвернутые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО ТЗ_ТоварыСвернутые.Номенклатура = ТабТовары.Номенклатура
	               |			И ТЗ_ТоварыСвернутые.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО ТЗ_ТоварыСвернутые.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ТЗ_ТоварыСвернутые.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И ТЗ_ТоварыСвернутые.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО ТЗ_ТоварыСвернутые.Номенклатура = Остатки.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ТЗ_ТоварыСвернутые.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И ТЗ_ТоварыСвернутые.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО ТЗ_ТоварыСвернутые.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(ТЗ_ТоварыСвернутые.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	ТЗ_ТоварыСвернутые.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ТЗ_ТоварыСвернутые.Ссылка.ПровереноОператором
	               |	И ТЗ_ТоварыСвернутые.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ ТЗ_ТоварыСвернутые.Номенклатура = &Номенклатура)
	               |	И ТЗ_ТоварыСвернутые.Ссылка.Сборщик = &Сборщик
	               |	И ТЗ_ТоварыСвернутые.Ссылка.Склад = &Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Сборщик", КомплектовщикСсылка);
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода),, НоменклатураСсылка));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции
     
&НаСервере
Функция Расшифровать_ПоДате(Расшифровка);
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	
	ДатаАнализа = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Дата = &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Дата", ДатаАнализа);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоКомплектовщику(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	КомплектовщикСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	//НоменклатураСсылка = ;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Сборщик = &Сборщик
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	//Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Сборщик", КомплектовщикСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоТТ(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	ТТСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	//НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И РасходныйОрдерСкладТовары.Ссылка.Получатель = &ТТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	//Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТТ", ТТСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции

&НаСервере
Функция Расшифровать_ПоТТНоменклатуреИСкладу(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	Попытка 
		ТТСсылка = Данные.Элементы[Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		 
		СкладСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	Исключение
		ТТСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].Идентификатор].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		СкладСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
		НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			День,
	               |			,
	               |			(&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ Номенклатура = &Номенклатура)
	               |				И Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |	И РасходныйОрдерСкладТовары.Ссылка.Получатель = &ТТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура = &Номенклатура)
	               |	И РасходныйОрдерСкладТовары.Ссылка.Получатель = &ТТ
	               |	И РасходныйОрдерСкладТовары.Ссылка.Склад = &Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТТ", ТТСсылка);
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции
 
&НаСервере
Функция Расшифровать_ПоГруппеНоменклатуры(Расшифровка);
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//СтатьяДР_Код = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[1].Значение);
	//СтатьяДР_Наименование = СокрЛП(ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение);
	
	ПараметрПериод = Данные.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода  = ПараметрПериод.Значение.ДатаОкончания;

	//КомплектовщикСсылка = Данные.Элементы[Данные.Элементы[Расшифровка].ПолучитьРодителей()[0]].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
	НоменклатураСсылка = Данные.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;

	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПоПоступлению.Номенклатура,
	               |	ТаблицаПоПоступлению.ТТ,
	               |	ТаблицаПоПоступлению.Поступило,
	               |	ТаблицаПоПоступлению.Бой,
	               |	ТаблицаПоПоступлению.День
	               |ПОМЕСТИТЬ ТаблицаДанныхПоПоступлению
	               |ИЗ
	               |	&ТаблицаПоПоступлению КАК ТаблицаПоПоступлению
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛистУчета.Дата, ДЕНЬ) КАК Периода,
	               |	ЛистУчета.ТорговаяТочка
	               |ПОМЕСТИТЬ ПоздноПришло
	               |ИЗ
	               |	Документ.ЛистУчета КАК ЛистУчета
	               |ГДЕ
	               |	ЛистУчета.Проведен
	               |	И ЛистУчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛистУчета.ВремяДоставки МЕЖДУ &ВремяДоставкиНач И &ВремяДоставкиКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |ГДЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Количество КАК ЧИСЛО(15, 3))) КАК КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |ПОМЕСТИТЬ ТабТовары
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
	               |		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
	               |			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйОрдерСкладТовары.Номенклатура,
	               |	РасходныйОрдерСкладТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерСкладТовары.Номенклатура КАК Товар,
	               |	РасходныйОрдерСкладТовары.Количество,
	               |	РасходныйОрдерСкладТовары.КоличествоУРЗ,
	               |	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
	               |	РасходныйОрдерСкладТовары.Отклонение,
	               |	РасходныйОрдерСкладТовары.Ссылка.Сборщик КАК Комплектовщик,
	               |	РасходныйОрдерСкладТовары.Ссылка.Склад,
	               |	РасходныйОрдерСкладТовары.Ссылка.Получатель КАК ТТ,
	               |	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
	               |	НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Распределен,
	               |	ТабТовары.КоличествоВУпаковке,
	               |	РасходныйОрдерСкладТовары.Характеристика,
	               |	ТаблицаДанныхПоПоступлению.Поступило,
	               |	ТаблицаДанныхПоПоступлению.Бой,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ПоступилоУпаковок,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК БойУпаковок,
	               |	Остатки.КоличествоОстаток КАК Остаток,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК ОстСклад,
	               |	РасходныйОрдерСкладТовары.Номенклатура.id_tov КАК N_tov,
	               |	МЕСЯЦ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Месяц,
	               |	ГОД(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Год,
	               |	НЕДЕЛЯ(РасходныйОрдерСкладТовары.Ссылка.Дата) КАК Неделя,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель КАК ГруппаТов,
	               |	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель КАК ВерхГрупТов,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорМн,
	               |	ВЫБОР
	               |		КОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА (РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке - (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДробныеКорПл,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) < 0
	               |			ТОГДА -(ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БольшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))) > 0
	               |			ТОГДА ВЫРАЗИТЬ((РасходныйОрдерСкладТовары.КоличествоУРЗ - ЕСТЬNULL(ТаблицаДанныхПоПоступлению.Поступило, 0)) / ТабТовары.КоличествоВУпаковке КАК ЧИСЛО(15, 0))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МеньшеОтгрузили,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |			ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Бой / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |	КОНЕЦ КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ > 0
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(Остатки.КоличествоОстаток / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ < ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ - ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеХватило,
	               |	0 КАК МеньшеОтгрузилиСист,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоздноПришло.ТорговаяТочка ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) < 0
	               |						ТОГДА 1 + (ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
	               |					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДанныхПоПоступлению.Поступило / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоздноПришло
	               |ИЗ
	               |	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхПоПоступлению КАК ТаблицаДанныхПоПоступлению
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = ТаблицаДанныхПоПоступлению.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ТаблицаДанныхПоПоступлению.День)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Получатель = ТаблицаДанныхПоПоступлению.ТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО РасходныйОрдерСкладТовары.Номенклатура = Остатки.Номенклатура
	               |			И РасходныйОрдерСкладТовары.Характеристика = Остатки.Характеристика
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = Остатки.Период)
	               |			И РасходныйОрдерСкладТовары.Ссылка.Склад = Остатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоздноПришло КАК ПоздноПришло
	               |		ПО РасходныйОрдерСкладТовары.Ссылка.Получатель = ПоздноПришло.ТорговаяТочка
	               |			И (НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ) = ПоздноПришло.Периода)
	               |ГДЕ
	               |	РасходныйОрдерСкладТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РасходныйОрдерСкладТовары.Ссылка.ПровереноОператором
	               |	И РасходныйОрдерСкладТовары.Ссылка.ВидОперации = &ВидОперации
	               |	И (РасходныйОрдерСкладТовары.Номенклатура.Родитель = &Номенклатура
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель = &Номенклатура
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель.Родитель = &Номенклатура
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = &Номенклатура
	               |			ИЛИ РасходныйОрдерСкладТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = &Номенклатура)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	ТТ";
				   
				   
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);			   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));			   
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));			   
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке);	
	Запрос.УстановитьПараметр("ВремяДоставкиНач", '00010101020000');			   
	Запрос.УстановитьПараметр("ВремяДоставкиКон", '00010101070000');	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	//Запрос.УстановитьПараметр("Сборщик", КомплектовщикСсылка);
	Запрос.УстановитьПараметр("ТаблицаПоПоступлению", ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();       
			
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ПересортТоваров.ПолучитьМакет("Расшифровка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьОрганизация = Макет.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//
	//ОбластьШапка.Параметры.Код = СтатьяДР_Код;
	//ОбластьШапка.Параметры.Статья = СтатьяДР_Наименование;
	
	ТабДокумент.Вывести(ОбластьШапка);

	Для Каждого Строка Из Выгрузка Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	
	
	Возврат ТабДокумент;	
КонецФункции



